{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t 0.5 tablets\n\t\t oral\n\t\t MDMA\n\t\t (pill / tablet)\n\t\t\n\t\t\n\t\t   T+ 0:45\n\t\t 0.5 tablets\n\t\t oral\n\t\t MDMA\n\t\t (pill / tablet)\n\t\t\n\n\n\n\nFinally friday arrives, i bought my 30$ mercedes xtc pill. I've been so psyched for this. I decided to take the pill at my friends house. I was nervous so i took half a pill and plenty of water so i did not overheat. Walked to his house which was about 20 minute walk. I got to his house, i was still not feeling it, i was very upset because i thought it was a dud. After 45 minutes from takin the first half, i took the second and boy was that a good idea! 15 minutes after the second half was ingested, the first effects hit me lightly. I began to feel relaxed all over, slight numbness, no mental effects yet. 10 minutes after that i got a rush of energy and began to get up run around and just shooting hoops. I tell my friend i need a cigarette, so we go outside to smoke one. after smoking my cigarette, we begin to walk down the street for some fresh air, thats when i knew i was in for the best time of my life. The grass beneath my feet on his yard felt like a pillow and cushioned my walking. Then we began to walk down the road, and as we are walking i just stop sit down in the sunlight. I needed to go into the sunlight, he tried to make me go further down and i had a temper tantrum. so we sat, and i began to go on and on about what a nice day it was, the sun was out, blue sky, birds chirping, 45 degrees and was just enjoying life. \r\n\r\n30 min after the second half... Physical effects by this time are complete relaxness, it was hard to walk! No metal effets. Some visual distortion such as my friend bouncing around when he actually just stood there. we walk back into the house then i was real mentally and physically fucked up. I sat down and was falling and swaying left and right, my mind was running in all directions shooting out questions like. ' why am i here?' why did i do this? does my friend hate me? do my parents hate me? and whole body was completely light feeling. i almost had to throw up it was so intense and scary. \r\n\r\n15 minutes after this scary ordeal i begin to settle down, i layed down inside his warm house on the rug, touching and rubbing my hands like everywhere, everything was orgasmic feeling. I took a look at my eyes, i look like satan! it was so cool! Then after about and hour laying on the floor, other people come to his house who i dont even really know, but i just conversed with them with no feeling of stupidity, embarresment or consequences, very cool, i loved it, an hour later my eyes still were dialated but effects were over, it was fantastic\n\n\n\n\n\nExp Year: 2000ExpID: 1\nGender: Not Specified \nAge at time of experience: Not Given \nPublished: May 30, 2000Views: 72,253\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}