{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t 1 g\n\t\t oral\n\t\t Tabernanthe iboga\n\t\t (rootbark)\n\t\t\n\t\t\n\t\t   T+ 1:00\n\t\t 2 g\n\t\t oral\n\t\t Tabernanthe iboga\n\t\t (rootbark)\n\t\t\n\t\t\n\t\t   T+ 2:30\n\t\t 5 g\n\t\t oral\n\t\t Tabernanthe iboga\n\t\t (rootbark)\n\t\t\n\t\t\n\t\t   T+ 4:00\n\t\t 8 g\n\t\t oral\n\t\t Tabernanthe iboga\n\t\t (rootbark)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   170 lb\n         \n\t\n\n\n\n\nIboga Log:\r\n\r\nIboga root ground into 31 capsules weighing 16grams total.  Iboga ingested between the hours of 1:30pm-5:30pm  gradual dosage.  This is my first trip w/ Iboga.  There are two sections: 1) The active log within the experience and 2) my conclusions.  My reason for using Iboga was to treat addictive tendencies, to defrag and reboot my central nervous system (neuroplasticity), and because of my philosophical interest in altered states of consciousness.\r\n\r\n*Active Log*\r\n1:30pm  1 gram swallowed with water.\r\n2pm  Noticed physical anxiety followed by weird sensations in the head.  Very mild, but consciousness altering felt  not easily defined.\r\n\r\n2:30pm  2 grams.\r\n3pm  While notable, consciousness altering affects are still very slight.  Perhaps a heightened effect of mental focus and also awareness of the body.  [CNS  Central Nervous System Stimulation]\r\n I have decided to significantly up the dosage and see if I can arrive at more substantial altered states. \r\n\r\n4pm  5 grams (8 grams total).\r\n4:15pm  I am noticing visual hallucinations.  It as if my eyes are refocusing into the finer and more subtle aspects of the spatial field, and it feels like my eye-sight is better than normal.  Intense fluctuations of de-focusing and re-focusing.\r\n4:20pm  Feeling strange  A bit off balance and slightly alien to my body and this world  disoriented.\r\n4:30pm  Its now become hard to read and focus on the things I usually focus upon.  I feel like I am being dropped into a non-linear zone where the left brain is not allowed.  \r\n5pm  Lying on the bed and staring outside, watching tree branches and leaves appear to become various spirits and forms or shapes  mostly spirit people, or unconscious psychological irruptions, or perhaps the Soul trying to incarnate into the psycho-sphere of humanity. But as these experiences and thoughts are normal to me, the manifestation of which is not very significant to the taking of Iboga, it was Iboga that made me feel like just lying down and daydreaming.\r\n5:25pm  A strange vocal thought came to me, as if it were not my own voice, because it said youve got to play the game  This is not psychosis, but rather it seems to be a process of freeing room in my consciousness for archetypal characters to create vague suggestions.  It is as if I let go of some of my belief in the control over my own consciousness, just to release a little bit, that allows some other deep source to have a subtle control over imaginal suggestion.  Definitely synesthesia of thought and hearing, but from a source that did not feel like myself, but cannot be readily identified as unconscious fragments of myself, spirits, or soul.  Its just a mysterious presence entering into me.\r\n\r\n5:30  8 grams (16 total grams ingested).\r\n\t7:48pm  Yeah okay I am definitely on some sort of trip here.  But dont feel like explaining it because typing and computers drain the energy.\r\n\t7:54pm  More strange thoughts.  Dont think about it, just do it!  An apparent call from my deeper self to let my conscious ego-mind understand how to stabilize, and follow the flow (Tao).  The ancient plant teachers definitely are working from the physical (alkaloids) and progressively reaching deeper into my mind, past the conscious Self, to what may be a deeper wellspring, perhaps a source, or maybe a soul.\r\n\t10:31pm  God damn I am tripping balls you monkey space-boy cadets!%^*& Its pouring through me like a fucking hidden wellspring at the center of my being and flushing through to dissolve all psychosomatic layers that need untangling.  Hidden source!!!  Thoughts might sound slightly confused.  Iboga definitely restructures the linguistic cortex, makes memory very difficult, disjuncted thoughts being mowed over for a spring cleaning in my brain.\r\n\t11:30pm  I can see my aura.  There is a glowing light body  perhaps aetheric  That I can see around my body.  It follows the movements of my body and is shaped just like it, like a life force, a subtle energy that must make this physical animal have the ability to move and do stuff.  I find that I see the aura best when looking into the distance.  Bringing all conscious attention to the area I look at makes the aura shrink or disappear.  But if my gaze is out in front, my peripheral system sees the moving light-filled glow of the aetheric body.\r\n\t11:39pm  The fact that I went from contemplating the aetheric fields to searching on Google Why does poop float sometimes?  Merely suggests that this plant is working on ALL the levels of existence, from shit to gold.  Or perhaps, I am just a strange one.\r\n\t2:36AM  Streamers are extremely and confluently roaming around my field of vision.  I sense my body being a bit exhausted, but my mind is in a dazzled buzz.\r\n\t2:27pm  Just woke up  tough night sleep.  Feel dizzy.  Mental hallucinations significantly reduced, but still traces of visual streamers.  Mostly I just feel the presence of the plant deep in the body.  It makes me cough if I want a cigarette, as if it has made me more sensitive to the damage that it does to my lungs.\r\n\t4pm  It appears this will last into the rest of the day, but continue more subtly for the next few days.  \r\n*Active Log End*\r\n\r\n**CONCLUDING REMARKS**\r\nI am glad that I used a gradual approach to taking the Iboga.  It prepared me for what to expect and comforted me to know my body could handle each successive greater dose.  Paranoia was greatly reduced.  I cant imagine doing more than 16 grams, as this trip is still going more than 1 day after, albeit more subtly.  Peak trip was 8-9 hours, fairly exhausting.\r\n\r\nWhile I dont recommend Iboga for its visual hallucinogenic abilities (stick with DMT or Shrooms), its ability to tap deep into the central nervous system has profound psychosomatic benefit.  The cognitive hallucinations, or better yet, the way it allows one to move more fluidly through the imaginal is very helpful and fun.  It also allows the witnessing observer to step back from the usual egoic role and be much more careful and sensitive to ways of behaving.  I found myself not only being more careful with cigarettes and how they affect my breathing, but also moderating eating habits, cleaning habits, and deepening general awareness of my embodied perception.  Additionally, I became much more in control of my emotions and treated certain people more patiently and forgivingly that I would have in ordinary consciousness.  It is as if one moves into a deeper Self and can see all the better ways the ego self can behave and react  and actually do it!  If this will have a lasting impact, we shall see, but I sense that in some form or another, it will have longevity.\n\n\n\n\n\nExp Year: 2013ExpID: 100120\nGender: Male \nAge at time of experience: 32 \nPublished: Mar 1, 2015Views: 2,902\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}