{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t   \n\t\t oral\n\t\t Ginger\n\t\t (extract)\n\t\t\n\t\t\n\t\t   T+ 0:20\n\t\t   seeds\n\t\t oral\n\t\t Syrian Rue\n\t\t (ground / crushed)\n\t\t\n\t\t\n\t\t   T+ 0:20\n\t\t 11 g\n\t\t oral\n\t\t Mimosa tenuiflora\n\t\t (rootbark)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   155 lb\n         \n\t\n\n\n\n\nFuck it, might as well go big.  Cavalier attitude that could only come from someone whos never actually experienced Ayahuasca firsthand.  Dean had drunk Ayahuasca on seven previous occasions and, as I would learn later, this prepared him to handle the brews effects in a way that was impossible for me to do.  We had decided to take a large dose at the high end of the scale in order to explore the outer limits of the experience.  What follows is the story of a first-time user, me, the following day.\r\n\r\nWe tried a recipe new to Dean using Syrian Rue flower seeds (Peganum harmala) as an inhibitor to make the DMT orally active.  The plant containing the DMT was the inner root-bark of Jurema (Mimosa tenuiflora), a species related to the Acacia.  The recommended dose was 3-12 grams of root-bark as advised on the site we consulted\r\n\r\n'Between 3-12 grams of Mimosa hostilis root bark. Start low with the quantity of mimosa until you have identified the potency of the batch you are working with.'\r\n\r\nWe completely ignored the warning regarding the potency.  This is important in retrospect because there appears to be a difference between root-bark, inner root-bark, shredded and powdered.  We were working with powdered premium inner root-bark, the most potent form.  Feeling confident, we opted for the higher end of dosage at approximately 11 grams each an overwhelming dose for a first-timer as it turned out.  Dean had a feeling I didnt know what I was getting myself into.\r\n\r\nAfter two days of brewing and refining our brew we had our elixir ready and heavily saturated with DMT Juju.  I was more excited than I thought I would be and when Dean called to cancel due to medical reasons I was crushed.  I slept really early that night and the next day felt depressed and completely miserable.  Im happy we didnt do it that night either however.  Two days later, with Dean back on the island and somewhat restored, it was launch day.  Tracy, a respected and accomplished yoga teacher came by and offered some counsel on a meditation technique I had been working with and we discussed Ayahuasca, shamanic approaches to the spiritual quest and shared experiences and views which really were quite grounding.  I promised to tell her how the experience played out.  Little did I realize what an absurd impossibility describing the Ayahuasca experience in any real meaningful manner would turn out to be.\r\n\r\nI had talked my buddy Victor into sitting for me, offering stupid advice like if we get out of hand to just say thats nice, now go back to the music or some such shit.  Vic picked me up and we drove to Deans place, a rustic wooden bungalow on a hillside at the edge of the forest overlooking the valley.  Dean had two small glasses of pure raw ginger extract waiting to help with the inevitable nausea.  We pounded that back and twenty minutes later placed ground Rue seeds under our tongue, washed back with water.  The seeds werent unpleasant at all and no nausea followed.  I ate a little bread anticipating that it might help with nausea which turned out to be a mistake as it potentiated the Jurema extract that I drank shortly thereafter.\r\n\r\nNext, it was time for the DMT-containing Jurema extract.  I had been warned about the taste but it really has to be experienced to be believed.  I took a small sip just to get accustomed to it so I wouldnt reflexively vomit it back up.  The sip helped.  I shot it all back, chased it with water and a sip of orange juice just to clean the taste out of my mouth.  I liken it to a muddy earthy chemical taste that wasnt as horrific as I had expected but was in no way pleasant.  Id had worse tequila.  After about 10-15 minutes I felt my stomach churning a little bit and I was becoming a bit heady so I told the boys I was going to lie down inside the bungalow on Deans bed.  No nausea just the feeling that something strange was beginning to happen.\r\n\r\n+ 15-20 minutes\r\n\r\nThe first sensations came on like electric tingles of blue light down my limbs and a narrowing of vision.  I found it odd that my face felt like it was being squeezed.  I told Victor that the onset felt very similar to the effects of getting choked out just before losing consciousness that sometimes happens when training Jiu-jitsu.  I was in well-trodden territory here as the sensations were similar to a come-up on ecstasy but the similarities ended right there when colored fractals and brilliant geometric swirls engulfed my close-eyed vision.  For a while, I could ground myself by opening my eyes but found it fascinating that the second I closed my eyes this amazing high-definition light show completely took over.  \r\n\r\nThen came the vibration which would remain the overriding quality at the core of the experience for the rest of the evening.  The vibrating began as a tingling all over my body that felt amusing initially, but the intensity seemed to be building fast.  I remember thinking is this really all there is?  This is just a psychedelic trip, just drugs, nothing really poignant here.  Ill ride it out but not overall impressed.  That was just before things really kicked in.  What I had experienced so far was nothing compared to what followed.  Next came the crackling buzzing sounds and I realized it was coming from within me as if every cell came alive and began radiating electrical energy.  Then I realized everything was vibrating and buzzing and interconnected with everything else like an electric grid or net.  Codes, alphabets and geometric shapes created fractal trails in fantastic colors, but what I was completely unprepared for was the physiological sensations, a whole-body buzzing and vibration of the deepest purple at a wave-rate in nano-seconds.  \r\n\r\nInitially this was all very technological, as if I was simply a circuit on a global mainboard processing information and energy. \r\n\r\nSwirling, twisting, writhing, exploding I was lifted up, tossed about, smashed and ripped apart as if riding a cosmic roller-coaster in a space where up or down didnt exist to a point where, in a moment of clarity I thought to myself this is waaayy too fucking much for me to handle  I would later understand that we were just getting warmed up.  Theres no mercy here.  I struggled to hold on to any sense of self any frame of reference. Theres no mercy here.  I struggled to hold on to any sense of self any frame of reference.  Deans voice rang out from the distance like an amplified echo theres some jolly ol visuals here which I believe qualifies as the understatement of the millennium.  I was able to look over at him and he was fucking sitting up!  How is that even possible?  Here I am completely engulfed in an ocean of hyperspace with parts of my body broken into a billion pieces buzzing and generating geometric patterns at light-speed; surrounded by intense sound and vibration from every tiny atom in existence creating and stimulating an electric multi-dimensional grid.  jolly ol visuals just didnt seem to cover it.\r\n\r\n+ 30 minutes\r\n\r\nThen came the beings, gentle and playful in warm colors that seemed to be connected to my bodys energy centers.  I became aware of my stomach just vibrating out universes, then came this billion petaled golden crystal flower with hints of orange and red pulsating worlds from my heart that smashed and merged into the existence of everything else.  From time to time the happy-faced beings coming from these swooped over me laughing and saying youre not ready yet then another would say something like he will be, dont be so hard on him or something to that affect.  They said this without words.  This was followed by an incredible greenish-blue crescendo of crystal fractals in a wave that stopped at my throat.  \r\n\r\n+ 45 minutes\r\n\r\nDean was under the impression at this point that it was a mild trip, but when he looked over at me I was completely gone ooh-ing and aah-ing at the experience unfolding.  Dean just sat there as it came on.  After about 15 minutes he began to experience jewels and diamonds, angular symmetrical patterns of purple, blue and red and just marveled at the jewel-like nature until being transported to a void or space with red stars; beautiful but lasting just a short time.  Up to this point he could still open his eyes with no distortion.   \r\n\r\nMy closed-eyed visuals were swirls of brilliantly colored paisleys of unimaginable vibrancy that soon remained, even when I opened my eyes.  Dean said my hands were moving around in space when he looked over.\r\n\r\nDean, convinced due to his slow onset that it was a mild one, went out to grab a piece of flat-bread to kick things in.  He didnt want to tell me that he thought the peak was over.  I remember him munching the bread thinking whats wrong with Dean, how can he not be feeling this?  Amid waves of blue electric light and energy emanating from my body, I hear Dean in the background say Wow, this bread is quite tasty! sounding really surprised by it.  Thats when he looked over and saw that my body had become a blurry mess and my head had become swollen and distorted.\r\n\r\nBy this time, everything reversed from geometric patterns being directed towards me to me being sucked down a drain-hole of colors and motion, but it wasnt my body that had ceased to exist as a coherent thing long ago.  The vibrating parts that made up my body were indistinguishable from mind or consciousness as I would reflect afterwards.  I was swirling and spiraling down, then up, then around mercilessly as if I was a microbe in a giant cosmic washing machine and tumble-dryer vibrating and generating light, color and sound.\r\n\r\nI tried to sit up just to get some sense of self; big mistake!  I remember realizing that I must find which way is up, which resulted in my awareness of actually being motion-sick!  Wham!  I felt like I got hit by a planet hurling through the cosmos!  I was on my hands and knees retching violently into the bucket; dry-heaving with an intensity that must be witnessed to be believed.  But I wasnt there; I was engulfed in patterns and broken down to buzzing bits and pieces.  As I attempted to will my consciousness to reunite, I became aware of a weird tremendous building orange and multicolored universe happening around my lower abdomen my bowels were going to evacuate!  I tried to command my body to come together in an effort to make it to the bathroom, which at the time was another galaxy or universe of spinning planets and geometric snaky swirling patterns.  Thank fuck I made it to the toilet!  I could hear Dean chuckling at the bathroom noises from another galactic sector far, far away.\r\n\r\n+ 1 hour\r\n\r\nFor Dean it just kept building stronger and stronger, he ate a bit more bread, worried that he may have eaten my piece, before becoming fascinated by the stream of light entering the bungalow door  the force building and building.  He watched the wood-grain in the door come alive with motion.  He looked down and his feet had turned into a blurry hairy club  legs  feet  body.  This is when he began to reassure himself that it was just really powerful psychedelia.\r\n\r\n+ 1 hour 20 minutes\r\n\r\nThat was the first wave - things settled down a bit after it passed.  I remember Dean saying something and I could clearly see what he was saying before he said it.  I could see Victors thoughts and felt as though I could actually communicate mentally if I could keep my wits enough, but that was impossible.  Then the second wave hit with equal force.  There was something playful and somewhat devious about everything going on.  \r\n\r\nI began to see feline figures and a diaphanous ethereal woman slip in and out of view.  At one point the entire notion of creation of the universe, a separating of matter and energy that must re-combine as a singularity appeared to me but was so powerful and overwhelming I needed to turn away.  There was an intelligence, pattern and energy fluxing and vibrating and connecting every atom and I remember thinking that it just might be possible to take a picture of this and how could Victor be oblivious to the tremendous noise, crackling, buzzing, zapping and vibrations all engulfing us and penetrating our bodies and being generated out of us resonating infinitely outward as concentric geometry into oblivion.\r\n\r\nI looked for the akashic library and the female figure showed me what looked like crystal cubicles along the inside of a spherical wall that shimmered and vibrated and exploded out into nothingness and I thought to myself well there are certainly no books here.  It was at this point that that second wave swept over me completely destroying me once again. It was at this point that that second wave swept over me completely destroying me once again.  Holy-fuck when will this end? I thought to myself.  Conventional time had long ceased to exist for the stuff that was me, but I sensed millions of years pass in this machine-like technical energetic reality where thoughts and ideas became vibrations and things bouncing, colliding and merging with an infinite network.  I was aware that I wouldnt die; the concept just didnt make sense in this space.  In fact, conventional language was completely inadequate and made little sense anymore.  I saw and felt and vibrated a new form of communication that transcended anything I had previously known.  But these realizations came as wisps and ghosts in the midst of energy and turbulence.  I was becoming lost to myself and engulfed in the experience.\r\n\r\nI think I began retching again and attempted to go to the toilet -thinking that my ass hitting the toilet seat would ground me a bit, but no fucking way.  It merged with the toilet seat in a brilliant kaleidoscopic display of vibrating colors and sound pouring out into the universe of which I had become.  I was out of it, when I looked up and saw Dean in the door saying Are you okay?  I dont think being in here with all this bright light is doing you any good at all.  Just pulling my shorts up was a chore.  My hands melted into my shorts which wouldnt come up but the sensation created galaxies of energy and color.  Fuck, if I could just get back to the bed.  Being up and doing things seemed ridiculous with all this going on.  How magnificent that a human can even experience this!\r\n\r\nI heard Dean say something about snooker-balls, but later Dean remembered only thinking the thought.  He must have forgotten saying it aloud; the alternative seeming impossible.  Dean looked over and my head had completely disappeared.  The hut began swaying and swinging breaking apart into horizontal slices he began rubbing his legs to regain focus, but then his hands turned into warty knobby stumps as he looked down at them.  Total body disintegration that Dean would later describe simply as shattered to pieces and meshed into color.       \r\n\r\n+ 1 hour 45 minutes\r\n\r\nDean pulled his colorful mushy shattered to pieces body together to go to the bathroom and pour water on his head.  He grabbed me and helped me to the bathroom to hold my head over the sink (which caused my head to melt into its red-green-blue crystalline structure  it was a white sink) to put water over my head too.  He must have noticed the effect because he chuckled Oh, no, that didnt help at all did it? Maybe that was a mistake and left to get a towel outside.  He explained to Victor Yep, its a strong one! in an attempt to reassure Vic that everything was okay.  The towel was a completely new feeling setting off a chain of galaxies created from the sensation and I had a hard time making it back to the bed.  Dean decided to stand up and stretch in an attempt to maintain control and be strong against what he was experiencing.  He then sat down and began laughing at the enormity of it all.\r\n\r\n+ 2 hours\r\n\r\nWhen are we coming down? I asked, secretly hoping Deans experience with Ayahuasca would provide some hope of respite.  I think were in for a long one was his only reply.  I cant believe youre moving around I said.  Time seemed to just fly by but I was experiencing eternitymillions of years eons, one after the other.  We were both immersed in a machine techno-space in high definition being turned and flipped end over end.\r\n\r\nDean sat down on the bed when, as he explained later,  a huge great crocodile went sliding past, which he described as the slowest crocodile ever, which turned toward him gazing in a curious yet disinterested way.  Dean later remarked, I got club feet, club legs, clubbed bloody everything!\r\n\r\nWe both remained absorbed in ecstatic bliss for quite some time.  There was a definite intelligent presence, a fantastic symmetry of fractal geometry intermeshed with sound, color and vibration.  Music was coming from somewhere but seemed trivial and mundane compared to the cacophony of multi-dimensional geometrically-colored sound buzzing and emanating from every atom around us.\r\n \r\n+ 2 hours 30 minutes\r\n\r\nIt was around this time that the last powerful wave subsided enough for us to communicate with each other.  \r\n\r\nI recalled a scene from the documentary DMT  The Spirit Molecule, where Ayahuasca was being described as a gentle experience.  I was shocked upon remembering it.  There was nothing gentle about THAT! I exclaimed.  We both began laughing\r\nNope Dean agreed.\r\n\r\nGwion told me just to breathe through the heavy part I said, how the FUCK can you breathe through THIS?!  Theres no breathing through this!  Im going to try and pull my body back together to go take a shit.  In this state, body and mind are completely fragmented and it takes sheer force of will to pull ones body and consciousness together into a coherent whole, and even then its not all back together.  I tried to sit up by my energetic body simply would not vibrate in sync with my physical one, as if it wanted nothing to do with it like putting the wrong ends of magnets together.  Then I fell over onto my other side, my physical body melting into the bed and my energetic one vibrantly exuding a million volts of energy in waves out into the ether.\r\n\r\nVictoryou still out there I called out?\r\n\r\nYep, still here he replied calmly.\r\n\r\nThank fuck for that.  Victor, did you feel any of that!?\r\n\r\nNo\r\n\r\nI cant believe you didnt feel any of that!  Well it felt you you were in it it went right through you brother! I said with conviction.  I had watched the interplay of high vibrating sound-energy-color engulf all of the 3-dimensional stuff around me  including Victor although he was oblivious to it all.  At the time it seemed that his brain could only pick up a narrow frequency, tuning out most of what he was engulfed in.  Dean and I were picking up the entire band-width.  In retrospect, Im actually terrified at the thought that anyone could experience more than this.  The material world seemed completely trivial and mundane and overly simplistic compared to the amazing techno-sphere interplaying with it in which Dean and I were immersed.  \r\n\r\nThe inherent dualism required in order to attempt any description using conventional language suddenly became a tremendous source of annoyance and frustration to me.  How utterly inadequate language was to convey all of this  \r\n\r\nVictor asked something about my body  What fucking body?  Its in a million pieces.  I want my mommy I joked.  I cant even force myself to go take a shit\r\n\r\nThis is the last time I listen to your dosing suggestions, Dean said to me jokingly.  I had been excited to do a heroic dose.  I had no idea the enormity  Mine was pure fucking geometric patterns  Someone asked Who would do that to themselves?\r\nI dont know Im going to attempt another shit.\r\n\r\nWe joked around about the toilet, Dean pouring water on my head and me sitting catatonic unable to get up or pull my pants up earlier in the evening with Dean saying something like I dont think the bright lights are doing you any good (fits of laughter)  Theres bright lights everywhere! I said, which was true from my perspective.  My body was radiating brilliant lights, all colors of the spectrum and some that dont really exist - in Technicolor (more laughter)\r\n\r\nTheres just no maintaining ones dignity!  not even a chance! I said.  Anything to make it stop someone needs to get on a chat board and say never do that [dose], its too strong I was in a million pieces in the stratosphere.  I cant imagine doing that in a room with 12 people and 1 toilet! (setting off a new round of giggles and laughter)  I could hear Victor laughing outside.  \r\n\r\nThat sense of vibration! I would repeat a few more times in awe, marveling at the intensity of physical whole-body sensation that was still with me.  We discussed our visions, some of which included cats and girls and neon message-boards of Dean and Victors thoughts that could easily be read during the peak of the experience.\r\n\r\nI was wondering if Victor came in, would he see me as I see me?  Would he see the million pieces that needed to be put back together?  if I just let those pieces go you wonder if humpty-dumpty can ever be put back together again... and its not even your body its hard to explain.\r\n\r\nIts not a party drug! I exclaimed which sent us into fits of laughter, not necessarily because it was funny, but rather because of the enormous truth of the statement. Its not a party drug! I exclaimed which sent us into fits of laughter, not necessarily because it was funny, but rather because of the enormous truth of the statement.  We giggled our asses off at that.\r\n\r\nthe geometry though, the sound of the gecko said Dean halfway to himself musingly.  I could hear Victor lighting a cigarette or whatever, it was good to know there was a reality it was comforting to know reality was there.  I just vibrated in a million ways you could see everything was linked together.\r\nI gave up opening my eyes a long time ago.  A million billion years have gone by Im just trying to put my body back together.  I was ahead of you, even Victor, I could see your thoughts I explained to Dean.  Dean, dude your thoughts were scrolling across in front of me in neon green letters, Victors thoughts had kind of an orangey color to them.\r\n\r\nWhy would human beings do that to themselves? I said mostly to myself, knowing full well that I would repeat this experience again.  It was at this point that I came to the conviction that this was quite possibly the most intense and powerful experience possible for a human-consciousness to undergo.  I remember thinking that being burnt at the stake or getting eaten alive by a tiger couldnt be more extreme.  I can understand where awe and reverence comes from I said, mostly to nobody  just expressing wonderment.  I think I can pull myself together enough to go sit in a chair.  We went out on the balcony to sit with Victor. \r\n\r\n+ 3 hours \r\n\r\nJudging by the look on Victors face, I must have looked a disheveled mess.  We sat outside for a while going over the experience.  I thought about Gwion on the phone the other day saying he wished he had a bit more Ayahuasca at the moment.  When Gwion said he wanted more of that, he certainly was NOT talking about this experience, thats for sure I said referring to the sheer overwhelming power and intensity of high-dosing.  Recalling earlier Every chakra is there, man! although experiencing the two chakras in my head put me right over the edge earlier, just before the intense retching.  Felt like my brain exploded.  This was just right after the orangish-yellow happy beings laughing at my not being ready and the greenish-blue crystal explosion in my chest and throat.  Head exploded then the retching.\r\n\r\nMy legs got really hairy then started to blend in with the sheets said Dean.\r\n\r\nWhen I was retching and shitting I was just seeing a kaleidoscope of colors I replied.\r\n\r\nVictor was sitting down across the table from me and blew out some cigarette smoke which just hung in the air.  Does this smoke look weird to you now? he asked me. \r\n\r\nI cant even look at it now I replied the vibrations and colors are too intense.  Theres no going back to the music now!\r\n\r\n+ 3 hours 15 minutes\r\n\r\nDean was cutting a Papaya.  I thought it might be a good idea to have some orange juicewrong!  The sugar just kicked everything back in.  I went inside to lay down for a bit and ride it out.  \r\n\r\n+ 3 hours 30 minutes\r\n\r\nDean and Victor began discussing peyote and other trips in the woods just outside Bangkok.  Victor and I both couldnt believe how coherent Dean was, as if he wasnt affected at all.  We mentioned it to him.  Dean replied that you just have to be strong against it.\r\n\r\nYou cant be strong against THAT!  were we having the same experience? I said rather indignantly from inside the room; obviously incorrect because Dean had demonstrated perfectly well that it was possible.  He hadnt retched or shit even once and had remained upright and even moving most of the time to my astonishment.\r\n\r\nYou just have to show it your fists said Dean from outside.\r\n\r\nMy fists were in a million pieces I called back.\r\n\r\nDean was eating Papaya which kicked things back into motion a bit as he would later reveal.  It was like a psychedelic sledge-hammer! Dean explained to Victor attempting to describe the peyote.  I thought he was referring to this experience\r\n\r\ndoesnt even do it justice! I called from inside.  I remembered the retching thinking If I could avoid this, it would be nice.  Victor and Dean talked a while longer and I got up and sat in the doorway.  Victor gathered his things to go  he had a date waiting for him.  I was convinced that the sun was about to come up.  I didnt realize that it was just 2:30 am.  It seemed like a million years had passed by.  \r\n\r\nIt may give the impression that we were trivializing the experience by having a bit of a laugh, but that seemed like to only reasonable response to the enormity of the experience. It may give the impression that we were trivializing the experience by having a bit of a laugh, but that seemed like to only reasonable response to the enormity of the experience.  Just writing what Ive written seems absurd because it details the set and setting relatively accurately, but that is just the packaging.  It feels as though something very powerful, poignant and meaningful took place yet its hard to pinpoint just exactly what.  Its as though youve gone on a very long journey, seen new sights, made new friends and returned to tell the story.  Youre not the same person as when you left, but if asked just exactly how youve changed well thats very hard to pin down.  \r\n\r\nVictor asked me as I was sitting disheveled in the doorway whether I would do it again fuck no, not like this was my reply.  The next day after sleeping off the exhaustion I would completely change my mind.  Absolutely and for certain is how I feel about it now.  And Im looking forward to it.  \r\n\r\nAttempting to encapsulate such a potent and moving experience like Ayahuasca in a few poorly written lines is ridiculous in retrospect.  The most detailed descriptions could only scratch the surface; it would leave the greatest poets tongue-tied.  Attempting to capture the depth of the experience in art is just as futile; serving only to entertain the uninitiated.  Poetry or art is only three-dimensional at best.  Three-dimensionality is trivial in the face of the multi-dimensionality of the Ayahuasca experience.  \r\n\r\nMy single and overriding hope by recording this experience is that others will be inspired to take this very important step.  I feel as though Ive crossed a threshold, eaten of the forbidden fruit, explored an extremity of consciousness; a journey which can only be taken personally, hopefully with humility and respect.  It was magnificent and terrifying at the same time.  My impression is that we were working with a technology that allows one a brief glimpse of the world of energy as opposed to the one of matter in which we all reside.  As if a new sense had been unlocked.  I stand in reverent awe of this experience and realize that it was just an initiation.  The journey begins here.  They say that Ayahuasca gives you what is needed and not necessarily what is desired or expected.  This turned out true in my case.  I needed to learn respect for it and that is exactly what happened.  I got slapped in the face, put in my place and then hugged gently.  I wanted desperately to have an Ayahuasca experience, I had asked for a strong dose; it turned out to be a heroic one as they say, be careful what you ask for.\r\n\r\nDean and I sat outside marveling at the enormous power of the experience for a while before giving ourselves over to glowing shimmering exhaustion.  Tomorrow I am reborn.\n\n\n\n\n\nExp Year: 2011ExpID: 100333\nGender: Male \nAge at time of experience: 43 \nPublished: Sep 25, 2015Views: 1,584\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}