{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t 5 mg\n\t\t oral\n\t\t DOC\n\t\t (liquid)\n\t\t\n\t\t\n\t\t  \n\t\t 2.5 mg\n\t\t oral\n\t\t 5-MeO-MIPT\n\t\t (liquid)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   130 lb\n         \n\t\n\n\n\n\nSet - My flat \r\n\r\nSetting - Spent the last 3 days removing myself from my daily medication and Cannabis usage. Ate fruit and veggies more then usual along with healthy meals and even healthier in between meals. \r\n\r\n- Did not eat anything 18 hrs prior to ingestion - \r\n\r\nBackground - I suffer medically from CF (Cystic Fibrosis) and mainly have concerns medically with my digestive system. I have had several experiences with numerous psychedelics such as: LSD, MDMA, 2C-C-NBOMe (25C-NBOMe), 2C-I-NBOMe (25I-NBOMe), 2C-C-NBOMe (25C-NBOMe), 2C-E-NBOMe (25E-NBOMe), 2C-D-NBOMe (25D-NBOMe), P. cubensis, P. galindoi (Philosopher stones), Amanita muscaria (Fly Agaric), and DOC as well as 5-Meo-Mipt prior to this experience (alone and in combination). \r\n\r\nThe Beginning - \r\n\r\n+0:00 - A 5ml solution of DOC (ratio'd @ 1mg/1ml) and then a 1.25ml solution of 5-Meo-Mipt (ratio'd @ 2mg/1ml); is measured and poured into a 8 oz glass of Sprite.\r\n\r\n+0:15 - (+/-) 'Electrified' feeling of energy has began to surge through my epidermis. \r\n\r\n+0:35 - (+ +/-) 'Electrified' feeling has began to pick up in 'voltage', very stimulated. Nausea has creeped in, and my mouth has began to water.\r\n\r\n+0:40 - (++ +/-) Went from laying down to standing up much to fast, head-rush is overwhelming, but the need to purge was much more important then the worry of a head-rush. My brain vibrates with a sudden pressure and my ears ring to the point of complete droning of all sound and my vision goes black. I feel around for the trash can and start the horrid ritual of 'The Purge'. My vision returned to me and the ringing along with pressure have ceased.\r\n\r\n+1:00 - (+++) My god. The intensity of light has greatly from 30 minutes ago. Shine, movement, and depth has infected everything at this point. There is a etched screen-like pattern overlapping the surfaces; Much head noise. \r\n\r\n+1:30 - (+++ +/-) I'm assuming that I have came to peak. Visually, the world is alive with the infections. Objects have also decided to morph into each other, but once they do, my recognition of the items that are now, and where; are lost to me. I've become more sensitive to the temperature in the room and decide to turn off the fan. What a ride! Walking was more of a staggering, joker-faced grin wobble to the light switch. I stand there, my torso cocked to the side, almost standing at an angle. There is so much stimulation the only way I feel to calm it down is to lay back down and relax.\r\n\r\n+1:35-?:00 - (++++) I turned off all the lights, unplugged all electronics in the room, and anything else that could possible make a bit of sound. - I had decided prior to the trip that tonight was going to be about exploring the ominous sound I had heard so many times before tripping, but didn't truly acknowledge until my last trip on my DOC + 5-M-Mipt combo. Even then, once I had finally 'heard' that beautiful vibration I really didn't know what it was. - I laid onto my bed comfortably and closed my eyes. What first took my breath was the CEV's! Such spiraling patterns! Tactile infusions of swaying proportions. A few minutes, and the head noise began to pick up in volume and in pitch. It had became a constant slightly high pitched ring. I lay there, half annoyed, half amused at the sound and decided to more or less 'drift' into a conscious observation of myself. As I did so, the pitch began to slowly drop in pitch. After awhile, it had reached a dull vibrational drone, like pulling a very long rubber-band and pulling the 'chords' to produce the vibrational noise, but in the tone of the classical 'Om'. It no longer changed pitch and it played constantly. But, when I would open my eyes, it would distract my focus and would become more then back-ground noise, rather then a personal concert. \r\n\r\nMy OEV's where very strong still. I closed my eyes, and re-adjusted my focus. Almost instantly the 'Om' was back and in full concert again. This time, there was more then just the vibrational noise, but voices. Their were female voices in a soft and cheerful-melancholy tone. They would talk slightly behind each other, adding a echoish type effect, but they would go out of key from each other and the sound would sway. They began asking me questions of my honesty, faith, and finally my opinion of their music and what my purpose was to 'find' it. I could not answer, but as I thought of their questions, my answers came, and they knew them as they had been recited from within to my thoughts. On the last question, they stopped talking, and there was no longer any voices but the 'music' of 'Om' continued. Suddenly, it boomed with intensity and my CEV visual field exploded in color and brightness, suddenly I had the internal feeling of being projected, and moving along at a great speed. Swerving and dodging obstacles as I came past them, but I was only being 'driven' through my patterns. So as they folded inward on themselves, I too took the plundge and ventured to the next layer beyond the fold. Layer after endless layer I repeated this, while the sound now became more then just a beautiful 'Om' but a powerful climax to the concert. Booming and clashing, evermore while playing 'Om'. I lost focus and my thrusting force slowed and the concert no longer boomed and clashed, but returned to the ominous 'Om'. Thrilled by my experience, I attempted to re-focus, and was greeted with the return of my 'drive' and the music playing with.\r\n\r\n+?:00-4:00 - (+++ +/-) My focus began to dwindle at some point, and my drive had seemed to run out of gas. The women's beautiful music continued to play, but my climactic concert had ceased. I continued to lay there, eyes closed, focus drawn towards the sound. I had the thought of adding my own 'addition' to the song and I could hear it along side the vibrations. I suddenly had this vast library of sounds from my entire life. I could recollect them all, as if turning a dial on a radio-tuner and each station had its very own noise or snip-it of sounds. I layed there for what seemed hours, going through the stations and browsing my library, adding sounds and loops as I saw fit. I was 'awoken' by my dogs barking outside. This threw me into a state of shock, terror, and anger. What could possibly be the cause of my dogs barking at 4am? I knew the fields surrounding us where no strangers to Coyotes and my first assumption was that they were trying to inspect the yard; but the dogs didn't exactly like the idea. I jumped to my feet, this time with no head-rush (Thank goodness), and flew down my stairs to the door. I could feel the alertness and protective tone of the dogs' barks, and it calmed my terror. I opened my back porch door and inspected the surroundings and the dogs. Nothing out of the ordinary, but wait! Shadows moving in the fields? Or was it the grass? Tree branch limb shadows maybe? The idea of whatever could possible be frightened me and I shut the door and retreated back upstairs.\r\n\r\n+4:10-6:00 - (+++) My dogs continued this alerted barking fit about every 10 minutes for almost the next 2 hours. For about an hour, I jumped up from my 'radio/library' trance and swiftly bolted down to stairs to see the intruders. Each time, to no avail. I had become sick of the game and assumed I was either tripping WAY to hard to be considered sane or that the dogs really had no idea what was in the field either. So I decided to stay outside, in my boxers, enjoy the scenery, and await the dogs alert to the intruders. The moonlight and stars were absolutely gorgeous. It twinkled and gleamed with intensity. I became impatient and decided to patrol the borders of my yard with the dogs and try to get a glimpse of something. As I did my drunken like stagger with my half cocked stance, I drooled. I drooled for no apparent reason, on myself, in the breeze onto the dogs; I didn't care, I was enjoying the energy of nature and had no idea I was doing it (until the breeze picked up a bit more and I felt the crisp feel of my saliva all over the side of my face)  No more barking, no more alerted barking fits. Was I really just placing it all in my head? Disgusted not to see the mysterious intruders, I went back inside and returned to my bed. \r\n\r\n+6:00 - 14:00 - (++ +/-) I went back upstairs and returned to my trance. The dogs continued to set off fits of alarm about every 10 minutes but I simply was much to angered that the intruders didn't want to 'show' themselves to me. So my focus stayed on my musical trance. At some point of all of this, I either fell asleep, or too deeply focused and just shut everything out. I opened my eyes and sat up quite quickly, to be greeted with the sunlight in my window. \r\n\r\n+14:00 - 18:00 - (+ to a -/+) On cue as always, I began to taper down at around the 14 hour mark. Visually, there was still the enhanced brightness and crispness until about the 15 or 16 hour mark. \r\n\r\n+18:00 - (-/+) A little wired, nothing much. But I feel the need for a true sleep itching at the back of my mind. \r\n\r\n+20:00 - (-) Practically baseline, and I fall asleep.\r\n\r\nConclusion - This is not my first experience with the DOC and 5-Meo-Mipt Combo. I have found it to be absolutely beautiful every time. This time, happened to be, IMO, a ++++. This is so far my 2nd ++++ experience. I find the combination to work best at a ratio of 2:1 DOC to 5-Meo-Mipt.\n\n\n\n\n\nExp Year: 2013ExpID: 100379\nGender: Female \nAge at time of experience: 18 \nPublished: Nov 16, 2014Views: 2,897\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n",
  "doses": [
    "5 mg oral DOC (liquid)",
    "2.5 mg oral 5-MeO-MIPT (liquid)"
  ]
}