{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t   \n\t\t oral\n\t\t Etizolam\n\t\t (pill / tablet)\n\t\t\n\t\t\n\t\t  \n\t\t   \n\t\t sublingual\n\t\t Etizolam\n\t\t (pill / tablet)\n\t\t\n\t\t\n\t\t  \n\t\t   \n\t\t smoked\n\t\t Cannabis\n\t\t  \n\t\t\n\t\t\n\t\t  \n\t\t   \n\t\t oral\n\t\t Alcohol\n\t\t  \n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   75 kg\n         \n\t\n\n\n\n\nThere seemed to be a lack of useful information about Etizolam (Etilaam, Etizola, Sedekopan, Pasaden, Depas) on here so I thought I'd make a contribution.\r\n\r\nI suppose I should describe my 'experience' with drugs here. I have tried a few 'common' recreational chems such as Ketamine, MDMA, Speed (amphetamine I guess) and some pharms like Diazepam, Tramadol. Sertraline (I don't know what that might be called over the pond) and Chlorpromazine. The latter few not really at all relevant, though I would say I lost many many months taking Chlorpromazine (prescribed) and still to this day have a large black area in my memory.\r\n\r\nA few years ago I had a very messy few months (drug-induced) that ended in a loss of confidence, increase in anxiety, reclusive behaviour, severe introversion. During the next year or so I would wake up and smoke weed till I slept. For me I think it was a damaging situation to put myself in, psychologically speaking.\r\n\r\nSince then working up the confidence I once had has been a challenge and generally reclusive behaviour has persisted (though much less). I felt a few months prior to this report that the only remaining issue I had was a minor anxiousness about social situations.\r\n\r\nHence Etizolam. Having taken a good amount of Diazepam before, I felt comfortable ordering some of this as it is currently un-scheduled/restricted in the UK and is sold as a 'Research Chemical.'\r\n\r\nNow I'm not an idiot, the very professional looking websites advertising 'research only' chemicals, they are clearly targeting recreational users. Despite this I had done some research on Etizolam, it seemed like a fair amount of real reports of this doing what it's advertised to do.\r\n\r\nIt's not technically a benzodiazapine, my limited chemical knowledge understands one of the rings that hold the molecule together has been substituted out for a different few atoms, thereby changing the nature (and legality obviously) of the drug.\r\n\r\nAnyway this is more aimed at those thinking of 'self-medicating' their way out of whatever anxiety they are feeling at this point in their life. (Side Note: You don't 'have' anxiety, it's a bizarre linguistic oddity. Once you 'take ownership' and 'label' the problem, you tend to become apathetic or weighed down by 'getting rid of this burden.' You don't HAVE anxiety. You ARE anxious... currently. Linguistics, crazy shit.)\r\n\r\nIt came in the post, well sealed I must say, with plenty of information on the label.\r\n\r\nThey were blue hard pressed 'pellets.' 1mg of Etizolam per pellet.\r\n\r\nI won't do a time record for this report I don't feel it's necessary for this experience.\r\n\r\nFirst day I tried one was a little concerned of what potency this would feel like. I had read reports saying its roughly diazepam strength but I'm not often trusting of the information you find online regarding subjective experiences.\r\n\r\nTo be honest I couldn't really 'feel' much. Maybe felt a little more relaxed in my shoulders, mindset had shifted to a slightly slower more relaxed mode. But not anything I would have noticed had I not been looking for it. I kept taking one in the morning for a few days (I had a few days off work) I felt quite good. I met up with an old friend had a smoke with him on day 3, which is unusual for me as I can't smoke cannabis around other people anymore, I get rather depersonalised and anxious. Though I felt no anxiety with him, this could be due to him being such a good old friend and the slight relaxing effect of Etizolam.\r\n\r\nI then stopped as it was my shift at work, shift went ok, noticed I was able to stay in a social contact much longer with a considerable amount of comfort. Sounds ridiculous but I always found myself walking away from a social contact far before the other party (simply just to get away, boredom, disinterest usually but often anxiousness creeping in paired with overanalysis of my own posture or actions.) Now I feel content to engage socially and 'sit in' a situation and take it in.\r\n\r\nObviously I then tried to see what recreational use I could find for it so I took 2 and had a joint (weed), well fuck me. It was the most comfortable way to stumble into bed I have ever had. I slept for half the day after that, woke up feeling guilty for wasting the day but absolutely amazing otherwise.\r\n\r\nToday I tried crushed sublingual for 10 minutes before swallowing. There was no body to it. I felt as though my brain was wrapped in a blanket from stress and anxiety for maybe 30 minutes and after that the usual anxiolytic effects.\r\n\r\nI will say I am (on the day of writing) feeling the moreishness of these as the effect is so subtle for me. If I didn't know about the risk of dependence and the horrible withdrawal symptoms from benzos I would be chewing these like sweets. Luckily I have a good head for keeping track of myself (from years of self evaluation.)\r\n\r\nI have solved a lot of issues with this drug and will be keeping some in the cupboard for 'emergencies.' \r\n\r\noh also Alchohol seems to add a dizzyness to the effect of 2mg Etizolam rather than increasing the relaxant effects.\n\n\n\n\n\nExp Year: 2013ExpID: 100654\nGender: Male \nAge at time of experience: 22 \nPublished: Jan 29, 2015Views: 9,833\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}