{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t 2 mg\n\t\t oral\n\t\t Biperiden\n\t\t  \n\t\t\n\t\t\n\t\t   T+ 0:00\n\t\t   \n\t\t  \n\t\t Vitamins / Supplements\n\t\t  \n\t\t\n\t\t\n\t\t   T+ 0:00\n\t\t 1 mg\n\t\t buccal\n\t\t 25I-NBOMe\n\t\t (blotter / tab)\n\t\t\n\t\t\n\t\t   T+ 1:50\n\t\t 1 mg\n\t\t oral\n\t\t Noopept \n\t\t  \n\t\t\n\t\t\n\t\t   T+ 3:20\n\t\t 2 mg\n\t\t oral\n\t\t Biperiden\n\t\t  \n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   170 lb\n         \n\t\n\n\n\n\nSubstances taken:  \r\n1mg of 25-I-NBOMe ,T +0\r\n4 mg of Beperiden, T -0:10/ T +3:20\r\n600 mg of chelated magnesium, T -0:10\r\n600 mg of ibuprofen. T +0:40\r\n50 MG Noopept T +1:00\r\n\r\nAll started when I decided to write this report. I have had many NBOMe experiences before, most of them with a greater dosage. But today I had free time and my laptop, so I decided to describe how the tripping on 25-I happens to be for me. I think this drug is interesting, not well known, but after taking it over 10 times now Im more used to its feelings. As for me? Im a 17-year-old pharmacy student in Europe (I wont give the name of my country but it is hot) now its summertime and Im during my break time, Im kind of a loner so I spend most time alone indoors or with myself and my own meditations. \r\n\r\nThe experience that today Im describing is just another way for me to keep using my free time, as Im pretty bored since university classes finished. I took LSD with a friend about a week ago and from then to now Ive taking magnesium and low doses (15 mg) of DXM as a NMDA antagonist, which may decrease tolerance issues with amphetamines and psychedelics as well, or at least it works for me. I discontinue my prescribed medicines (trazodone and olanzapine, an antidepressant and an antipsychotic respectively) about 3 days before having any experience with other psychoactive substances, and till now they still do not seem to interrupt, avoid, or mess in any way with my experiences.\r\n\r\nAs acronyms sometimes used in this report you will see the 25-I-NBOMe mentioned as NBOMe or 25-I and also the use of CEV for closed eye visuals, and OEV or just visuals for the open eye visuals. I measure my blood pressure often during this report, it measured all in mmHg. \r\n\r\nAs I write, around 20 minutes have passed since I settled the blotter under my lip and incredibly, the first symptoms are starting to appear. I will write a report by time and describing what seems typical (the same as in my other experiences) and new for me or atypical (different from what usually happens to me).\r\n\r\n18:30- I start preparing for the experience, I love damage reduction and safety, and I know my usual symptoms on NBOMe compounds or with other psychedelics. My typical discomforts are huge tension in the neck and in my thighs and obvious vasoconstriction and light numbness in hands and feet. As a way of preventing these symptoms I take Magnesium supplements, which act by producing vasodilatation and relaxing my muscles. I also take Beperidene, an anti-Parkinsonian medicine which I take to prevent extrapyramidal syndrome, which can happen to me because I often take olanzapine, an antipsychotic. (note: I interrupt taking this medicine for various days before any psychedelic experience). Well, the point is I took 2 mg of Beperiden plus 600 mg of chelated magnesium.\r\n\r\n18:40- I dropped the 25-I-NBOMe, I settle the blotter of 1 mg under my upper lip and wait\r\n18:55- This is atypical usually I dont start with the main feelings as early, usually for me it takes from 40 minutes to 1 hour and a half to start feeling it.  I start yawning inexplicably and the tension in my back starts to be obvious. \r\n\r\n19:20- Wow for some reason this is kicking in really fast, I start feeling it like now, a feeling of euphoria and speed, like if all my muscles had way more energy than usually. I start to see slight patterns in the walls and floor and my neck moves robotically. The visuals are not yet appreciable, just small patterns. As I write I notice a slight change in perception of space, objects seem to come towards me as if they were widening, my closet seems to be moving really slowly. I have music on and the sounds start being deeper and more paused, the bass starts to be really appreciable. \r\n\r\n19:25- I decide to take ibuprofen for the neck pain and tension, it's not much pain more just like tension. I take 600 mg of ibuprofen, it will also act producing vasodilatation. I take my blood pressure: 142 mmHg systolic and 92 diastolic, obviously above what is normal. This due to the vasoconstriction caused by the 25-I as happens with other psychedelics. Ill continue keeping track of my blood pressure. (Normally my blood pressure is around 120/80)\r\n\r\n19:40- Still no visuals but the euphoria starts kicking in, as well with another typical feature of 25-I for me, I start seeing everything as if passed through a really slight pink filter. I love it; it gives me a feeling of understanding towards those who say to live their life in pink XD.  By this time I also decide to drop a high dose of Noopept, 50 mg, as a nootropic neuroenhancer it uses to make my psychedelic experiences way more interesting. With brighter colors; better spatial perception and increased focus. \r\n\r\n19:50- my yawning is becoming really obvious as I escalate through what seems to be the coming up. I am still seeing patterns everywhere and these are getting more clearer and obvious as time passes.\r\n\r\n20:00- My blood pressure seems to have lowered a bit now to 137/91 mmHg, still high but better, Ill keep checking it each half hour. No pupil dilatation yet. \r\n\r\n20:10- Probably Im already up, the patterns have become kaleidoscopic forms all over plain surfaces, like in my skin, the walls, the floor or the pavement, on the streets. Pretty lotus forms appear in the blue surfaces specifically, more than in any other surface. I lay down in my bed looking at the ceiling of my room, its white with stars drawn, but now I see it in a pink-yellow shade, and connecting each yellow drawn star, forms of lotus-like figures, they all spin as soon as I stare at them. I now realize that my jaw is clenching, I was expecting the magnesium to solve this but its not much or even annoying so it doesnt matter. \r\n\r\n20:15- Im going to take a shower and disconnect a bit the computer, the physical component is really intense, it annoys me because I often hear that 25-I has a stronger visual component than LSD or 2C compounds but I personally find 2Cs and LSD way more visual. Even if Im in really high dosages of 25-I ( I took once 5 mg and still the visuals werent as good as with LSD or 2C-B). Though the spatial sensation and this pink shade is a characteristic part of 25-I that I appreciate.\r\n\r\n20:45- After a good long hot shower, I feel new. While in the water the sound of the drops breaking under my feet was beautiful, makes what almost sounded like a heavy melody, most of it composed by bass. The visuals were minimal; each drop of water slightly diffracts light into different colours, making really small and nearly invisible rainbows. Some objects like the bottles of gel seemed to breath as they seemed to get closer and then go back again, widening and then contracting. I took my blood pressure again, 147/92 still high as happens with the whole experience; the hot water didnt really make it decrease. Im now pretty calm; my heart is at 60 ppm and has been most of the time at this rate. The euphoria seems to be fading though, it kicks in and out at random moments, happens as well with my neck pain. Oh, btw, now it is obvious that my pupils are pretty dilated.\r\n\r\n20:55- Ive been correcting and typing this report all along for a while, I want to express my experience as well as is possible to me, my current mind state is a feeling of mild euphoria and at the same time serenity or calmness imbuing my house, dinner is ready and I dont really feel hungry at all, the patterns dont seem to be obvious anymore its just when I focus that I clearly see lotus like forms and patterns. I close my eyes and appreciate the CEV, I see a dark bottom in which there are projected Aztec like drawings of what seem to be animals, mostly frogs, these at the same time slightly spinning. I feel like I lose myself in a deep state of meditation when I close my eyes and try to concentrate on the CEV.\r\n\r\n21:10-Im still not hungry but I would like to eat, I feel like things will taste better if eaten in this state.\r\n21:40- I finished dinner with family, my parents didnt noticed anything strange in me, I felt pretty happy and serene most of the time while talking with them, I was able to appreciate the food In my mouth and each movement that my tongue made wasnt automatic anymore, but I felt like it depended on me to correctly chew and eat the food (which tasted pretty awesome, though I started to appreciate easier excess in salt in some food, like if my taste buds were more sensitive to salt). I took a piece of dark chocolate and also I ate a spinach salad, this two food are high sources of magnesium which is in my opinion extremely important during any psychedelic or entactogen  experience as it relaxes muscles and reduces blood pressure. \r\n\r\nIts interesting also the effect that my computers screen has over my over dilated pupils, I feel the light of the computer even hurting to my eyes and I want to stop looking but I have to finish writing. I feel even a urgent compulsion or mania, like if I really needed to finish this report while my laptop reflects this text among kaleidoscopic hexagons, forming a bee panel matrix all over the screen. My blood pressure now is 143/90 and my heart rate is now up to 72 ppm. My neck is not stiff anymore; I guess this is due to the combined action of the magnesium and the Beperiden, which Ive found to be a wonderful psychoactive, really useful in many cases. \r\n\r\n22:00-the stiffness comes and goes irregularly, giving me slight neck tremors, I take 2 more mg of Beperiden. While I write this I notice a decreased ability to write correctly, my natural language is not English and now for some reason it is becoming more difficult for me to write. My computers screen blinds me so I turn on the lights on my room, all the colors reborn as things start to get bigger and then shrink again. My legs feel really light and all my muscles but my neck (which as I said is stiff and in tension)  seem to be really light and powerful I feel like now I could do any physical duty and I would achieve it.  The CEV are still fascinating and obvious, Im going to lay a while with some music and observe them, Ill describe how they are later.\r\n\r\n22:20- I wake up from a short but for me long dream like state, with music playing in my headphones and enjoyed CVEs which started to morph slowly into multiple faces, and Guy Fawkes-like masks appearing randomly.  I used to wear a golden chain which suddenly started to be quite uncomfortable, despite not noticing it till now, and I decide to take it of (I never do that, it is a really special chain to me), what seems like an odd behavior for me, but I cant stand its feeling any more. I go to the window, and I start seeing the clouds around the moon, they  look really beautiful and while I stare at them the clouds slowly morph into letters, random letters though, all caps, and saying meaningless things, then I stare at the moon and I see a face there, it is a black face which stares somewhere up, I find this highly curious. Sound starts to seem to reverberate around my house a lot, I hear every voice twice like soft echoes, this is also atypical in relationship with my other experiences.\r\n\r\n22:30- I keep writing, I have this picture in front of me, it is a skyline of Times Square, so I bought it, I just had a huge flashback to the moment when I bought this picture, and I even transported to my emotional situation at that time, the happiness I felt in that moment fills me up, and lifts my mood a lot. I have to keep track of my blood pressure, I dont know if this is stupid or not, but I find this tracking highly interesting. Now its 139/83 it seems to be dropping pretty well, my pulse is also going down, its now 68 ppm, which still a bit high for repose, but less than before.  \r\n\r\nI just finished another bottle of 1 liter of water, I realize that Ive drunk 3 throughout the night, thats a lot, but also here its really hot, Im also going to the bathroom quite regularly, but thats ok, that means my kidneys are working producing diuresis and reducing my blood pressure. Though I should stop drinking water, I dont know if hyponatremia is a real risk with 25-I as it happens with molly (MDMA), but better be cautious about water intoxication, I dont want to eat much salty stuff as it could raise my blood pressure, but It wouldnt be a bad idea to snack on something salty. I take pumpkin seeds, they are salty and they are also a great source of magnesium, better for me. \r\n\r\n23:10- All the stiffness in my neck and legs is gone, I shall say that beperidene works magic, the visuals are nearly gone, and that typical pink layer that covers everything is gone too. I can still see patterns in the walls if I look close but they seem to be fading as well as my mild euphoric state, which is turning into tiredness. I ate a ton of pumpkin seeds already, they are good, and taste specially well. Im getting a bit bored so I may go play some videogames and see how visual stimulation works. Also I am going to take a dip in the pool and see how it goes.\r\n\r\n23:20- the pool was refreshing, pretty awesome, and fast too. Now I feel my hair heavy with water and my head too, I feel as if I couldnt keep my head upright. I saw that face in the moon again, but this time it morphed a couple times into other things, for a moment I even saw the silhouette of the head of a T-rex,  it was odd but cool. My systolic pressure seems to have dramatically increased its now 152 mmHg, while the diastolic is 82, a pretty normal number, may this been the salt in the seeds? I dont know, but my heart rhythm keeps going down, now Im at 59 ppm. \r\n\r\n23:50- The time passes by and I just play videogames while the effects slowly fade, but something is still there, the screen looks way brighter and I feel faster with the control and it feels really easy to play, I feel like some kind of performance enhancement for some videogames (Im playing the last of us on my ps3, if anyone is interested) the dramatic scenes of this game make me slightly sad and I feel a lot of empathy towards the characters, and its curious because Im not an empathic person. I wont take my blood pressure again for the next couple hours.\r\n\r\n00:00- so definitely we can say this is over, the patterns are almost gone and the body feeling too, just a slight remains of tension in some muscles and thats pretty much it. I feel tired and I want to go to bed, but I doubt I can\r\n\r\nAfter the experience was finished I took my blood pressure the next morning after a whole night of good sleep and it was 127/82, pretty normal, and definitely lower than yesterday. My mind traveled through the effects of 25-I narrating all those feelings I had while on it. It wasnt a mystical experience or anything like that at all, for me it has never been with this compound, its fun to take I can see cool things and appreciate music and food way better, by the other side is it has numerous annoying side effects, like the high blood pressure caused by vasoconstriction and the elevated tension and stiffness of some muscles mainly  jaw, neck and legs. \r\n\r\nApart from this it is a highly enjoyable compound good for social events and parties but In my opinion not good for deep thoughts or enlightening, it doesnt change your mind processes or makes you feel like you understand the world in a deep way as LSD does. This is a drug designed to have a good time with some friends or dancing as it confers tremendous body energy and feeling of power as well as euphoria and happiness, but these effects at least for me are less appreciable than with 2C-B for example. This drug is not really a good entactogen but it makes one laugh and be social in other ways, but without deep connection.  \r\n\r\n25-I-NBOMe is a superficial drug with a great onset and good peak, its fun but still being that, superficial.\n\n\n\n\n\nExp Year: 2013ExpID: 100794\nGender: Male \nAge at time of experience: 17 \nPublished: Oct 23, 2015Views: 1,240\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}