{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t 100 mg\n\t\t rectal\n\t\t 4-Ethylmethcathinone\n\t\t  \n\t\t\n\t\t\n\t\t   T+ 0:30\n\t\t 100 mg\n\t\t rectal\n\t\t 4-Ethylmethcathinone\n\t\t  \n\t\t\n\t\t\n\t\t   T+ 0:00\n\t\t 220 mg\n\t\t oral\n\t\t 4-Ethylmethcathinone\n\t\t (powder / crystals)\n\t\t\n\t\t\n\t\t   T+ 0:00\n\t\t 78 mg\n\t\t IV\n\t\t 4-Ethylmethcathinone\n\t\t (liquid)\n\t\t\n\t\t\n\t\t   T+ 1:30\n\t\t 105 mg\n\t\t IV\n\t\t 4-Ethylmethcathinone\n\t\t (liquid)\n\t\t\n\t\t\n\t\t   T+ 2:45\n\t\t 100 mg\n\t\t IV\n\t\t 4-Ethylmethcathinone\n\t\t (liquid)\n\t\t\n\t\t\n\t\t   T+ 2:45\n\t\t 65 mg\n\t\t IV\n\t\t 4-Fluoroamphetamine\n\t\t (liquid)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   150 lb\n         \n\t\n\n\n\n\nThere is so little information out there regarding 4-EMC (*not* 4-MEC!) that I thought I would post my initial experiences with it, both alone and in combination with 4-FA. Hopefully, this can be of some value to others!\r\n\r\nRound ONE: Questionable Activity, Frustration; the Quest for an Effective ROA\r\n\r\nT+0:00 100mg measured out using a digital milligram scale for precision; dose was administered rectally. I lay on my left side for 20 minutes to maximize absorption.\r\n\r\nT+0:30 Been laying here a bit, I know I feel 'something,' but nothing in any way significant. I administer another 100mg rectally.\r\n\r\nT+1:15 The 'Im-not-sure-what-I-feel' action persists. My heartrate has quickened ever-so slightly. Mydriasis is HIGHLY, highly present. No bodily discomfort, but no real washes of euphoria, either. I find myself in a paradoxically alert, yet quieted state of being. Tactile sensations are enhanced, and I feel somewhat sexually stimulated.\r\n\r\nThe underwhelming feeling persisted for another three hours, but there was no crash to speak of at all. Simply fade to sober.\r\n\r\nRound TWO: *Sublime* - Surprised, Euphoric and Laughing Robustly!\r\n\r\nNoting my subpar first trial, and having tried enough to know to avoid insufflating any more 4-EMC, and failing to achieve noteworthy effects after 220mg orally, I decided to try IV'ing it. I felt a sense of apprehension at the thought of IV'ing such an obscure compound, but felt a sense of determination to explore this substituted cathinone's potential. I measured 78mg on the scale, dumped it into a shot glass and added 1mL of sterile, bacteriostatic water. Swirling the glass lead to the 4-EMC dissolving rapidly and completely.\r\n\r\nSolution was filtered using cotton, yielding 0.6mL of 4-EMC solution inside the 1cc, 30 gauge 1/2' insulin syringe. Solution had a slightly off-white, diluted sandy yellow color to it, just like the powder. Injection site was prepped with rubbing alcohol, and a tourniquet fit snugly over my right bicep.\r\n\r\nT+0:00 Successfully registered, slowly depress the plunger. Injection took roughly 5 seconds.\r\n\r\nT+10 seconds - I feel a strong 'hit' of chemical flavor rise into my throat as though it were a burp. A strange, synthetic flavor that was neither tasty nor repulsive. Simply put: Poignant.\r\n\r\nT+15 seconds - WHAMMO. There it is! I slump back in my seat and let waves of serotonin bathe my central nervous system. It feels incredible. What's more, I experienced no noticable change in heartrate the whole time, and this is reassuring.\r\n\r\nT+0:01 - Rushing hard. Vision is blippy and strobe-like due to intense nystagmus. I recorded a video on my iPad of my eyes (I had never done this before) and they were WILD with involuntary and spastic movement!! Nystagmus on a level that reminds me of high-dose MDA. Everything looks psychedelic, as though saturated with color. Beautiful shades of color on otherwise everyday objects. I haven't been able to stand up yet to check, but I know my pupils are tremendously large. This is indeed a very serotonergic, psychedelic cathinone derivative.\r\n\r\nT+0:10 Im loving the fact that here is no over-stimulation present here. I've been in an intense Mephedrone/MDMA headspace but lack uncomfortable physical side effects. 4-EMC IMO likely exerts comparably little noradrenergic activity, instead being preferential for serotonin and dopamine. This stuff is truly reminiscent of the fat MDA+MDMA bombs of the past with its own unique contemporary flavor. Really, really nice touch there EMC...\r\n\r\n...My body feels warm, soft, velveteen, erotic. I realize that, though I've been entirely distracted by the omnipresent strobing, I have an erection the strength of concrete. Masturbation feels wonderful; if only my girlfriend and I hadn't called it quits last month!! 4-EMC is very entactogenic and I long for the presence of other people - and, in those sexually-charged moments, my ex-girlfriend. I find it very easy to move past these difficult feelings and continue to enjoy the moment.\r\n\r\n4-EMC is extremely versatile in this sense. Very reminiscent of MDA in the sense that you can choose when steeping in emotion is appropriate for your experience or not. I found I was able to precisely control just how 'deep' into myself I went, on those occasions where I opened myself up to it.\r\n\r\nT+1:00 Been laying in bed in my room which is thoroughly illuminated by a deep, tranquil-blue light. Candles flicker, mist from the oil burner rises in a tempest of lavendar fragrance. Bass booster on soundsystem is optimized - accentuating the compelling groove of a tech house mix CD by Funk D'Void. All is well. I am absolutely loving 4-EMC: it provides a unique sedative-like stimulation, sort of in the same general manner as methoxetamine produces but without the susceptibility to mania. Though I exist with perception of astounding clarity, my brain feels a little heavy. Neither tired nor stressed, just... 'heavy.'\r\n\r\nT+1:20 All of a sudden, I realize the effects have significantly diminished. That's the way it is, there is little to no comedown of any sort. Simply a sudden realization that your oozing euphoria has subsided smoothly into a sensational afterglow. Slight bruxism, which has been present the whole ride, is ameliorated with some magnesium citrate. I notice it more now that Im not distracted by my other senses.\r\n\r\nT+1:30 After ninety minutes, I succumb to the desire, up until that point a mere undercurrent, to redose. It is true that the urge is less than with 3-MMC, 4-MMC or 4-MEC. Thank god.\r\n\r\nI measure out 105mg of 4-EMC, prep it for injection as I had before, and self-administer. A dash of red, suspended; depression of the plunger, delicate; chemical 'throat hit,' vivid; euphoric rush, absolutely tidal. I added 30mg to the initial dose for my re-dose, and there's no going back from that feeling again!! This material is very well-suited for close-knit social gatherings or, as in my case, a night of self indulgence...\r\n\r\nThe experience that followed mirrors in most ways the initial effects, albeit much more intensely.\r\n\r\nT+2:45 I prepare to redose again, and decide to research a potential combination to increase stimulation just a little bit. Determining for myself that the potential for risk was minimal, I prepped 100mg of 4-EMC along with 65mg of 4-fluoroamphetamine (4-FA). Anticipating additive serotonergic agonism and rapid stimulation, I gave myself the shot.\r\n\r\nMother-of-god...\r\nTaste the rainbow!\r\nDouble your pleasure!!\r\nI hold tight as my psyche, tethered to a series of ion propulsion rockets, is blasted well past Neptune.\r\n\r\n4-FA has always been a great halogenated amphetamine in its own right, possessing a consistently smooth subjective experience. And thus, using it as an adjunct to 4-EMC's comparatively languid stimulation naturally lead to discovering what I feel is the perfect complementary pair of stimulating, serotonergic RCs. I keep the dose of 4-FA constrained to below 80mg always in lieu of preventing excess PNS/CNS serotonin accumulation; additionally, I'd like to avoid becoming hyperthermic and sweaty with a racing heart. That's what 4-MEC is for!\r\n\r\nThis was my last dose for the session described above. The afterglow, again becoming realized after about an hour and a half, persisted with me until I...\r\n\r\nT+6:15 ...fell asleep three hours later with the aid of some clonazepam and kava. I slept very, very soundly and awoke the next morning in high spirits and without any 'hangover' effects to speak of. I was very pleased.\r\n\r\nConclusions:\r\n4-EMC is dubby, psychedelic entactogenic/empathogenic and aphrodisiac cathinone derivative that possesses strong euphoriant properties directly comparable to MD(M)A for me.\r\nThough I had little success plugging/eating it and insufflation felt too caustic, I came to know it via IV administration. I'm not sure I'd trust this IM.\r\nCo-administration with 4-FA was optimal (for me) and produced no irritation or swelling at the injection site despite how much 4-FA burns when insufflated..\r\n4-EMC's addiction potential is quite high with IV administration, and those not otherwise predisposed would do well to avoid it, if possible.\r\n\r\nI would say that I enjoy 4-EMC moreso than Mephedrone. The effects profile being more favorable and expansive, the duration longer, the potency by weight a degree higher, and lacking characteristic feelings of Mephedrone-induced cardio- and neuro-toxicity.\r\n*That's not to say that it isn't toxic, but it lacks the palpable feeling of bodily abuse that I get from 4-MMC and 4-MEC.\n\n\n\n\n\nExp Year: 2013ExpID: 101144\nGender: Male \nAge at time of experience: 27 \nPublished: Sep 21, 2014Views: 4,560\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n",
  "doses": [
    "T+ 0:00 100 mg rectal 4-Ethylmethcathinone",
    "T+ 0:30 100 mg rectal 4-Ethylmethcathinone",
    "T+ 0:00 220 mg oral 4-Ethylmethcathinone (powder / crystals)",
    "T+ 0:00 78 mg IV 4-Ethylmethcathinone (liquid)",
    "T+ 1:30 105 mg IV 4-Ethylmethcathinone (liquid)",
    "T+ 2:45 100 mg IV 4-Ethylmethcathinone (liquid)",
    "T+ 2:45 65 mg IV 4-Fluoroamphetamine (liquid)"
  ]
}