{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t   \n\t\t oral\n\t\t Ayahuasca\n\t\t (liquid)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   250 lb\n         \n\t\n\n\n\n\nThis ceremony took place in Canada, led by a Peruvian-trained Canadian.\r\n\r\nWe arrived at the farm on an early evening in June.  We set up our sleeping mats in the spacious, circular room where the ceremony was to take place.  Sunshine entered through the windows, and in the centre of the wooden ceiling was a large circular skylight from which the roof beams radiated like spokes in a wheel.  There was a stillness which was reinforced by the calm, reverent behaviour of its occupants as they quietly came and went, each taking the time to greet us as they settled in for the evening.\r\n\r\nTwenty narrow sleeping mats ringed the room, each occupant with their head to the wall and their feet towards the wide empty area in the centre of the hardwood floor.  Beside each persons bed were their belongings and a small bucket. \r\n\r\nOne of the twenty participants began to speak to us from his mat, he was the curandero.  He spoke softly and good naturedly as he welcomed the newcomers and those returning from the previous night, and introduced his partner and another helper.  They took turns explaining how the evening would progress, then all the participants said a few words about their intentions for the night.  I can't recall what I said my intention was, but it was more appropriate to a psychedelic nature of reality trip than a healing experience.  As it turned out, I wasn't asking the right question.  Ayahuasca is a medicine, said the curandero, it's a feminine healing spirit, and it responds to each individual according to their needs.  Some spoke of very specific areas of need, some were open to whatever might come.  \r\n\r\nThe curandero and his assistants drank first.  Then, one by one, we were called to his mat to receive ayahuasca.  I felt apprehensive given the drink's reputation for being foul and bitter, but I was pleasantly surprised; the thick, dark green liquid had a complex flavour that was earthy, spicy, bitter and sweet all at once, unlike anything else Ive tasted.  I moved over to the curanderos partner who rubbed my hands and head with a floral cologne before blowing a blessing over them.  I didn't rinse my mouth upon returning to my mat.\r\n\r\nThe blinds were drawn and the room slowly grew darker as we waited.  I felt expectant but calm and introspective, and wondered if the drink would be sufficient.  I thought about my made-up intention I had shared with the group, but began to feel that if there were any area in my life that could use radical healing, it would probably be connected with my being adopted at birth.  Not even the sound of breathing disturbed the silence in the room as the minutes passed. I noticed what sounded like a strong wind whistling over the buildings of the farm.  \r\n\r\nAfter as much as an hour had passed, and the wind had stopped (there was no way to know time during the ceremony) I noticed that I was feeling a kind of tightness or pressure in the skin of my face and hands, and realized the ayahuasca was coming. As the feelings grew stronger, I knew its potency was no longer in question.  My limbs grew weak as I stared at the circular skylight.  Only when I closed my eyes did I see intricate, writhing abstract shapes, composed of dim spidery rainbow colored threads on a black background.  They reminded me of the spirograph drawings I made in childhood, but alive and moving, multitudes squished together, evolving in and out of each other. \r\n\r\nI opened my eyes in the dark and kept them open the entire night, rarely taking them off the circle of night sky glowing dimly in the centre of the ceiling.  I was motionless for the next seven or eight hours as I concentrated on an interior dialogue.\r\n\r\nGradually I began to feel pinned to the spot, my whole body infused with a feeling I couldnt identify.  Then it became clear to me  I felt good, really good.  A level of good so profound that I didnt even recognize it at first.  Suddenly any apprehensions I had fell away, and I sank into the loving feelings constantly washing over me.  I felt gratitude and complete trust, and knew with certainty that I would experience only grace this evening.  I entered a state of total confidence, stability, safety and pleasure that would last long into the following day.  I smiled like a baby.\r\n\r\nOut of the silence came a sound, a sort of soothing rhythmic sibilance, followed by a longer rushing whoosh.  Whispering, almost inaudible chanting began from the direction of the curandero, slowly becoming louder, but always seeming under his breath, gentle and effortless.  The icaro seemed to move on its own, undulating up and down, but with intent.  As it grew more insistent, people began to respond with restlessness and soon I heard the first use of a bucket across the room, the heaves and groans amplified by its shape.\r\n\r\nThere wasnt a period of mass purging at any point; rather, it went on throughout the night, rarely more than one person at a time.  Often, after a long period of silence, the curanderos next icaro would somehow precede or call a bout of vomiting.  There was a lot of variety to the puking.  Some were loud, some were almost polite, some were wet, some were dry.  Many times, my heart went out to the next person in the dark who was clearly struggling to expel much more than the contents of their stomachthe agony went far beyond nausea.  One man seemed subject to a kind of possession, flailing and crying out, mumbling gibberish, howling.  The curandero or his partner would appear before those who were suffering greatly and sing the appropriate icaro.  Often their voices would intertwine in the dark:  his low, rhythmic and raspy, accompanied by a shaker; and hers, high, soft and pure, singing a completely different icaro to a different rhythm but in the same key, each note clear and bell-like, without vibrato, simple and soothing.  \r\n\r\nEveryone took a journey unique to their needs, each in their own way, deeply within themselves to the exclusion of all others.  I kept smiling, regardless of the suffering of those nearby. I had as little choice in the matter as they did.\r\n\r\nThe room's darkness was filled alternately with singing and long silences.  I lay motionless on my back, unable to move, amazed at the depth of the healing love that seemed to pour into me through the skylight, filling me continuously, amazed at the beauty and rightness of the icaros.  There were no tears, no emotional upwellings, just fullness.  I noticed that I had been gently stroking my own hair for a while, my hand sweeping up from my forehead over and over.  I remembered the same stroking from my childhood, from times when I was sick in bed and it was the only comfort available.  The difference was that this time it was my hand.\r\n\r\nMy hands were the only part of my body that seemed able to move, and they moved on their own.  The womans singing touched me deeply, and I found that my hands would rise up beside my head, palms upward in a receptive posture.  I spent long periods with my hands held this way, or with my right hand stroking my hair.  I wondered inwardly at this behaviour, and for a moment looked at my hands.  Its not that I asked a question and received an answer, but I suddenly perceived those familiar hands in a new, different light.  They seemed somehow larger, heavier, stronger before me; I understood that they are a great responsibility, capable of such tenderness, and that tender touch is healing, and that its a sacred obligation to use ones hands for this purpose, even on oneselfand in my case especially.  My hands then closed together above my heart, again without thought or intention.  They would take this attitude several times throughout the night in response to meaningful realizations, sometimes meeting above my heart, sometimes above the bridge of my nose.\r\n\r\nStroking my hair brought to mind my mother, my parents (both deceased), and I held them in my mind's eye for a moment.  My feelings were unclear and conflicted, as they usually were when I considered our sort-of-resolved, sometimes strained relationship.  My hands pulled my warm blanket closer to my chin and I noticed an unexpected roughness in the texture of the cloth, though I knew it to be soft.  All at once I knew my parents:  they were the simple rough blanket of my upbringing.  Soft or rough, a blanket protects us.  As the image gathered meaning, my muddled feelings of love and petty complaints and resentments all fell away as I understood us all in a new way, clearly and simply.  It was like a small tug on a thread that unraveled a huge knot all at once, leaving clarity and space and a sense of the true proportions of things.  I felt humbled and thankful.\r\n\r\nMy hand moved over my heart in gratitude to the ayahuasca for these realizations; warmth seemed to radiate from within my chest and my attention settled there momentarily.  As I contemplated this sensation, my mind filled with a vision of a wide, blue sky dotted with high clouds, a silent summer day sky stretching far in all directions without end.  All this sky began to pour into my chest from above, funneling into my heart like a waterfall, until the sky and my heart were equally limitless, open and free of fear or tension.  I understood, too, that this was to be a permanent condition; that I could close my eyes and, seeing this sky, always feel this extraordinary quiet peacefulness within.  I was surprised by this act of generosity, and honestly a little perplexed at receiving such a gift, especially in such a matter-of-fact way.\r\n\r\nSometimes I felt like calling the woman to come sing to me; I knew she would if I asked, but it felt self-indulgent to ask for her soothing when others were in distress.  So I waited, and eventually she would begin to sing again.  My mind would clear as her voice's purity and intent filled the space.  I gazed at the skylight as it came to suggest different images:  a dividing cell/embryo, a womb, an eye, a narrow boat floating on and supported by a nurturing ocean, and many many more.\r\n\r\nI wondered when the dawn would comeit was impossible to estimate how many hours we had lain there in the dark.  The sensation of the ayahuasca hadn't diminished, and I began to wonder if I could sustain my attention to the process fully for much longer.  The thought evolved into a concern about being able to maintain self-remembrance in my life in general.  What was my source of energy and motivation?  The response was almost admonishing, as if to say,We've been over this already!  and it appeared to me again, the endless blue summer sky that now filled my heart and would always be there.  I smiled at the loving playfulness of the ayahuasca teacher, while at the same time my understanding of the message of the great open sky within me deepened.  I knew it would be a source of courage, strength, peace and expansiveness for me in times of need or fatigue.\r\n\r\nBuoyed by this energy, I focused my mind on my original stated intention for the journey, the question of my own potency and authenticity.  I worried that my core self had been eroded or diluted by the choices I had made and the direction I had chosen in my life and career.  How could I live life to the fullest while juggling all these commitments of competing value?  Again, I felt a strong warmth in my chest, in my heart.  All at once I understood clearly that living life fully meant feeling life fully.  My path was not to seek out ever more attractive and nourishing adventures, people and places, but to more fully feel my present life and all its sometimes hidden riches, wherever I might be.  My hands closed together against my brow in gratitude for this insight.\r\n\r\nMy companion began to vomit into his bucket and I wondered again why I hadn't felt called to do the same.  Apart from a few moments of queasiness, I still felt peaceful and full of joy.  I thought to myself that I'd better be sure not to fall asleep in case I was struck with diarrhea, but it seems the plant had other ideas for me.  The ayahuasca was going to stay with me and be fully assimilated; apparently I needed the medicine to move through me as thoroughly as possible.  It was impossible to tell if any others had not purged, but it seemed like nearly everyone, if not all of them, had noisily purged at some point. \r\n\r\nI lay in the darkness for a couple more hours and began to sense that the medicine was receding.  There was muffled wailing and groans coming from the washroom area outside, the screams echoed all around the farm buildings.  I felt for the woman, but rooted for her in her efforts to stay with the process wherever it took her.  Her safety was never in question, she was fully supported from the moment it was clear she would need extended help.  Every so often the curandero would whisper someone's name and they would eventually make their way over to him for a few minutes.\r\n\r\nHe spoke my name but it took me a while to hear it.  For the first time in six or seven hours I sat up, finally making it to my feet, swaying and weak.  I walked towards his silhouette and he indicated I should kneel before him as he sat cross-legged on a cushion.  He took my hands and I felt very close to him at that moment, completely trusting.  After the blessing there was silence and I looked at his black shape, unable to see his face from only a foot away in the darkness.  He began to sing quietly to me in Spanish, but the thrust of the song was clear to me right away.  My mind went quiet as I breathed deeply, while my back straightened, my shoulders dropped and my chin lifted.  His partner joined in with him for the last part of the icaro.  It was a song I had no recollection of hearing previously that night.  I'll keep the details of the song's content private, but I was amazed at how appropriate the curandero's choice was for my particular healing experience.  It was like a final missing piece of information dropped into place, completing my course of instruction.  I moved to leave but he stopped me and allowed me a few moments to absorb what had just occurred.  I thanked them both sincerely and returned to my mat.  He continued to call people forward until everyone had approached him.\r\n\r\nThe vomiting had mostly stopped and there was a shift in the room as people came out of themselves and quietly meditated on their experiences.    We were asked if we wanted to share with the group.  I spoke about some of what I had learned, about how the ayahuasca had lovingly treated the wound caused by being separated from my mother at birth, and how it had given me tools to understand how I could be a source of healing in the future, for others and myself.  I spoke of my gratitude to the spirit and to the others in the group who contributed to the healing atmosphere of the space.  A few others spoke as well, each having had a unique and specific healing experience.  A couple people were requested to sing, one had a flute, one a guitar, and the atmosphere became gently playful. \r\n\r\nAt that point, we were welcome to sleep for a few more hours before leaving, but many of us were too restless and continued reflecting upon the feelings, messages and images from the night.  We packed and left quietly in ones and twos over the next few hours, each wrung out, raw and glowing.  \r\n\r\nI think I want to come back for the three-day ceremony, said my friend.\r\n\r\nIn the few weeks since the ceremony, I've noticed a deepening or further unfolding of the insights I gained there.  It feels as though I've gained access or been introduced to a part of myself that had been concealed until now.  While there is a challenge in remembering and honoring the revealed truths in my daily life, theres also a feeling of a permanent and lasting change, which will manifest itself regardless of my efforts to self-remember.\r\n\r\nAs far as the value of the ceremony itself, compared to the intrinsic value of the ayahuasca drink:  The healing atmosphere created by the curanderos was of equal importance to the direct effects of the medicine.  I can't imagine drinking ayahuasca again without the guidance and support of an experienced curandero.  It was a gentle but powerful experience that I would recommendbut keep in mind it wasn't so gentle for everyone involved.  Healing can be a massage or dialogue, or healing can be the pulling of a tooth; you'll have to join the ceremony to find out what form it will take for you.\n\n\n\n\n\nExp Year: 2012ExpID: 101451\nGender: Male \nAge at time of experience: 42 \nPublished: May 4, 2015Views: 2,595\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n",
  "doses": [
    "oral Ayahuasca (liquid)"
  ]
}