{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t 40 mg\n\t\t  \n\t\t Methoxetamine \n\t\t \n\t\t\n\t\t\n\t\t   T+ 1:25\n\t\t 25 mg\n\t\t  \n\t\t Methoxetamine \n\t\t \n\t\t\n\n\n\n\n10:20p - I dosed 40mg to start with at 10:20pm.  The onset what what I expected, feelings of disconnection with orientation being very difficult. At first, I had planned to stay on IRC in #drugs with friends and in TinyChat. A friend, Indie, skyped me and I was talking with him as well. I could feel certain expected sensations such as music coming in at me at different times. In the same way my head felt more acceptable on the left side the first time I used MXE, the right side seemed to work better for me last night.  I found myself tilting my head to the right all night and finding a very comforting feeling.\r\n\r\n10:50p - I was feeling like it was more and more easy to participate in the multiple conversations I had going on. The next morning, when I read over chat logs, I feel like it was fine.  I didn't notice any issues with continuum of conversation.  Music choices were more XXYYXX and some random mix of EDM I had on my iTunes playlist.\r\n11:15p - I was feeling a bit of a plateau and was wanting to redose to feel different than I had on my previous trip.   But at the direction of very trusted friends, I chose to wait another 30 min or so to dose again.  I had similar stomach upset but nothing to the point of throwing up.\r\n\r\n11:45p - I redosed another 25mg. The effects were pretty quick and pushed me beyond the plateau I had experienced the night before.  I felt the world become wavy and speech was more difficult. I gave up on all the conversations except with skype and headed outside for a cigarette.  I found that I didn't care if anyone heard me talking. I was even unsure at that point if my ex had come home or not. There was some part of my mind that didn't care if he heard me.  I walked with my phone outside and sat on my chair to smoke.  My thoughts were clouded and flowed with some difficulty. I was having the feeling that there were two parts of me. I could distinctly sense that the two parts and they formed a corner. I could go around the corner to see the dark part of myself and back to the other corner to see the lighter side. There was also a seeming sense of layers of bubbles.  I was the innermost bubble and then there was the porch. The next layer was my yard, then further to my neighbor's yards. Finally the outer most layer was the sky and the world beyond it.  I remember telling my friend that I was certain others could not hear me because I was in this cocoon bubble and protected.\r\n\r\n12:00a - I walked with quite a bit of difficulty back into my house.  Mostly, it felt like an arrow walking, both corners fighting to be the point. I realized that my ex had not in fact been home the entire time.  I went to my room and told everyone online good night.  I did a couple things around my room to prepare for bed which took much longer than needed.  My body felt like it was not responding to my commands but I was also not commanding it much.\r\n12:10a - I finally made it into bed, phone skype conversation in hand, and lay down.  I couldn't watch myself in the cam because I could see my face was completely orange and my eyes looked demonic.  My friend was split into two perfect copies of himself in the screen.  It was like he also was on a corner and I could feel the point of my corner meeting his.\r\n12:30a - I finally heard my ex come home. I spoke with him for a minute and lied saying that I had been getting good sleep but that my friend had called to check on me.  After I got done with the conversation with him, my friend noted that I had done well. Seemed like I was well put together.  In fact, I couldn't feel the entire bottom half of my body. I ended the conversation with my friend on skype and decided that I would really explore this trip.\r\n\r\n12:40a - I plugged my phone in, lay on my right side for maximum impact, and closed my eyes.  I started that strobe light app that I have on my phone and just sat back for the ride. I remember seeing the world of colors shift in pulsation with the lights.  They became patterns which flexed and moved across the back of my eyes for a long time.  I vaguely remember feeling my legs and hips become completely numb and it felt like swimming in an ocean and watching the clouds pass in front of the sun as you float.  It was intense.  I recall that my ex actually came in the room to figure out what the hell I was doing.  I played it off, being able to still talk for the most part, but acting as though I had accidentally turned on the strobe rather than the clock.  I know he came in to apologize and got into bed with me.  I don't really remember what we talked about, only that it was enough to make him think I was tired and he could leave.  He walked out of the room and I heard his fan turn on in his room.  I turned the strobe back on and was right back in the same place with peaceful colors and songs that changed on my whims.\r\n\r\n1:30a - The last time I remember checking my phone, or at least having enough control to do so.  I turned off the strobe and lay my head back on the pillow.  I began what felt like an amazingly clear and pristine dream that lasted for a long time (or so I assume)  In the dream, I was aware I was on the run from someone.  I had packed lightly and traveled in an older model car.  I stopped for the night at a house that appeared neglected in a part of the woods I knew but can't place.  In my dream, I did all of the mundane things one would do such as dusting off counters, running the water in the sink until it was clear, shaking out the bedding.  I remember waiting anxiously for someone to come.  I knew in my mind they were coming, but couldn't anticipate when they would be there.  So I busied myself with tidying up the home.  When I heard him come through the door, the flood of emotions I felt was incredible.  I remember him coming through the door.  It was strange because it was an amalgam of a person.  His eyes were blue/grey and reminded me of someone I know. His hair was dark and had some curl to it, like another person. It was familiar and foreign all at once. The dream was intensely sexual and yet full of longing and sadness.  This time, I was not a person watching it from the audience, I was an actress within it.  \r\n\r\nOverall, this second trip was wonderful and full of twists I didn't expect.  In going through a new drug, I want to explore all facets and plan to try a full MXE hole the next time. The biggest differences I noticed from the first trip to the second was in the intensity of the hallucinations.  Before, it was all grey and black/white.  This fell into a world and spectrum of color that I could see, taste and smell.  It hit all the senses to crescendo to the music.  The dream aspect was unusual as well.  I am hopeful in my full m hole that I will be able to further explore the concepts I had such as running away and the sense of being loved intensely.  These both play into issues I am currently experiencing.  My biggest fear is that I will be stuck in a much darker place, where my fears are realized in vibrant color.  All in all, I worry that I will be at such a point of delirium that I will accidentally get out of my room, possibly alert my ex that I am using, or some other natural consequence.  We shall see.\n\n\n\n\n\nExp Year: 2013ExpID: 101529\nGender: Not Specified \nAge at time of experience: Not Given \nPublished: Jul 24, 2015Views: 1,822\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}