{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t 15 mg\n\t\t insufflated\n\t\t 2-Fluoromethamphetamine\n\t\t (powder / crystals)\n\t\t\n\t\t\n\t\t   T+ 0:20\n\t\t 15 mg\n\t\t insufflated\n\t\t 2-Fluoromethamphetamine\n\t\t (powder / crystals)\n\t\t\n\t\t\n\t\t   T+ 0:55\n\t\t 20 mg\n\t\t insufflated\n\t\t 2-Fluoromethamphetamine\n\t\t (powder / crystals)\n\t\t\n\t\t\n\t\t   T+ 1:35\n\t\t 15 mg\n\t\t insufflated\n\t\t 2-Fluoromethamphetamine\n\t\t (powder / crystals)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   165 lb\n         \n\t\n\n\n\n\nAfter hearing some second-hand positive experiences about 2-FMA, I decided to go ahead and order some. I was hesitant because there isn't a lot of info out there on 2-FMA. \r\n\r\nTo note, my intent with 2-FMA was not to get a kick-in-the-ass party stimulant, but rather a functional psychostimulant such as dextroamphetamine (adderall). My past related use: Methylphenidate, Ethylphenidate, Dextroamphetamine, Caffeine. I tried a dusting of 2-FMA on my finger to test for any allergy, and decided to titrate my dose.\r\n\r\nT: 00:00 weighed 15mg of 2-FMA out on a scale. It's a soft white powder that forms clumps. Insufflated with a slight burn for ~30 seconds, and it smelled/tasted like rubber. Not unpleasant, but that's what I noted.\r\n\r\n+ 00:10 A slight feeling of stimulation, no in-your-face rush, no euphoria. \r\n\r\n+ 00:20 Insufflated another 15mg\r\n\r\n+ 00:30 After the second dose, there was a clear stimulation effect. A slight elevation of mood but nothing euphoric. The best I can compare the feeling is to the peak of a caffeine buzz, without any paranoia, uncomfortable jitters. A very clean, functional stimulation.\r\n\r\n+ 00:50 An overall pleasant mood, and a comfortable level of stimulation. Increased sociability and chattiness, but certainly able to function in a public setting. No uncomfortable bruxism, overly dry mouth, or excessive sweating (all which I experience on dextroamphetamine). \r\n\r\n+ 00:55 ~20mg insufflated. \r\n\r\n+ 01:30 After the 50mg total ingested, there is a clear stimulation effect. Nothing euphoric but mood is certainly positive. At this higher dose I do notice a slightly dry mouth and increased sweating, but no uncomfortable jitters or paranoia sometimes experienced with adderall/methylphenidate. \r\n\r\n+ 01:35 An additional 15mg insufflated.\r\n\r\n+ 02:20 Still a definite stimulation and overall positive state of mine. At this point I would say the only effects seen with the last dose was an increase of the negative effects (sweating, dry mouth, pulsatile heart beats) with no huge increase in stimulation. \r\n\r\nConclusion: A total of 65mg of 2-FMA was insufflated. 2-FMA is a great functional stimulant that seems to lack many negative aspects of stimulants such as excessive sweating, dry mouth, bruxism, and a sense of jittery discomfort. I ate prior to use so it is hard to say whether 2-FMA fully suppressed my hunger or not. Due to the nature of this chemical and my intentions, I would take ~50mg orally to be used as a functional psychostimulant in a work/study setting. While not terrible, insufflation of a clumpy white powder was unnecessary when this chemical did not provide a big 'kick' like some stimulants. NOTE: I took a dose of benzodiazepine before bed (6 hrs s/p 2-FMA use), so I am unsure whether or not 2-FMA would hinder sleep, nor am I certain on the duration of 2-FMA's effects. I hope more people share their experience as chemical seems to have a better cost/benefit ratio than Rx psychostimulants out there!\n\n\n\n\n\nExp Year: 2013ExpID: 101804\nGender: Male \nAge at time of experience: 28 \nPublished: Sep 15, 2014Views: 12,971\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}