{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t 1 mg\n\t\t oral\n\t\t AH-7921\n\t\t (powder / crystals)\n\t\t\n\t\t\n\t\t  \n\t\t 1 mg\n\t\t oral\n\t\t Etizolam\n\t\t (powder / crystals)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   150 lb\n         \n\t\n\n\n\n\nWhile doing my research for an opioid research chemical I came upon AH 7921 and placed a sample order from a verfied and reputable vendor.  I ordered just the one product 100mg and received it a few weeks later.  \r\n\r\nI measured out 10mg and took it to perform what I considered a baseline to make sure my body didn't reject it which I would highly recommend.  After an hour I felt fine with no noticeable effects which in this case is a good thing.  I then took the remaining 90 mg in 2 separate controlled doses.  The effects were minimal but pleasant.   \r\n\r\nI then decided to order a larger amount and try again.  When placing the order I decided to also order some etizolam.  I have tried etizolam before and find it to be highly effective at alleviating anxiety and to help with insomnia plus the purchase meant free shipping so it basically paid for itself.  The problem was this,  I ordered 1 gram of AH 7921 and 1 gram of etizolam which upon receiving are both white powder.  I emailed the vendor next to ask the question which is which.  They identify the product with a small sticker that says (unique ID 013) (unique ID 023).  The vendor told me that 013 is the AH-7921 and the 023 is the etizolam. \r\n\r\nFeeling very anxious and knowing the power of just 2mg of etizolam verses very slight effects from 100mg of AH-7921 I decided to take 1 mg of each just to be 100% sure and I'm really happy that I did.  If I would have taken 100mg of (unique ID 013) I most certainly would have died.  Now I can't be sure what caused the mix-up but let's just say that somebody put the stickers on the wrong product or that the person who sent the reply was wrong but in doing so they essential just stuck one bullet in the the gun and spun the chamber of a gun that could only hold 2 bullets.  I really felt at this point that I should share this experience.   \r\n\r\nI feel that I'm a responsible drug user but I know people wthat would have just taken a small amount of each and that would have been that.  If you were to ingest just 10 mg of etizolam you would be close to death.  I know that one of my mg scales is off by 5 mgs which is an incredibly small amount of powder. If you decide to try some of these chemicals please be careful.   Anybody that uses these chemicals is obviously already getting high or drunk and if I would have been I might have just taken the vendor's advice and would be dead that's all it would have taken.  This is serious stuff and should be taken as such.  I hope this helps at least one person who was thinking about trying these substances because if taken correctly they can really complement each other but it's extremely dangerous.  There are several ways that are relatively easy to measure this stuff correctly and I can't stress enough on the importance of this.  If you have to use the internet to figure it out just DON'T DO IT.  Again please be careful and if you decide to try it I would always recommend trying just 1mg of each substance or at least order things in different quantities.   Best of luck\n\n\n\n\n\nExp Year: 2012ExpID: 101967\nGender: Male \nAge at time of experience: 32 \nPublished: Jan 29, 2015Views: 5,045\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}