{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t 30 mg\n\t\t insufflated\n\t\t 2-Fluoroamphetamine\n\t\t (powder / crystals)\n\t\t\n\t\t\n\t\t   T+ 1:30\n\t\t 30 mg\n\t\t insufflated\n\t\t 2-Fluoroamphetamine\n\t\t (powder / crystals)\n\t\t\n\t\t\n\t\t   T+ 3:20\n\t\t 20 mg\n\t\t IV\n\t\t 2-Fluoroamphetamine\n\t\t (powder / crystals)\n\t\t\n\t\t\n\t\t   T+ 4:15\n\t\t 35 mg\n\t\t IV\n\t\t 2-Fluoroamphetamine\n\t\t (powder / crystals)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   155 lb\n         \n\t\n\n\n\n\nAge: 27\r\nGender: Male\r\nDose: Repeated\r\nMOA: Various\r\nSet: Collected mindset. Excited to attempt experiments with a new compound so closely related to one I have already come to know and love.\r\nSetting: Bundled up in layers of clothing in my living room in front of my computer; it is just past mid-November and the weather is cold, but I am warm and comfortable as I begin a series of trials with 2-FA making use of different dosages and routes of administration (ROA) to thoroughly gauge this chemicals potential for utility and recreation.\r\n\r\n2-Fluoroamphetamine (2-FA) was a logical next step for me to attempt after coming to know and appreciate the nuances of its chemical cousin 4-Fluoroamphetamine (4-FA) - and, boy, what the adjusted placement of a molecule can do for the effect profile of a CNS stimulant! To be more specific, 2-FA does not vary significantly from 4-FA on a structural level, but has its own distinct personality when the subjective experience in vivo is considered.\r\n\r\n2-FA, like 4-FA, is a very white powder with something of an acrid citrus smell. It is a caustic compound to the membranes of the human body, and creates a significant burning sensation coupled with irritation when it is exposed to the bodys mucous membranes via insufflation. One 15mg inhalation per nostril resulted in a bloody nose, which I found surprising. Many tout 2-FA to be less caustic than 4-FA; I have never snorted 4-FA, and if so many voices are correct, Im well glad that I didnt!!\r\n\r\nT+0:00 I weigh out 30mg of 2-FA divided into two small piles of 15mg each and insufflate each pile - one per nostril. After two seconds I detect the rise of a sharp stinging sensation that causes my eyes to squint and water. I note that the duration of the burning sensation is only around ten seconds and, compared to substances such as the family of 2C-x compounds, 2-FAs burn is minor and easy to deal with.\r\n\r\nT+0:02 I feel as though I am coming up already. I quickly and smoothly find myself more alert, content, driven and clear-headed than prior to the experiment. 2-FA appears, at first glance, to be much more forgiving on the body with respect to its lack of PNS stimulation. In many ways, this feels quite cleaner than dextroamphetamine.\r\n\r\nOne thing that I make sure to note immediately is the lack of strong 5-HT antagonism that characterizes 4-FA so well. 2-FA is pure stimulant, and descriptive words for its unique feeling that come into mind are clean, clear, bright, crisp, lucid and consistent. Gone is the sensation that makes 4-FA comparable, in the slightest sense, to an entactogen. 2-FA is a no-nonsense stimulant that I find allows me to focus and engage on certain tasks with absolutely no input effort required. In fact, most anything I point my attention to becomes too fascinating to not engulf myself in. As such, 2-FA could prove to be one of the most ideal study aids I have ever come across.\r\n\r\nT+0:50 I have had an incredibly productive past hour; the motivation 2-FA produces seems intrinsic and not drug-induced. It feels natural and clean-cut. Not forced in any way. Gone, too, is the tendency I experience on dextroamphetamine whereby I am stimulated but too easily distractible to accomplish much of anything. On 2-FA, the effort was effortless.\r\n\r\nT+1:15 I note at this point that the effects have hit their ceiling and may even be decreasing by this point. Not terribly bad for such a small, insufflated dose. Im thoroughly impressed. 2-FA presents me with no problem on its come-down: There are no physical effects that would cluster together to form something of a crashing sensation. Instead, there is simply a gentle and consistent downward slope in the intensity of the bright energy Ive been riding for the past hour or so. 2-FAs comedown may even be more gentle than that of Desoxyns (dextro-methamphetamine). I find this remarkable and impressive.\r\n\r\nT+1:30 Re-dosing easily brings me back to where I was in the beginning. The effects appear to be additive, as I feel *more* of what I felt earlier, rather than a simple prolonging of the original effects duration. Though euphoria isnt a mainstay staple of the 2-FA experience so far, with the redose, I am beginning to detect hints at the compounds potential for producing a nice euphoria at the appropriate dosage.\r\n\r\nT+2:00 Remarkably, I am still not suffering from annoying physical difficulties I associate with amphetamines like nystagmus, bruxism, excessive sweating, tremors, elevated BP and dehydration. My pulse has risen since the beginning of the experiment modestly; from 72 to 80. Nothing for me to feel concerned about.\r\n\r\nT+2:10 I blow my nose. Uh-oh. Chunks of mucous and a good amount of blood appear in the tissue in my hands. Although I have no pain inside my nostrils, I immediately do not like looking at this. I want to pursue 2-FAs capacity for producing stimulant euphoria, but I do not want to continue exposing my nasal cavity to this abuse.\r\n\r\nT+2:45 At this point, I decide to prepare 20mg of 2-FA for intravenous injection. If it is anything like 4-FA, it should not be caustic to the vein in the same way it is to the mucous membranes. The lack of PNS stimulation encourages me at this stage, too, but I know that I am entering largely uncharted waters here. I have yet to read of another experience report involving injected 2-FA, and thus I take every precaution to ensure that my method is sterile and safely premeditated as it can be.\r\n\r\nT+3:20 With 20mg 2-FA dissolved in 0.7 CC of bacteriostatic water, I prepare the injection site with 91% isopropyl rubbing alcohol and administer the injection using a 30 gauge needle. After a brief pause of only five seconds or so, a clarity in my consciousness unlike that I have ever experienced before washes over my minds freshened slate. At first, that clarity of mind is all that I can really make note of, but then - sure enough - rising from within me is an intrinsically beautiful form of euphoria in so many ways different from that of any other amphetamine or amphetamine derivative I have experienced before. It isnt a superficial (albeit intense) euphoria like that from cocaine, and neither is it that particular methamphetamine-induced euphoria. Neither does it mimic the euphoria from entactogenic drugs like MDMA, 5-APB, etc. 2-FA has a euphoria all its own, which is neither overwhelming nor superficial.\r\n\r\nI am supremely content with whatever it so happens I am doing at the time (at this specific time, I was reading scholarly articles about the 5-HT binding affinities of some of the more well-studied phenethylamines of past). \r\n\r\nT+4:00 As might be expected, 2-FAs duration (already a short one at that) is even shorter when administered intravenously, and I feel myself returning close to baseline by the forty minute mark. The urge to redoes does not pester me as with other amphetamine derivatives, and I do so more for the purposes of extending the scope of this experience report rather than out of a compulsion to feel good as quickly as I can. This underscores a fact that is clear in my mind - namely, that 2-FAs liability for addiction (characterized by compulsive re-dosing behavior) is dramatically less than can be seen with the classical meth/amphetamines despite its shorter duration of action, which is an intriguing characteristic worth revisiting later.\r\n\r\nT+4:15 I re-dose intravenously, this time with 35mg. I feel safe doing so; this compound appears to be so much more forgiving on my body and mind than most other unexplored stimulant derivatives these days. Once more, I am met with a gush of clean stimulation, followed by a stronger euphoria than before. 2-FA, I conclude, is a very interesting and enjoyable stimulant that differs significantly in subjective experience from all others, including (and almost most especially) 4-FA. At times, 2-FAs cleanliness was reminiscent of dextroamphetamines, but always it was more clean than that and promotes a higher degree of successful focus. A real winner, all-around.\r\n\r\nI wonder what 3-FAs duration looks like. 4-FA has a notoriously long duration of action (something akin to ten hours, most definitely) and can feel more taxing due to its more prevalent stimulation of the serotonergic system. 2-FA has a very short duration of action no matter how it is ingested, and yet lacks the compulsion that makes the use of other amphetamines so problematic for others. In terms of euphoria, one may well find that he or she needs to work at it in order to achieve euphoria from 2-FA. Rest assured, however, there is euphoria to be found, and of a character all 2-FAs own.\r\n\r\n2-Fluoroamphetamine represents a welcome departure from 4-FAs side effect profile and may provide a promising outlet for those seeking a good, honest CNS stimulatory boost whilst avoiding the pitfalls that befall the use of other stimulant drugs. My only wish would be that the chemical were less caustic to absorptive body tissues, and that it lasted a bit longer.\r\n\r\nAll around, however, this is a highly viable tool for productivity,s sake. It would, with ease, be a welcome addition to a night out (or in) where some stimulation with lesser consequences would heighten the experience.\r\n\r\nAlthough I enjoyed 4-FA a lot, I do not think I will be revisiting it. 2-FA, on the other hand, I would most certainly like to revisit again. I would probably consume it orally next time to gauge the longest-possible duration of action I can achieve with it. But really, a real winner in my book with a completely unique expression of clarity and brightness all its own.\n\n\n\n\n\nExp Year: 2013ExpID: 101915\nGender: Male \nAge at time of experience: 27 \nPublished: Jan 6, 2015Views: 8,934\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n",
  "doses": [
    "T+ 0:00 30 mg insufflated 2-Fluoroamphetamine (powder / crystals)",
    "T+ 1:30 30 mg insufflated 2-Fluoroamphetamine (powder / crystals)",
    "T+ 3:20 20 mg IV 2-Fluoroamphetamine (powder / crystals)",
    "T+ 4:15 35 mg IV 2-Fluoroamphetamine (powder / crystals)"
  ]
}