{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t 70 mg\n\t\t oral\n\t\t Lisdexamfetamine\n\t\t (capsule)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   175 lb\n         \n\t\n\n\n\n\nBackground - Not very experienced with drugs. I've smoked a lot of weed and tried LSD one time(didn't feel anything, probably just too low of a dose). My friend gave me a 70mg pill of Vyvanse and I decided to take it a day where I didn't have to do anything and to clean.\r\n\r\nT + 0:00 -- 12:15 pm. Just came back from class. Had about 8 hours sleep the night before. Feels like an average day. I take the capsule and I lay in bed.\r\n\r\nT + 15:00 -- No noticeable effect yet. I decided to smoke a bit of weed (about 1/4 of a bowl of some good OG Kush, I have a pretty low tolerance because I've been on a t-break.)\r\n\r\nT + 30.00 -- I'm feeling a decent buzz from the weed. Nothing from the Vyvanse yet.\r\n\r\nT + 1:00:00 -- Haven't felt anything before now (probably because of the weed). I start feeling a bit anxious, nothing big. I decide to get up and start cleaning.\r\n\r\nT + 1:15:00 -- I start to get into the cleaning and I'm really enjoying it. I'm cleaning very enthusiastically and fast, I'm able to do a good job with the simple tasks I'm performing.\r\n\r\nT + 1:30:00 -- At this point I'm feeling really good. I have music playing fairly loudly as I have the house to myself. I find I'm able to do repetitive tasks quickly without feeling fatigue or boredom. Really enjoying the music. I alternate between picking music while talking to my girlfriend online and cleaning various things. I walk fast and feel very energetic.\r\n\r\nT + 2:00:00 -- I realize I've been clenching my teeth and I'm able to type fast (typing at that speed normally I'm not as accurate). I get sidetracked from cleaning and keep trying to find new music to put on a playlist. I feel really passionate about this playlist and music in general. Still feeling totally positive\r\n\r\nT + 3:00:00 -- At this point I've gotten sidetracked from cleaning completely. Having some thoughtful conversations with girlfriend about music and movies, constantly looking for new music and reading up on various things with interest and vigor.\r\n\r\nT + 3:30:00 -- Not feeling the effects of the weed anymore.\r\n\r\nT + 4:00:00 -- I realize I've been crouching at my computer for the past two hours, decide to go back to cleaning. Still feeling really good.\r\n\r\nT + 5:00:00 -- I start a lengthy discussion about drugs with my girlfriend, this conversation continues over text for about 3 hours. I type long responses and send them quickly. As other users have reported, my words feel totally concise and I don't have to really think about what I'm typing (It might be better writing than when I'm sober). Still feeling good although I keep clenching my teeth. Every breath I take feels good.\r\n\r\nT + 8:00:00 -- The past three hours I have cleaned, listened to music, and focused on the conversation I'm having. I haven't eaten anything for about 8 hours so I decide to eat some cereal although I don't feel hungry. At this point I sit down, I can tell my body is tired but I don't very feel tired. I continue cleaning. I don't seem to be as interested in the music as earlier.\r\n\r\nT + 9:00:00 -- I rest and I feel very tired. I've been up on my feet all day and I'm starting to feel it. I don't feel content resting even though I know I did quite a bit of cleaning. Feeling a bit anxious.\r\n\r\nT + 10:00:00 -- I feel sober. A bit tired but not much and everything feels back to normal now.\r\n\r\nT + 15:00:00 -- Typing this out at 3 in the morning, my sleeping schedule is pretty wacky so being up right now is normal for me and I'm not sure how it will affect my sleep. I don't think it will at this point.\r\n\r\nConclusion: Overall, I like Vyvanse. I will be doing it again in the future but not often as there is addiction potential. It made me feel focused, energetic, talkative, and sociable. Worth noting is that I didn't experience time going by slower than usual as other users have reported. For me it felt like time went by very fast (I spent two hours literally crouched where I set my computer). I also did not experience dry mouth as other users have reported. The negative side effects I experienced are teeth clenching, loss of appetite and minor anxiety.\n\n\n\n\n\nExp Year: 2012ExpID: 101907\nGender: Male \nAge at time of experience: 18 \nPublished: Sep 1, 2014Views: 13,169\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}