{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t 40 mg\n\t\t oral\n\t\t Lorcaserin\n\t\t (powder / crystals)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   180 lb\n         \n\t\n\n\n\n\nWithout a plan on this snowy day, I decided I would test run Lorcaserin.  30 minutes after eating lunch, I took the plunge...\r\n\r\n3:01 - 40 milligrams of powder in a small pipette was filled with water and downed.  I immediately ran to the upstairs bathroom to gargle some mouthwash as the taste of the powder nearly made me vomit - bitter, vaguely sweet, acidic.  \r\n\r\n3:07 Feeling somewhat alert, but likely from the mouthwash episode.  Have an excessive amount of saliva, also most likely from the mouthwash.  \r\n\r\n3:17 Slightly speedy.  That familiar euphoric warmth you feel before a trip.  Always hard to distinguish this effect from the anticipation of having taken a substance known to be hallucinatory.  \r\n\r\n3:20 No, there's definitely that warmth one gets from speed with some of the familiar tiredness in the muscles.\r\n\r\n3:25 relaxed and mellow.  Reminds me of philosopher stones, (psylocybin truffles).  Warm feeling of well-being.  Heart beat and pulse is slightly elevated.  Muscle exhaustion becoming more pronounced.\r\n\r\n3:57 Some extra sensitivity to sound and light. Mild speediness.  No ideas come to mind - just blankness.\r\n\r\n4:18 Slight tightness in chest; slight tingling sensation in teeth.  Eyes watering.  Aside from somewhat heightened senses, I feel tired and a bit scatterbrained. \r\n\r\n4:43 Increased alertness.  Lightheadedness noticeable when walking around.  No appetite whatsoever.  Tendency to teeth grind - mild jaw tightness but nowhere like other substitute amphetamines.\r\n\r\n4:55 some of the physical effects of a trip but really none of the mental.  going to take shower and evaluate w/a new set/setting.\r\n\r\n5:30 No real heightened sensitivity to touch (shower didn't feel especially great).  Mood is a flatline.  Feels very similar to ritalin mentally with a smidgeon of TMA-2. I've never been a big fan of taking small amounts of phenylethlamines.  The physical effects, while not dysphoric, have never commanded my interest like the mental aspects; likewise, Locaserin has all of the anticipatory sensations of a hallucinogen at the 45 min mark, but never feels destined for a peak.  \r\n\r\n6: 13 Staring at (through) a wall is easily facilitated by the drug (similar to other 5HT2A agonists), but I find I'm not focusing on the wall but rather have a 1,000 yard stare - vision is mildly affected in that it's difficult to focus with a tendency to look through objects.  Where the same wall on LSD may elicit a focus on that wall excluding all else (in the ideal circumstance allowing for the observer to transcend ego and experience the wall), it's difficult focusing on pretty much anything.  There's a resemblance to ketamine (or being very drunk) where seeing loses continuity and becomes a series of inexplicable edits.  This is very mild here but reminiscent nonetheless.\r\n\r\nThe 'warmth' continues physically, but mentally there's little of it.  I'm a cold machine.  Appetite is returning a bit.  Feeling a bit tired, lethargic.  Drug is not impacting mental functioning either positively or negatively. \r\n\r\nSummary\r\n\r\nOf all seratonergic compounds I've sampled, Lorcaserin reminds me most of TMA-2 in that it has many classic physical effects of the phenylethlamines with few if any emotional or intellectual effects.  I recall, on a 100 mg dose of TMA-2, feeling physically like I was having a +3 while having the trip powerless to sway my very sober mind.  On a far smaller dose of Lorcaserin, the physical trip sensations are apparent (but not overpowering) with no interference in thought or mood.  The loss of appetite was very stark but now, 3 hours later, I'm getting hungry.  Perhaps daily dosing will provide more prolonged appetite suppression (not like I plan to take it again).  Maybe if I gain another 200 lbs ;).\r\n\r\nWhile Lorcaserin has been labeled a substitute-amphetamine (and, emotionally at least, it's leaving me cold like an amphetamine) I could definitely sleep on it.  Like other substitute amphetamines, it's proven near impossible to get an erection.  Luckily I have 3 hours until my girlfriend comes over...  Whereas amphetamine leaves me quite emotionless, empathy is not completely out of the realm of the lorcaserin experience (it's just never something that asserts itself as a possible).\n\n\n\n\n\nExp Year: 2013ExpID: 102072\nGender: Male \nAge at time of experience: 30 \nPublished: Apr 22, 2015Views: 2,485\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}