{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t 200 mg\n\t\t oral\n\t\t BK-2C-B\n\t\t (capsule)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   72 kg\n         \n\t\n\n\n\n\nHaving previously experienced this compound at an oral dosage of 130mg, I had been left somehow underwhelmed. A slight entactogenesis, enrichment in sound, taste, and smell, somehow brighter colours, minimal patterning on the pavement was all there had been. However, escalation of dosage to 200mg changed the set of things dramatically...\r\n\r\nNow, I've done a hearty array of psychedelics/dissociatives including, but not limited to, mushrooms, Ayahuasca, cacti, yopo, Ipomoea, Hawaiian baby woodrose, LSD, DXM, mexphenidine and smoked DMT,among others. I'm mentioning that in order to provide the reader with the understanding of the relative background against which the effects of substance in question, bk-2C-B, will be compared.\r\n\r\nSo, after an abstinence from food for 6 hours, 200mg of the sticky white powder was placed in the gelatine capsule and swallowed. The reasoning behind encapsulating the compound was the theory that bk-2C-B forms dimers when in neutral and basic solutions, rendering the compound inactive - so that simply dissolving the powder in a glass of water and gulping it would not be the best route of administration. As previous experience with the given substance had left me with a somehow annoying cough, a preventive measure was taken: an antihistamine claritine, 5mg, was ingested, and a fixed mixture of beta-adrenomimetic/corticosteroid was inhaled. This proved beneficial, in retrospect.\r\n\r\nThe onset began in approximately 30 minutes. A previously unfamiliar sensation of intense tingling along the scalp and back of the head was felt. Then, a series of rhythmic contractions of peripheral musculature, aka shivering, ensued. This seemed to particularly involve the muscles of mastication. This was compounded with the 'buzzing' sensation within the body-it was akin to paraesthesia one gets when compressing the nerve of on an extremity (i.e., the ulnar nerve at the elbow-sure everyone knows that tingly-numb sensation?), yet it was felt deeply within the body. Oddly but not unexpectedly, a series of yawning outbursts took place. Then, the dreaded increased mucus production began, manifesting as a desire to clear the throat-familiar to all chronic smokers. No cough, though! Additionally, the characteristic oddly numb feeling in the mouth cavity developed. This was highly reminiscent of LSA, blotters, and cacti. Of course, the expected nausea was soon to join the already dissatisfying agenda of nasty side effects. To sum up, the comeup was pretty rough physically, and could probably have been overwhelming, had I not previously experienced Hawaiian baby woodrose (worst nausea ever), cacti (extreme shivering!), mushrooms (yawn-myself-to-death), and Ayahuasca ('oh my god, I'm gonna die for sure') beforehand.\r\n\r\nOn a bright side, the pleasant effects were also observed in a matter of hour after the ingestion. A slight movement of the wallpaper was noted, which was then accompanied by the general mood elevation and the overall 'trippy' feeling. These effects continued to pick up in intensity, especially the visual ones. What began as a vague 'crawling' of painted surfaces every psychonaut is highly accustomed to soon evolved into a more complex illusion. There, a usual fractal pattern of textures 'overflowing' all surfaces looked upon developed, but it was ornamented with a peculiar net of intensely pulsating red dots scattered throughout it. These series of red dots pulsating at ultrahigh speed had been previously observed during the comedown on smoked DMT, but not when under influence of other substances. In a matter of hours, the whole visual scene was pretty much indistinguishable from that produced by 3 grams dried cubes or 1 blotter of acid, to give you the approximation of the degree of OEVs. Yet, the visuals were remarkable and with their own character. Much less flowing and outstretched than those seen under Ayahuasca and mushrooms, but rather more circumscribed, more regular, 'orderly' so to speak..and definitely 'sparkly'! Indeed, sparks observed were pretty unique to this chemical. These shared some similarities to the effects seen while under the influence of Trichocereus spp (cacti) and were especially prominent around the glowing objects..most notably neon lights. Besides, a considerable 'trailing' of moving objects was also observed, which again was pretty remarkable due to its 'grainy' and 'sparkly' qualities..as opposed to soft and flowing trails typical of mushrooms/Ayahuasca.\r\n\r\nI cannot comment much on the subject of closed eye visuals..since I do not personally consider them 'visuals' in the first place. That being said, I rarely willingly close my eyes while tripping. However, even briefly closing my eyes resulted in a multicolored explosion of Mandelbrot's set multiplying itself into the infinity...something worthy of appreciation by a seasoned CEV connoisseur, I presume!\r\n\r\nAs for the emotional side - it was pretty neutral. Positive, yet not overly pushy. A definite entactogen, yet far from DXMish 'let me hug you!' and definitely not a 'bro' style one gets from booze. It is cool in a way that one can easily engage in socialization if wishes... and still retain as much of an interpersonal distance as desired.\r\n\r\nRemarkably, a high degree of introspection and re-appreciation of life's values was noted. This was 'soaked' in utmost feeling of immense gratitude - to the Universe, to my friends, and, most importantly, to my parents. So, even though this substance was not taken with explicit intention to delve into the depths of subconsciousness, it surely showed it considerable potential as a tool for deep self-exploration. \r\n\r\nTo recap: it's not just an eye candy, it is as psychedelic as it can get! Which implies it is not devoid by all too familiar nasties one learns to hate and love when dealing with 5HT agonists... obsessive ideation, paranoia, looping of thoughts etc are all there! Yet, these possibly unwelcome intrusive thoughts are very manageable. Nothing close to a 2-blotter 'They are coming after me!' freak-out.\r\n\r\nTo sum up, it was a very rewarding experience. I'm typing this while still under the influence (the words on the screen are melting into each other and glowing with an alienly green halo around them-sweet!)..which is at T+12:00 after the ingestion. This implies that bk-2C-B can provide a potential full-day-long trip..excellent in many aspects: 1)it is not overly taxing on the body; 2)endows minimal mindfuck; 3)reasonably stimulating, yet not to the point of jitters; 4)moderately entactogenic, yet not obtrusive 5)highly visual, which is surprising 6) provides one with enough tools for elaborate introspection - if one chooses to indulge in delicate self-excavation, there's plenty to be found with the aid of this drug...however, the substance does not mind being used recreationally - which can not be said about Aya/DMT; and, finally, 7)legal for the time being!\r\n\r\nThat being said, I would highly recommend this substance to anyone interested in a solid psychedelic experience. Be prepared for the bumpy comeup, though, and make sure you do not eat anything for a minimum of 6 hours beforehand, for if ingested on a full stomach, this substance can take ages to start manifesting itself. Worry not, though- you will be able to eat and actually enjoy the taste of food after the comeup nausea has passed (at T+3:00 it is gone for sure). Some metoclopramide can be taken to ease this nauseous aspect out, if one wishes. As had been noted, the effects at 200mgs are totally unlike those at 130mgs (which were a bleak + on a Shulgin scale), and, in my personal opinion, it is at 200mg+ range that this substance should be taken-if one wishes to explore its full potential, that is. Overall, the compound bears considerable resemblance to LSA/cacti and in both its positive and side effects, and is pretty unlike mushrooms/Ayahuasca. This can probably be explained by its phenethylamine structure, I guess.\r\n\r\nP.S. I was on a ketogenic diet while consuming the drug. This may or may not have affected the experience. Anyways this is something worth noting since we are talking about a beta-KETONE of 2C-B, after all...\r\n\r\nKeep it smart, keep it safe, keep it legal!\n\n\n\n\n\nExp Year: 2013ExpID: 102190\nGender: Male \nAge at time of experience: 24 \nPublished: Nov 16, 2014Views: 21,635\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}