{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t 12 mg\n\t\t insufflated\n\t\t 5-MeO-DMT\n\t\t (powder / crystals)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   120 lb\n         \n\t\n\n\n\n\nThis was my first true drug experience. I have smoked pot occasionally, but never done ANY psychedelics. I was invited to sit in a ceremonial setting, with dear and trusted friends for my 35th birthday. I was told that the experience was 'going to the light only' and that I would not experience any 'darkness.' I had been very interested in DMT, and thought that this was going to be the experience, until a few days before the ceremony when I learned that it would actually be 5-MeO-DMT. A friend did a little research and found many *negative* reports. This brought up a ton of fear for me. I have not been attracted to drugs in general because of deeply embedded negative beliefs from my family (mainly my father), and internalized fear. I was not sure if I wanted to continue on, but decided to at least join the group to hold space and act as a sitter. \r\n\r\nOnce there, the tension inside of me was building--I was very anxious and nervous, yet a deeper curiosity was rising. I talked with one gentleman who had a lot of experience with psychedelics and I confessed that this was my first time doing anything. He said this was his first time with 5MEO as well, but assured me that it would be okay. \r\n\r\nOnce the ceremony began, we were assigned a sitter. I invariably ended up with the gentleman I'd talked to and he was the perfect sitter for me. I sat for him first and his was a calm journey--asking me to hold him and proclaiming how beautiful it was. He had definitely gone to this 'light' place. I looked around at some of the other people's journey's which were loud and full of movement, grunting, purging, and the fear began to rise within me. The first group of sitters wrapped up and the second group began to ready themselves.\r\n\r\nThe powder was laid on after being weighed. I was given a 'medium' dosage so that I wouldn't be just teetering at the edge, but really in the experience. I was to insufflate this with everyone, but became tearful and paralyzed with fear. My sitter offered words of encouragement, and I nearly backed out, but at the last moment the guide began counting down and I found the courage to take the leap of faith and dive into my first ever psychedelic experience. It was almost as if a force greater than me came in and helped me get this substance up my nose. It burned slightly and I recall asking for a blanket. My sitter laid me down with a blindfold and blanket and I waited, fear still pulsing through my veins. Then I began to feel the medicine taking hold. It started in my legs and moved up throughout my body. I recall feeling paralyzed, a pressing, weighted sensation. I could still feel my heart pounding, though I believe this was from fear, not from the drug itself. Suddenly I lost myself and my body, my identity, my ego. I saw some grey and black fractals and felt a falling sensation through layers and layers. An internal voice read: 'I'm dying, I'm dying, I'm dying.' It felt like everything melted away and I was in the cosmos, or rather, the cosmos was me and I was ONE with the darkness or void. I wanted to move but could not, the pressing sensation kept me in this position and I recall reminding myself to 'let go', the whole point of the experience was a HUGE letting go for me. Letting go of fear, letting go of control. This made it deeply spiritual for me. \r\n\r\nI don't recall how I got from there to my hands and knees but our guide had said if we felt uneasy, to get on hands and knees because this felt more grounding. Suddenly I could sensate a plastic bag in front of me and could hear myself vomiting. But this was no regular vomiting, this was coming from a place deeper within. I was making a noise so primal, so deep and instinctual, I couldn't believe it was coming from my body. I was digging deep down within to purge psychic junk. Liquid oozed out of my mouth and though I was still blindfolded, I *felt* it as a yellow color. It was warm and wet and it kept coming and coming...I purged hundreds of times. In between purges, I burped as if to burp out the negative energy too. I got this knowing sense that I had been holding SO MUCH for lifetime after lifetime, after lifetime. All the deaths of the earlier part of the experience made more sense now. I had to die to Self, die to ego, over and over again, to purge out all of these lifetimes of crap I had accumulated. While I was purging, this inner knowing came over me of my Soul's purpose, and deep gratitude flowed for being a soul that could handle all of this. However, another voice of knowing rang in to say, 'You don't have to hold so much for everybody else. Don't do the work for everybody else.' As the purging slowed and I began my re-entry, I began to channel a voice. I was speaking in second person: 'You are so beautiful! You did such a good job! You don't have to hold it anymore! Never hold that much again? Okay? Okay! Deal! Just be, don't need to do all the work for others, you're doing a great job...' and on and on in affirming myself. I believe this was my subconscious talking to me, giving me a great pep talk. :)\r\n\r\nFrom there as I continued to come back to the room and re-enter, the gratitude within me swelled, and I was feeling so much love...in my mind I kept replaying that mantra, 'So much love, so much love, so much love' which felt good to repeat. Then a very orgasmic sensation took hold, much like the feeling you get after sex when your whole body feels satisfied and satiated and GOOD. I kept yelling 'Yea! Yea! Yea!' with great exuberance and holding my sitter tight, asking him to wrap his arms around me and hold me, cuddle me. I interlaced my fingers in his and gripped them tight, I wrapped my legs around his and just let the 'Yea's' come and wash over me...then 'Thank you, thank you, thank you' to myself over and over again. 'You did a great job letting go. Thank you for holding on to so much for everyone else.' \r\n\r\nAt some point in between all of this I also recall allowing myself to wail and cry, and moan from as deep a place as the purging. It was also a letting go, and allowance of the intensity of holding so much for so many lifetimes. I also got a glimpse into my Soul's purpose as being here exactly for this! I'd sometimes wondered what on earth my gifts were, and now it was very clear. I also had a deeper sense of past lives, with a sense that I'd held a lot in the Holocaust specifically. This was a deep knowing Self. My Higher Self rising up to meet me, affirm me, thank me, celebrate me. It was also my 35th birthday. \r\n\r\nBefore we began, our guide asked us to set our intentions aloud to our sitter--I said to mine that I wanted to learn to fully love and accept myself, and release fear. I believe I did. I believe this was one of the most amazing experiences of my life. I died, I purged, I grieved, I rejoiced and celebrated myself, I felt amazing in my body on re-entry, I felt a 'spiritual orgasm' as another writer put it. I learned the spiritual lesson of the medicine. I let go and surrendered and that was the only way through the experience. I would do it again. I felt too that I needed to let go of so much, in order to get to the light. My friend was right--it ultimately is a journey to the light and to the Light parts of ourselves that are often covered over with much and negativity we absorb from others over many lifetimes. I saw my sitter's journey and he said to himself, 'You're on the right path', and 'Loving yourself/Self-Love is the Path.' I'm glad I could overcome my fears and fall in love with myself. I would definitely recommend this journey.\n\n\n\n\n\nExp Year: 2013ExpID: 102106\nGender: Male \nAge at time of experience: 35 \nPublished: Nov 15, 2014Views: 5,316\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n",
  "doses": [
    "12 mg insufflated 5-MeO-DMT (powder / crystals)"
  ]
}