{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t   \n\t\t IV\n\t\t Heroin\n\t\t \n\t\t\n\t\t\n\t\t  \n\t\t   \n\t\t IV\n\t\t Pharms - Oxycodone\n\t\t \n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   175 lb\n         \n\t\n\n\n\n\nOpiate Nightmares\r\n\r\nWell I guess I should begin like most and talk about my previous drug experience. I started with pot and psychedelics and quickly graduated to coke and E. I gulped down sickly sweet cherry flavoured cough syrups and tried research chemicals ordered from the Internet. I had always romanticized heroin and wanted to try it since I'd tried everything else but it never seemed to be around. I never even met anyone that had tried it and I hung out with some meth-addicted street kids and those on the fringes of society but maybe heroin just wasn't popular in Canada.\r\n\r\nI had occasionally experimented with opiates when a friend or myself had an injury or a wisdom tooth removed and could spare a T3 or a Percocet. Flash forward a few years later when my nights of binge drinking and snorting eight balls or rolling all night with a bag of K to comedown were long behind me. My drug use consisted of daily pot smoking and my ritual once a a year trip to the woods to take LSD. I had a good job and a girlfriend. \r\n\r\nAll my drug experience and all the books I read and movies I had seen about heroin couldn't have prepared me for what was to come, sometimes you gotta learn the hard way I guess. It was kinda perfect timing, I had a friend who had a hook up on pills and I started experimenting and then my girlfriend left me and it was open season. Nothing to hold me back. Back when they were still making original oxy a pill would last me all weekend but then by the time they brought out the generics that were snortable unlike the neos I would need to snort half a pill. \r\n\r\nMy dealers started selling this shitty brown heroin and then black tar. I guess in some ways heroin helped me through the heart ache of the breakup and in some ways I needed that. Opiates are the perfect drug. The effects are subtle, the first time I snorted oxy, I thought what's the big deal that wasn't anything special, a joint would fuck me up more. But soon that soft warm blanket becomes pretty appealing. I can still go to work and socialize (as long as I don't get too fucked and go on the nod). It's a lot different then that manic euphoria that comes from cocaine, it's more just a peaceful contentment. Everything is ok and nothing matters. I could see how some people would find it boring but for those like me with lifelong anxiety it was the miracle drug. \r\n\r\nWe didn't just use heroin but anything we could get. OxyContin (one of my favourites), Dilaudid, Hydromorph cotin (they come in 30mg reds, 24 mg greys and yellow 18s, they seem to be pretty popular here in Canada), time-release morphine (peaches and greys as they were called). I was lucky because I worked out of town so I would go on benders all weekend and then clean out at work so I never really got dope sick. Sometimes I would feel very lethargic and have a runny nose after doing it for 5 days. I thought that was weird because I remember reading something William Burroughs wrote in Junky that it takes months of heavy use to really develop a habit and get dope sick. \r\n\r\nLike most cautionary drug tales my honeymoon period with the drug soon faded and lost its fun and I was using more and more and having to experience worse and worse withdrawals. Shitting my guts out, lethargy, sweats, insomnia, aches and pains, running nose and eyes. Like a bad cold but much worse. It was making it difficult for me to work if I didn't have enough gear to make it through the week. I quit hanging out with my non-using friends, I quit doing anything actually. I think it's funny when people say pot makes you unmotivated, I used to do lots of stuff when I was a stoner but since I became a junkie I had no interest in the things I once enjoyed. I think it's funny when people say pot makes you unmotivated, I used to do lots of stuff when I was a stoner but since I became a junkie I had no interest in the things I once enjoyed. I was content to lay around and stare at a wall or a tv, there are weeks I don't remember. \r\n\r\nIt wasn't all bad, I did have some fun, but dope takes something from you that's hard to describe or put into words, it's almost a spiritual kinda thing. As lame as that sounds. If drugs like LSD or mushrooms expand your consciousness, dope narrows it. You don't feel excited to be alive all you do is count down the clock waiting to get dope sick or score a hit. I would have to wear long sleeves whenever visiting family, even in the summer, to hide my track marks. I had a really good job and I had nothing to show for it because all my money went to drugs. But it wasn't the money or the health effects it was that heroin froze me in time, I would never grow or change, I would wake up in 5 years doing the same thing because I never would have to deal with any of those unpleasant emotions. I would never feel the joys and sorrows of being human. I would never get over my ex-girlfriend. \r\n\r\nI was lucky that it was just me and my roommate that used and we only had one connection but whenever we tried to quit for a week we would get a text from our dealers and I would impulsively say yes. I knew I could never quit on my own, I didn't have the willpower. And I sure as fuck wasn't going to some stupid Narcotic Anonymous 12 step program with all their god and Jesus shit. I don't believe in the addiction as a disease model, it's a choice. I chose to do drugs every time and I was fully aware of what I was doing. \r\n\r\nSo my dealers needed a ride to another city about an hour away to pick up their supply and I was to give them a ride in exchange for some pills. I want to clarify that these were not really dealers but mere hustlers, just ripping people off so they could get their next hit. So they gave me one of those fake oxys that is supposed to have fentanyl in them and then another red once they picked up. I told them I was sick and needed to shoot up before the drive so we parked not far from their house and they got out for a smoke and I drove away. We went through their bags looking for money or pills but all there was was make up and open needles. We drove back past their house and threw their bags on their lawn. If I was a real asshole I would have waited till they picked up and stole 30 reds and left them on the side of the highway in the middle of nowhere when it was -25 out and I doubt they were dressed for the weather but all I really wanted to do was piss them off enough so they wouldn't sell to me again. They only had to walk a few blocks home. \r\n\r\nI thought they were gonna threaten to kill me which they had before when they were methed out of their minds for imaginary reasons but they were just disappointed cause I had been a custie for 2 years and I guess they thought we were friends. The fake oxy was bunk anyways, I shot it up and didn't feel anything so I did 4 washes and still nothing, all that was left in the cooker was a sand-like material. I then got violent shakes and couldn't get warm. I don't know if it was cotton fever or a reaction to what was in the pill. It kinda amazes me that oxy is so popular, at least here in a small Canadian city it's more popular than heroin, so that they make counterfeit oxy pills. \r\n\r\nWell it worked, bridge burnt. Today is my second day of withdrawal. Last night I ate 30 mg of Valium and 2 mg of klonopin, which was supposed to last me for four days of withdrawal but I took it all last night just so I could sleep. After many hours tossing and turning and screaming at the walls I slept for a few hours. I can't wait till this is over and I can start enjoying life again. I wouldn't recommend opiates to anybody.\n\n\n\n\n\nExp Year: 2013ExpID: 102180\nGender: Male \nAge at time of experience: 27 \nPublished: Nov 21, 2015Views: 2,043\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n",
  "doses": [
    "IV Heroin",
    "IV Pharms - Oxycodone"
  ]
}