{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t 6 mg\n\t\t oral\n\t\t JWH-250\n\t\t (powder / crystals)\n\t\t\n\t\t\n\t\t   T+ 1:18\n\t\t 1 \n\t\t smoked\n\t\t Tobacco - Cigarettes\n\t\t  \n\t\t\n\t\t\n\t\t   T+ 1:34\n\t\t 4 mg\n\t\t oral\n\t\t JWH-250\n\t\t (powder / crystals)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   196 lb\n         \n\t\n\n\n\n\nBackground\r\n----------\r\nAfter searching several forums and via search engine, I couldnt find any information about taking JWH-250 orally so I decided to give it a try. I have experience with various substances including marijuana, MDMA, 2-C-T-2, 2C-I, PCP, Ketamine, LSD, LSA, Salvia, DXM, MDE, MDA, Methamphetamine, Oxycodone, Hydrocodone, Oxymorphone, Hydromorphone, and Mushrooms. I have also combined these in various combinations, but no previous experience with any JWH compound.\r\n\r\nLogic Behind Dosage\r\n-------------------\r\nSince I could not find any information about oral dosages of JWH-250 I decided to use JWH-018 as a reference material. I came across two different oral dosage ranges for JWH-018; 4-6mg and 8-15mg. Since almost all experiences confirm that JWH-250 is stronger than JWH-018 (when vaporized) I came to the conclusion that 5mg would be a good starting point. This also seemed reasonable since JWH-250 has a lower binding affinity at the CB1 and CB2 (11nM & 33nM for JWH-250 vs. 9nM & 2.94nM for JWH-018 respectively.) In addition I have seen suggestions that the oral dosage is about twice as high as a vaporized dosage; 5mg fits nicely in this range. I also decided to go with the JWH-250 since there seems to be some information to suggest that it might be slightly safer because of the lack of the naphthalene ring.\r\n\r\nStrategy\r\n--------\r\nThe plan was to take one 5mg dose and wait 1.5 hours to assess the effects. If no effects were noted, then a second 5mg dose would be taken and wait another 1.5 hours to assess the effects.\r\n\r\nPreparation\r\n-----------\r\nTo prepare the doses, the intent was to measure out two 5mg doses using a ProScale Precision-10 scale (resolution: 1mg). To measure the dose as accurately as possible, first an empty Carlson #2 gelatin capsule was placed on the scale and tared. Then small amount of the JWH-250 was added to the capsule until the dosage was at 5mg. No other fillers would be added to avoid the possibility of something inhibiting or potentiating the effects. The actual doses measured out were 6mg and 4mg. The 6mg dose would be taken first and after the 1.5 hours if no effects were noted, the second dose would be taken. In the end, the total amount taken would still be 10mg.\r\n\r\nSetting\r\n-------\r\nI was in a relaxed setting with no major stress. Last meal was a tuna sandwich at approximately 5:00pm to 5:30pm which upset my stomach slightly but nothing too bad.\r\n\r\nStats\r\n-----\r\n196 lbs Male\r\nNo physical health problems I am aware of, although I do occasional experience anxiety (especially on the come-up of mushrooms).\r\n\r\nReport (T00:00 = 7:10pm EDT)\r\n----------------------------\r\nT00:00  6mg dose taken with some Pepsi\r\n\r\nT+00:30  Possible effects noticed; slightly heavy eyes. (Shulgin Rating: +/-)\r\n\r\nT+01:00  Still have heavy eyes with slight pressure in the front of the forehead. Definitely feel more relaxed, slightly sleepy, similar to the after effects of a marijuana high. (Shulgin Rating: +)\r\n\r\nT+01:06  Sharp momentary pain in left breast. Not clear if it is attributed to the JWH-250. (Shulgin Rating: +)\r\n\r\nT+01:18  Finished a cigarette and feeling less sleepy. (Shulgin Rating: +)\r\n\r\nT+01:32  Noticing munchy like cravings; going to eat some chips and dip. (Shulgin Rating: +)\r\n\r\nT+01:34  4mg dose taken with Pepsi, chips, and dip. I realize that the food will probably slow the absorption of the JWH-250, however the hunger is pretty strong.\r\n\r\nT+02:11  Nothing much really left possibly due to the second dose being taken with food, or that the first dose wore off and the second dose wasnt enough; I believe it is a combination of both. Eyes are still heavy and the pressure in my head is gone. Still feeling relaxed but (Shulgin Rating: +/-)\r\n\r\nT+02:19  All effects are gone. Slight tiredness remains and hunger but thats about it.\r\n\r\nConclusion\r\n----------\r\nJWH-250 is definitely active orally. I would estimate that the threshold dosage to be around 3-5mg based on what I felt after taking 6mg. However to get a full effect I would estimate that the dosage would have to be a single dose in the 10-12mg range. I realize now that during the experience that my mood was uplifted, but could be pushed to the back of my mind precluding the experience from reaching a Shulgin Rating of ++. Definitely seems that there is potential here. Perhaps at a later date I will try a single 10mg dose with a 5mg booster dose, if needed, after trying it by vaporization so I can have a personal reference to the full effects of JWH-250.\n\n\n\n\n\nExp Year: 2010ExpID: 102295\nGender: Male \nAge at time of experience: 26 \nPublished: Jul 26, 2015Views: 838\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n",
  "doses": [
    "T+ 0:00 6 mg oral JWH-250 (powder / crystals)",
    "T+ 1:18 1 smoked Tobacco - Cigarettes",
    "T+ 1:34 4 mg oral JWH-250 (powder / crystals)"
  ]
}