{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t 6 mg\n\t\t oral\n\t\t 2C-E\n\t\t (powder / crystals)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   196 lb\n         \n\t\n\n\n\n\nBackground\r\n----------\r\nI have experience with various substances including marijuana, MDMA, 2C-T-2, 2C-T-7, 2C-I, PCP, Ketamine, LSD, LSA, Salvia, JWH-081, JWH-073, JWH-250, DXM, MDE, MDA, Methamphetamine, Oxycodone, Hydrocodone, Oxymorphone, Hydromorphone, and Mushrooms, as well as various combinations.\r\n\r\nLogic Behind Dosage\r\n-------------------\r\nMy only previous experience with the 2C series was with approximately 15mg of 2C-I; however I suspect that I had previously taken 2C-T-2 and 2C-T-7 in pills that I thought were MDMA (this is based strictly on my experience compared with other experiences Ive read online). The body load of 2C-I was too much for me.  Since most accounts say 2C-E is stronger than 2C-I, I decided to start with a very low dose based on user reports and Erowid. Based on these resources I figured 5mg would be a good dosage to start off with and if I needed it I could re-dose with another 5mg at the 1.5 hour mark if I was not feeling anything.\r\n\r\nStrategy\r\n--------\r\nThe plan was to take one 5mg dose and wait 1.5 hours to assess the effects. If no effects were noted, then a second 5mg dose would be taken and I would wait another 1.5 hours to assess the effects. A slice of pizza would be eaten approximately 10  15 prior to taken the 2C-E. The only reason I planned on eating this right before is because I had not eaten all day I was afraid that taking the 2C-E on an empty stomach might be a little too harsh.\r\n\r\nPreparation\r\n-----------\r\nTo prepare the doses the intent was to measure out one 5mg doses using a ProScale Precision-10 scale (resolution: 1mg). To measure the dose as accurately as possible, first an empty Carlson #2 gelatin capsule was placed on the scale and tared. Then small amounts of the 2C-E were added to the capsule until the dosage was at 5mg. No other fillers would be added to avoid the possibility of something inhibiting or potentiating the effects. The actual doses measured out were 6mg. The 6mg dose would be taken first and after the 1.5 hours if no effects were noted, a second dose would be weighted out and taken. In the end, the total amount taken would still be 10mg.\r\n\r\n\r\n\r\nSetting\r\n-------\r\nI was in a relaxed setting with no major stress. Last meal was a slice of pizza approximately 10 minutes after ingesting the pill.\r\n\r\nStats\r\n-----\r\n196lbs Male\r\n\r\nNo physical health problems I am aware of, however I do occasionally suffer from anxiety (especially on the come-up on mushrooms).\r\n\r\nReport (T00:00 = 9:50pm EST)\r\n----------------------------\r\nT00:00  6mg dose taken with some Pepsi.\r\n\r\nT00:15  A single slice of pizza was eaten. I also noticed a possible increase in mucous production; however it is unclear if it was because of the 2C-E.\r\n\r\nT+00:50  Possible effects noticed; slight tingling in the head and slight unbalance. (Shulgin Rating: +/-)\r\n\r\nT+00:57  The tingling in the head has turned more into a pressure in the top front hemisphere. (Shulgin Rating: +)\r\n\r\nT+01:09  Notice slight patterns during a TV program I was watching. I also noticed that my peripheral vision was reduced (minor tunnel vision). (Shulgin Rating: +)\r\n\r\nT+01:14  Unusual warming/calming sensation waved over me. It disappeared as quickly as it came. (Shulgin Rating: +/++)\r\n\r\nT+01:18  Stood up to go for a cigarette and noticed trails. (Shulgin Rating: +/++)\r\n\r\nT+01:22  Noticed slight increase in heart rate and unusual tactile sensations. There is also constant yawning. However it is unclear if the yawning is from the 2C-E or just natural. I believe it is natural because my friend (who took 14mg approximately 5 minutes before me) is not experiencing the yawning. (Shulgin Rating: ++)\r\n\r\nT+01:38  Never went for the cigarette because my friend got nausea when he stood up. I do feel much colder but only in the extremities. I also notice that sounds are muffled but sounds are different between my two ears. Left ear seems to be affected more than my right ear. (Shulgin Rating: ++)\r\n\r\nT+01:57  Colors are getting interesting; everything seems to have a red tint. When Im just sitting the coldness is just in my extremities, however when I get up and move I feel cold in my core as well. (Shulgin Rating: ++)\r\n\r\nT+02:15  My friend ended up vomiting. My pupils are definitely dilated now; however I dont know when they initially dilated. Im feeling alternately warm and cold. (Shulgin Rating: ++)\r\n\r\nT+02:32  Cant really tell but I suspect that Im peaking right about now. Everything feels very odd; tactile sensations, auditory stimulation, visuals, and yet very clear mentally. Im feeling very warm and cool at the same time. I am also noticing my face is somewhat itchy around my jaw line, similar to opiates. (Shulgin Rating: +++)\r\n\r\nT+03:03  Visuals arent as much now but the body effects are still very pronounced. I feel very warm, my legs are extremely restless, but at the same time I feel very tired and want to sleep. The body load almost feels like have the flu; it is very odd. (Shulgin Rating: +++)\r\n\r\nT+03:25  The body load is still pretty heavy. The visuals are mostly limited to closed-eye visuals (CEVs) at this time, but I still cant tell if Im past the peak. My stomach is starting to really get uncomfortable. Really wish I could sleep right now. (Shulgin Rating: +++) \r\n\r\nT+03:46  Im definitely coming down now. The pressure in the front of my head has returned and in my ears. It is almost like my head is being squeezed from the sides, but it doesnt really hurt. I think I could sleep now but Im not sure. (Shulgin Rating: ++/+++)\r\n\r\nT+04:00  I have developed a really bad headache. My vision is still unusual. The only thing that comes close is on the come-down of mushrooms, where all the effects are pretty much gone, but there still something not quite right with my vision. (Shulgin Rating: ++)\r\n\r\nT+04:43  Most of the psychedelic effects are gone however Im feeling unusually awake. (Shulgin Rating: +) \r\n\r\nT+05:40  I decided to try and go to sleep. However as I was going to lay down I started feeling effects again. I noticed my pupils dilated again and I started having peripheral visuals and distortions. I decided that I would just try and lie down and sleep it off. (Shulgin Rating: +/++)\r\n\r\nT+6:40  I woke back up around 4:30am. I dont think I was fully asleep but instead I was trancing for the past hour or so. I decided to just closed my eyes and go back to sleep. (Shulgin Rating: -/+)\r\n\r\nConclusion\r\n----------\r\nI knew 2C-E was stronger than 2C-I which is why I started with such a low dose of it. However it was much stronger than I expected it to be at this dose. It really is a unique compound and I can now understand why Shulgin listed it as part of the magic six. My friend was also trying it with me for the first time except he had taken 14mg. During the peak he stated he couldnt even see the TV or read anything because everything was melting together; the colors and visual were overpowering according to him. \r\n\r\nAs strong as it was for my friend, he found the experience rather enjoyable. It should be noted though that he had eaten a slice of pizza and a beef patty around the same time I ate my slice of pizza but he took his dose about five minutes before me. Right before he started feeling the dose fully he vomited, however I never did although I did get some nausea. Based on this I would recommend against eating too much before taking 2C-E, especially at higher doses or if you are prone to nausea when taking psychedelics.\r\n\r\n2C-E was an amazing compound but I would strongly recommend against anyone who does not have a lot of experience with strong psychedelics from doing it for two reasons. One is the steep dose response and second because the experience is very strong and rather long. Although 6  7 hours may not be considered long by some, I feel that because of the body load and effects 6 - 7 hours is long for this compound (e.g. 6  7 hours of MDMA to me is fine and I wouldnt mind if it lasted longer, but on 2C-E 4  5 hours would be better.) \r\n\r\nThis is a compound that once you take it you are in it for the long haul.  On some psychedelics I can focus on something if I really need to, but on 2C-E I couldnt focus on anything strongly even if I really need to and I can understand someone who is not ready for it becoming very agitated at having the effects I described for so many hours. Although the next day I was able to go to work I could still tell that my vision was exactly quite right and I just felt all around different. Not in a bad way but I could still feel some of the body load which made working a little difficult. I personally dont mind this as it is part of the character of the compound.\r\n\r\nOverall I would definitely recommend trying this compound if the opportunity presents itself but be ready for it. In the 2C series I only have experience so far with 2C-I, 2C-E, 2C-T-2, and 2C-T-7, and out of all them I would recommend this one above the others. For anyone with little experience with strong psychedelics/2C compounds, or who suffers from anxiety (as I do) to start with a dose between 5mg  10mg. For experienced people or people with high tolerances I would recommend starting with 10-15mg.  However this is only a suggestion and anybody trying it should use their own good judgement.\n\n\n\n\n\nExp Year: 2011ExpID: 102294\nGender: Male \nAge at time of experience: 27 \nPublished: Oct 24, 2014Views: 5,930\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n",
  "doses": [
    "6 mg oral 2C-E (powder / crystals)"
  ]
}