{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t 45 mg\n\t\t oral\n\t\t Pharms - Tianeptine\n\t\t (daily)\n\t\t\n\t\t\n\t\t  \n\t\t   \n\t\t  \n\t\t Stimulants\n\t\t (daily)\n\t\t\n\t\t\n\t\t  \n\t\t   \n\t\t  \n\t\t Kratom\n\t\t (daily)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   130 lb\n         \n\t\n\n\n\n\nBACKGROUND:\r\nI have a long and torrid history with antidepressants.  I spent 9 years on SSRI's, SNRI's, atypicals, tricyclics and even Risperdal in a vain attempt to treat depression.  No such luck.\r\n\r\nI quit all psychiatric meds around 2008 and began self-medicating with various drugs, including marijuana, opiates, stimulants and the occasional psychedelic. This was quite successful until my run-in with etizolam, which wrecked my health both while taking it and after quitting. I'm now nearly 4 months clean but still experiencing terrible depression, anxiety and OCD symptoms--much worse than ever before. \r\n\r\nI never would've considered taking tianeptine if I weren't in such a desperate emotional state. I never would've considered taking tianeptine if I weren't in such a desperate emotional state.  It's classified as an 'atypical tricyclic', which would normally be enough to scare me off.  I had terrible side effects with Elavil and Anafranil but decided to give tianeptine a shot after some further reading. Studies showing its effectiveness for alcohol and benzo were particularly encouraging.   \r\n\r\nDOSE:  \r\n     13-20 mg tianeptine sodium powder (most frequently 15 mg 3 times daily).  \r\n\r\nPOSITIVE EFFECTS:\r\n     Unlike SSRI's, tianeptine works immediately rather than taking 2 weeks or a month to produce effects.  Upon my first dose I experienced a burst of energy and motivation like I haven't felt in ages.  It even eliminated my desire for the stimulants I take every day upon waking!  It restored the beauty to my favorite music and makes exercise extremely pleasurable.  I laughed surprisingly hard at TV shows I usually think are dumb.  I also get mild visual changes similar to those produced by opiates.  Colors seem brighter and things have a natural 'glow' about them that's hard to explain.  I guess it's like seeing the world in high-definition rather than through a fuzzy screen.  On a scale of 1 to 10, all of these effects are somewhere around a 4 or 5 in intensity.   \r\n\r\nNEGATIVE EFFECTS:\r\n     Vivid dreams (a.k.a. elaborate nightmares) have been the worst side effect so far. Vivid dreams (a.k.a. elaborate nightmares) have been the worst side effect so far.  I've noticed very mild dizziness at higher doses around 20 mg as well as constant dry mouth since starting.  Tianeptine makes food taste AMAZING, which could be considered positive if I weren't trying to lose weight.  There is sometimes a mild sedation after the initial effects have worn off, but again it's very manageable.  My tactile sensitivity has increased to the point I recoil when touched, along with some mild sound sensitivity.          \r\n\r\nAfter not dosing for 8-10 hours, I wake up in a state of mild opiate withdrawal that is relieved by re-dosing.  (I also take tiny amounts of kratom daily but it wasn't causing withdrawals before starting tianeptine).  Symptoms are extremely mild and include shivering, runny nose and irritability.  These symptoms are about a 3 in intensity on a scale of 1-10.  \r\n\r\nCOMPARISONS:\r\n     While tianeptine is a totally unique substance, it shares similarities with a few other drugs.  Like tramadol, it has that 'stimulating opiate with antidepressant' vibe and works immediately.  The nightmares are also very opiate-like in nature, as are the mild withdrawal-like sensations that occur when I haven't taken it in 9-10 hours.  \r\n\r\nLike its tricyclic cousins, tianeptine causes dry mouth and increased appetite for me.  However, the overeating is MUCH more controllable than with TCA's.    \r\n\r\nCONCLUSION:  \r\n     If you're looking to get wasted or nod off into oblivion, you'll be sorely disappointed with tianeptine.  It looks great on paper but has had mixed reviews online, so I'm pleasantly surprised it works so well for me.  It's the first antidepressant that's done anything positive for my mood and energy levels.  15 mg three times per day provides a steady good mood and sense of calm.  I'm now very curious to try its (in)famous brother amineptine, which is supposedly more stimulating and nearly impossible to find.  \r\n\r\nI plan to take tianeptine for only 2 weeks out of each month to prevent tolerance buildup, which happens with most drugs I've taken.  I look forward to seeing what long-term benefits are in store.\n\n\n\n\n\nExp Year: 2014ExpID: 102313\nGender: Female \nAge at time of experience: 29 \nPublished: Dec 14, 2015Views: 447\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n",
  "doses": [
    "45 mg oral Pharms - Tianeptine (daily)",
    "Stimulants (daily)",
    "Kratom (daily)"
  ]
}