{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t 200 mg\n\t\t oral\n\t\t Tabernanthe iboga\n\t\t (extract)\n\t\t\n\t\t\n\t\t   T+ 0:30\n\t\t 200 mg\n\t\t oral\n\t\t Tabernanthe iboga\n\t\t (extract)\n\t\t\n\t\t\n\t\t   T+ 1:00\n\t\t 200 mg\n\t\t oral\n\t\t Tabernanthe iboga\n\t\t (extract)\n\t\t\n\t\t\n\t\t   T+ 1:30\n\t\t 200 mg\n\t\t oral\n\t\t Tabernanthe iboga\n\t\t (extract)\n\t\t\n\t\t\n\t\t   T+ 2:00\n\t\t 200 mg\n\t\t oral\n\t\t Tabernanthe iboga\n\t\t (extract)\n\t\t\n\t\t\n\t\t   T+ 2:30\n\t\t 200 mg\n\t\t oral\n\t\t Tabernanthe iboga\n\t\t (extract)\n\t\t\n\t\t\n\t\t   T+ 3:00\n\t\t 200 mg\n\t\t oral\n\t\t Tabernanthe iboga\n\t\t (extract)\n\t\t\n\t\t\n\t\t   T+ 3:30\n\t\t 200 mg\n\t\t oral\n\t\t Tabernanthe iboga\n\t\t (extract)\n\t\t\n\t\t\n\t\t   T+ 4:00\n\t\t 200 mg\n\t\t oral\n\t\t Tabernanthe iboga\n\t\t (extract)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   75 kg\n         \n\t\n\n\n\n\nSo, for my first time with the Sacred Wood I had planned to take a flood dose. However supply issues meant I did not have enough for that and with my sitters on the way over from out of town, it was too late to cancel. I figured it would anyhow be a good way to get acquainted with the substance, and so it turned outI should add this was strictly a psychospiritual endeavor, and I was not seeking to treat an opiate addiction, although I hoped I might notice a reduced desire for alcohol & nicotine.\r\n\r\nI had 1800 mg of TPA HCl, with an ibogaine content of 70% or about 1300 mg, which I divided into 9 equal gel caps. Starting at 6 pm sharp, I would take one cap every 30 minutes.\r\n\r\nMy journey to here has been long and well planned. I feel like Ive been working on a masters thesis about iboga. Practitioners range from inscrutable forest people at one end of the scale to (occasionally) unscrupulous quacks at the other. The standard western protocol seems to be: take it all at once, and hold on tight. Yet the traditional approach typically uses progressive ingestion over two successive evenings, and try as I might I could find nothing comparing the efficacy of these two approaches. Now, I think I know. \r\n\r\nObviously with the rehab aspect, what info there is online is heavily medicalised, and this can be a bit unsettling for the intrepid psychonaut. I tried and failed to get the EKG & blood tests done, but as Im in reasonable shape & health, I took matters in hand and began preparing a few weeks before: a bit of daily high intensity training, a vegetarian diet, vitamin B6, lecithin and daily low dose aspirin. I also cut out caffeine a few days prior, however that had the side effect of disrupting my normally excellent regularity, and I felt the need to address that! Another poster here said prepare as if you were training for a marathon: maybe a touch excessive, but fair all the same.\r\n\r\nMy room was set up with a small mirror and a candle, again, in imitation of the African approach. I put some leafy plants around my Bwiti shrine, and had a 17 hour playlist of bwiti music all ready to go. A meditation cushion, rug and a bucket completed the set up. I also had a plate with some broken crackers smeared with almond butter, which I planned to nibble with each cap to aid digestion. Finally, I had prepared a paper nganga: a sheet typed in very large font with simple points and reminders in case I lost track, which turned out to be unnecessary. I kept the room far hotter than I would normally like having seen a good article recently suggesting that trying tropical substances in cool temperate latitudes diminishes their efficacy, as your immune system is more aggressive at lower temps.\r\n\r\nI began feeling the effects after the first two caps (T+1). Definitely stimulated, bordering on a warm, gentle euphoria, with gorgeous visual effects. Basically, if I moved my head, it was as if glassy filaments or ripples were hanging in the air at the edges of my field of vision. There were no chromatic effects, and it was not at all intrusive. It was easy to read, for example. Meditation felt awesomely good, and deep abdominal breathing banished any hint of nausea. Holding my breath for a very long time, I felt kundalini beginning to rise. My sitters had arrived not long before 6, and were downstairs with my gf, so I would pop down frequently to give them updates, and motor functions etc. were all fine. By T+2 I had a fairly steady, low volume buzzing, a bit like a striplight going bad, but this didnt bother me at all.\r\n\r\nIt was around T+3 that I stopped going downstairs, as I was by now getting unsteady on my feet, and starting to feel a bit heavy. Coordination was shot, and lighting incense took forever. When somebody came up to see me, I struggled to think of what to say, and how to get the words out. I wanted to let them know I was fine and just really wanted to be left alone, but they stuck to their task.\r\n\r\nResting was fine, but attempting to change position got weird. At one point I tried to go from lying down to kneeling up, and I swear it felt like the house was made of cardboard and being torn up by a T. Rex! Booming, shuddering, I thought I was going to tip headlong across the floor, but it was exhilarating and far from frightening, for the two or so minutes it seemed to last. Back down on the floor, I could feel currents surging up and down my limbs, little ibo spaceships out on a hunt for the baddies. With the hypnotic thrum of the music, I could tell that I was now a very long way from Kansas, but it all felt so so good. I had zero anxiety or apprehension and even my stomach, which had by now started gurgling didnt bother me (and I really hate puking, I go years, decades even between purges).\r\n\r\nI was eagerly awaiting the start of the visionary stage. Staring in the flickering mirror is supposed to encourage it, and I definitely saw odd little photos appear in the mirror out of the corner of my eye. With eyes closed, it was total darkness, and then after maybe a minute or two a little spaceship would peel into view from one corner and spin slowly across my field of vision before disappearing.\r\n\r\nThe whole come-up felt exactly like that, as if I was on a lilo in an empty pool, and somebody had cracked the valve open, so I was very gradually floating upwards through various stages. Having read all the typical descriptions, I had been braced for several kinds of simultaneous dysphoria, but nothing could be further from the truth. Probably around midnight, I started to get the first faces, mostly animal, some human, and all a bit wonky or deformed. After a while, I sensed this was to be my limit for now, as I was pretty much on a plateau with no new signs for a while. This was probably the only point I felt a bit low, having climbed this far and knowing the only way was back down.\r\n\r\nMy stomach felt really full, and I knew a purge would not be far away. About 1.20 AM, it came. I got all 8 shots on target, and it was a swift joyful release. The post-puke bliss easily made up for the failure to get any further with the visions. Given the earlier sensations, I can easily understand the notion of the iboga scouring all your cells for toxic waste to be disposed off. How it pulls it out I have no idea, but the descriptions of it being a master mechanic are spot on.\r\n\r\nI was quite drained by now, and so climbed onto my bed. I doubt I slept, but I dont recall anything significant. I woke early, around 6.30 and felt pretty good, better than I had anticipated. The shimmery tracers were still there, but that was not alarming at all, it was almost reassuring, as if my African Tinkerbelle was still waving her wand in my direction. For the whole of the day, I had a perfectly neutral energy balance, awake, alert, but not twitchy or wired or anything a lesser substance might land on you the morning after. I nibbled a few chips, had a beer or two and a few cigarettes.\r\n\r\nBy around 9 PM I had fallen asleep on the couch, and had to be woken to go back to bed. My gf said while asleep on the couch, I was talking rapidly & quietly, issuing instructions Put that in the study, take the key. No, not this one, that one, over there, all sorts  of mad stuff. What I find highly intriguing about this is that if I had been doing the full traditional rite, this would have occurred right around the time I would have been taking the big banana on the second night.\r\n\r\nI slept well, and again woke very early about 5. And I felt phenomenally good. The tracers were still apparent, they seem to reoccur when you get mobile after a period of inaction, almost as if the dopamine has pooled somewhere within the brain and gets sloshed around as you move. Sex was excellent, I felt 17 again, and then I set off on a long walk through terrible wind & rain. Blessed does not begin to describe how good I felt.\r\n\r\nIm now 4 days in, and still feel on top of the world, in such a clear, transparent way. No pushiness or artificial aspect to it at all. But it was only yesterday that I felt safely able to drive. My respect for this amazing teacher knows no bounds, and I am already scheduling another session some months from now, with a larger amount (around 2500 mg) for the full flood.\r\n\r\nIll stick to the same preparations, except Ill now try kambo the day before too. On the first night, Ill aim to take about half the total, or enough to purge. The second night, Ill take the remainder in a single dose. The key issue here is ibogaine has a fairly short half-life, around an hour, but it then metabolises into noribogaine, which has a seemingly near-endless half-life. So I think approaching the big dose with a system already awash with noribogaine facilitates the journey greatly. I also feel that using the TPA rather than just pure ibogaine helps the body deal with the demands placed upon it.\r\n\r\nA lot of the stuff out there about this beautiful plant carries dark undertones, and emphasises the importance of the single big dose, but as with other traditional substances, I definitely feel the traditional method should be observed where possible. As I have related, the gradual entry into the space is almost trivially easy on the mind & body.\r\n\r\nThe dedicated online communities I tried didnt really help too much, they were worlds away from e.g. dmt-nexus, and neither friendly nor helpful. I guess this may be down to lots of strung-out addicts hanging around, reciting the same old fucking drill. Hence I wanted to get a positive report up on here.\r\n\r\nI cannot recommend the Bwiti music highly enough, and its creators believe it directly steers the process, which I can fully believe. The traditional masters believe that it is either Bwiti music or silence, and using anything else invites problems\r\n\r\nTheres a huge selection of free recordings online.\r\n\r\nThanks for reading\n\n\n\n\n\nExp Year: 2014ExpID: 102498\nGender: Male \nAge at time of experience: 41 \nPublished: Aug 3, 2015Views: 578\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n",
  "doses": [
    "T+ 0:00 200 mg oral Tabernanthe iboga (extract)",
    "T+ 0:30 200 mg oral Tabernanthe iboga (extract)",
    "T+ 1:00 200 mg oral Tabernanthe iboga (extract)",
    "T+ 1:30 200 mg oral Tabernanthe iboga (extract)",
    "T+ 2:00 200 mg oral Tabernanthe iboga (extract)",
    "T+ 2:30 200 mg oral Tabernanthe iboga (extract)",
    "T+ 3:00 200 mg oral Tabernanthe iboga (extract)",
    "T+ 3:30 200 mg oral Tabernanthe iboga (extract)",
    "T+ 4:00 200 mg oral Tabernanthe iboga (extract)"
  ]
}