{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t 4 mg\n\t\t oral\n\t\t 5-MeO-MIPT\n\t\t (powder / crystals)\n\t\t\n\t\t\n\t\t   T+ 3:50\n\t\t 1 g\n\t\t oral\n\t\t Piracetam\n\t\t (capsule)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   78 kg\n         \n\t\n\n\n\n\nDue to the lack of reports on combining psychedelics with racetams, i decided to do this trip report. All entries are written as they happen.\r\n\r\nImportant notes:\r\nEveryone responds to psychedelics differently. In my case, i've found that psychedelics last unusually long on me, and take a lot longer to kick in compared to others. A tab of LSD will affect me for a good 16 hours, and DOC lasts for days. As such, don't expect 5-meo-mipt to last as long for you as it does for me.\r\n\r\nSet and Setting\r\n\r\nI live a comfortable life. While i'm currently unemployed, some smart saving in previous years has left me with a bit of cash to experiment with some novel psychedelics. I've had a bag of 5-meo-mipt sitting in my stash for some time, and my previous experiments with it have been threshold doses, around 1~2mg. There's no particular reason i'm taking this, other than it feels like the right time to do so. For the past 3 days i've been taking 4g of piracetam a day, along with 2g of choline bitartrate. Again, no particular reason other than to see what happens.\r\n\r\nT+0:00 - Between 3 to 5 milligrams of 5-meo-mipt were mixed into a cup of water. My prior experience of this compound make me wary of the speedy rush during the come-up. To avoid this, i've switched to the method of dissolving the dose in water, then slowly sipping it until the desired effects are achieved. It's worked well with 4-aco-DMT, so it should work for moxy. I start with a few little sips. Almost immediately i feel a 'first alert', something i get with all psychedelics. It's not a very discernable effect, and it may be placebo, but there's a warm feeling creeping over my body. This familiar feeling keeps me relaxed.\r\n\r\nt+0:15 - About a fifth of the water has been sipped. I feel energetic, and focused. But it's very different to 5-meo-mipt on it's own. The stimulation isn't the uncomfortable amphetamine-like jitter, it's pure energy. There's some jaw tension, but it's not strong. I decide to play a bit of Dota 2 to give me something to focus on.\r\n\r\nt+0:50 - A third has been consumed. There's a strong sense of energy, and incredible focus. No empathogenic or psychedelic effects are noticeable yet, although my perception seems subtly altered in an unidentifiable way. Most noticeable was my performance in dota; i was generally playing much better than normal.\r\n\r\nt+0:55 - An unusual distortion i've noticed is that when reading text, certain phrases stand out, like they're highlighted or in a brighter font colour. This effect disappears when i look at the highlited phrase, and a new set of phrases becomes highlighted.\r\n\r\nt+1:12 - I start to feel a strong rush, similar to MDMA. There is slight muscle tension, but more than anything i feel like dancing! i put on some psytrance, and mellow out while playing minecraft. It strikes me how incredible the game is, a game about doing what you feel like doing. I can feel the vibrations from the keyboard echo through the table, into the floor, and up through my feet. My senses are enhanced considerably.\r\n\r\nt+3:40 - everything is so enhanced! i can feel the air, i can hear conversations in my neighbors house. Everything feels so alive! subtle visuals are appearing, and disappearing as soon as i see them. I feel at peace mentally, yet physically i'm urging to do something. I don't know what it is but i know i want to do it.\r\n\r\nt+3:50 - i figured out what i want to do, i want to dance! Another gram of piracetam down the hatch, because it's about time i took it.\r\n\r\nt+4:00 - My heat regulation seems all screwy. I'm sitting in front of a fan, pouring water on my head and back to keep cool. Up until now i was having a blast, but this is a bit crappy.\r\n\r\nt+4:05 - the heat problem seems mostly solved, although i still need a fan to feel cool. I've never had this effect before, so i can only assume it's a result of the second piracetam dose. Pre-dosing piracetam seems fine. Boosting during the trip is a big no-no.\r\n\r\nt+4:40 - I go for a walk, to get into nature. I'll see you later trip report!\r\n\r\nt+5:38 - the mdma feeling is completely gone, and replaced with a smooth, psychedelic feeling. It's hard to describe; it's the part of acid that's not the visuals, not the rolling emotions, but the clarity and peace of being one with your environment. Visually it almost feels like everything is seen through a tilt-shift lens. Everything is the same size, no distortions, and yet it all appears so tiny. As a previous researcher put it, it's insultingly non-visual. I'm in a deep psychedelic headspace, where are my pretty colours? I've also realized the overheating i experienced was likely due to spending time in my computer room - it's being used as a crypto-currency mine, and the room is unusually warm most of the time. The body load is unusual, sometimes pleasant, sometimes not.\r\n\r\nt+6:25 - The effects have mostly worn off, leaving me with a pleasant afterglow. Closing my eyes produces faint, static-like visuals, but nothing to really write about.\r\n\r\nt+7:00 - Back to baseline. I feel tired.\r\n\r\nSummary: The combination was overall pleasant. It enhanced the trippy aspects of 5-meo-mipt, without increasing the body load. While it's certainly not my favorite substance (4-aco-dmt will always hold that title) it's certainly a favorite, even better than MDMA in my eyes. But i have to warn people not to take piracetam during the trip - I was on a low dose of 5-meo-mipt, and the overheating was intense. Stay safe, and learn from idiots like me.\n\n\n\n\n\nExp Year: 2014ExpID: 102578\nGender: Female \nAge at time of experience: 25 \nPublished: Jul 13, 2014Views: 2,665\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}