{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t 200 ug\n\t\t oral\n\t\t Allylescaline\n\t\t (liquid)\n\t\t\n\t\t\n\t\t   T+ 1:30\n\t\t 2 mg\n\t\t oral\n\t\t Allylescaline\n\t\t (liquid)\n\t\t\n\t\t\n\t\t   T+ 7:30\n\t\t 15 mg\n\t\t oral\n\t\t Allylescaline\n\t\t (liquid)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   185 lb\n         \n\t\n\n\n\n\nAt the time of this writing there are only four other Allylescaline reports on Erowid, all of which were experiences where the author ingested other substances in addition to Allylescaline itself (amphetamine, cannabis, several beers, or 25I-NBOMe). This is an attempt to describe my first encounter with this compound, without the addition of other chemicals that would cloud the effects. \r\n\r\nPrevious experience with psychedelics: The phenethylamines Ive tried include mescaline once (along with other alkaloids in the form of San Pedro), 2C-T-2 once, and methylone, 2C-I, and 2C-E several times each. As far as tryptamines Ive tasted Psilocybe cubensis mushrooms, DMT, DPT, 4-AcO-DMT, 4-HO-MiPT, and 5-MeO-MiPT a few times each. Ive also tried LSD three times, and Morning Glory seeds and Hawaiian Baby Woodrose once each.\r\n\r\nLast week I received 300mg of Allylescaline from an online vendor. It came in the form of small, transparent crystals with a light brown tint. I weighed the entire sample, which turned out to be within 10mg of the listed weight. I added the contents of the bag to a 60mL glass vial, and measured out 60mL of 95% ethanol in the form of Everclear grain alcohol. I added about 55mL to the vial, and used the last 5mL to rinse the rest of the residue off the inside of the bag before adding it to rest of the solution. Only a few seconds of swirling the vial at room temperature was enough to get all the crystals into solution, which was now at a concentration of 5mg Allylescaline per mL.\r\n\r\nYesterday morning at 08:15 I measured out 0.04mL of solution (about 200µg, or 1% of the low end of the dose range listed in Pihkal) and added it to a few mLs of water in a glass. I didnt notice any taste other than that of the Everclear. I started with such a small dose to rule out a severe allergy or a potential vendor mixup with other chemicals. If I had accidentally been shipped an NBOMe compound, for example, 200µg would be about enough to experience threshold effects.\r\n\r\nAn hour an a half later no effects were noted, so I decided to try 0.4mL of solution (about 2mg, or 10% of a low dose). Again, this was to rule out an allergy or misbranded chemical, as several research chemicals (such as DOC and other substituted amphetamines) are active in this range. I added this amount to a few mLs of water, and a slight bitterness was noted, not appreciably different than drinking a vodka tonic. I waited several hours this time, and no effects were noted.\r\n\r\nAt 3:45pm I stepped up to a full dose. I measured out 3mL (15mg) and drank it in a glass of beer (to conceal the taste) over the course of 15 minutes. I drink 2-3 beers most days anyway, so I didnt expect it to influence the character of the experience. 20 minutes after I finished the dose I was at a + ('plus one') on the Shulgin scale and noted a slight tension in my jaw and that conversation was flowing freely. \r\n\r\nMy scalp tingled slightly, and my face felt somewhat flushed. By 40 minutes in the effects were indistinguishable from 100-200mg of methylone. I felt energetic, talkative, social, and mildly euphoric, with a bit of muscle tension, perspiration and swings in perceived temperature. For about 5 minutes I would add and remove layers of clothing to get comfortable before the temperature effects leveled out somewhat. Remarkably I experienced no nausea whatsoever, which has been ubiquitous in my use of oral phenethylamines and tryptamines in the past. The only gastrointestinal effects noticed were a slight stomach churning (settled with a bit of food) and mild appetite suppression, though much less than with methylone.\r\n\r\nBy T+1:30 I was still experiencing the previous effects, as well as the onset of mild psychedelic effects. Colors were noticeably more saturated, edges of objects were softened (similar to turning down the sharpness on a display), and there was slight warping and pulsing of the environment if I sat still. The mental effects included a light intoxication (similar to a few beers or a small amount of cannabis), some racing of thoughts, and mild anxiety.\r\n\r\nBy T+3:00 the muscle tension, anxiety, and methylone-esque effects began to subside, and by T+4:00 I felt much more like I was under the influence of mescaline or a low dose of 2C-I. I still felt somewhat mentally stimulated (similar to a few milligrams of amphetamine) with the physical stimulation and desire to move around. Sitting and talking to my housemates was incredibly comfortable, and I felt like at this point I could handle myself in public without obviously being intoxicated. One of my (sober) companions noted that all they could tell was that I seemed more interested in everything than normal.\r\n\r\nI spent the rest of the evening watching movies and talking with my wife and housemates while feeling a deep empathy for everyone around me. By T+8:00 the psychedelic effects had almost completely dissipated, and I was left with a slight mental stimulation until I went to bed around T+11:00.\r\n\t\r\nThe next morning I awoke after about 7 hours of sleep with a slight headache and fatigue, but nothing too unpleasant. By the time of this writing (20 hours after the start of the experience) I feel completely back to baseline. Overall the experience was much more empathogenic and entactogenic than I expected, with just a bit of a psychedelic overtone. I could see this being useful in psychotherapy were it not for the fairly long duration. In informal settings (such as among a group of friends) it could work quite well for talking through issues and helping everyone understand each other better. \r\n\r\nAnyone taking this should not expect it to be an alternative to Mescaline, or any other drug, as I found it quite unique in the combination and timing of effects. I plan to sample Allylescaline again in the future, probably at about the same dose, as I see no need to push it any farther.\n\n\n\n\n\nExp Year: 2014ExpID: 102760\nGender: Male \nAge at time of experience: 25 \nPublished: Dec 4, 2014Views: 6,212\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}