{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t 8 g\n\t\t oral\n\t\t Kratom\n\t\t (dried)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   121 lb\n         \n\t\n\n\n\n\nMy friend and I split 16 grams of Red Vein Borneo Kratom powder two ways (making sure to use capsules because it's very nasty tasting stuff) on a warm, summer evening at a beautiful park by my home. In case the experience started to become too overwhelming, it was comforting to know my house was only five minutes away. We hadn't eaten anything since noon to ensure that the Kratom would hit faster and our general mindset prior to ingestion was a mix of relaxation and happiness with a hint of excitement. \r\n\r\nThe capsules were ingested around 5:30pm and it took approximately 45 minutes before either of us started to feel any of the effects. The first sensation I noticed during the come-up was how relaxed my muscles felt and although it was subtle, it was definitely there. We were sitting on a bench and every time I would stretch a part of my body out, say my legs, I would feel some euphoria in those muscles. It felt similar to a good stretch in the morning but even stronger. As I began playing around with this for a few minutes, and keep in mind the effects were still quite subtle, I started to notice every muscle in my body vibrating pleasantly. My entire body felt like I had just walked out of a soothing, relaxing massage. For instance, my legs had felt a little sore in the morning to the point where walking around was mildly unpleasant but this was completely eliminated when the Kratom hit.\r\n\r\nThe body high felt similar to what a low dose of marijuana or a glass of beer induces- it certainly wasn't as euphoric as MDMA or as numbing as Oxy (though I hadn't tried Oxy at the time). But all in all, it was pleasurable enough to enjoy and try again and I was certainly able to function on it just fine. \r\n\r\nThe mind high, or the emotional high, if you will, which I'll begin to discuss in a minute, was really what made me fall in love with Kratom. It took approximately an hour and a half upon ingestion before Kratom changed my 'headspace' and 'attitude' but it was certainly a prominent and powerful effect. I remember feeling a little bit upset about having a long shift at work the next day and thinking about how dull it would be, but as the effects of Kratom started to take over, it literally ceased to matter. In fact, I felt almost as if nothing could faze me and all the small things that I normally found bothersome had no effect on me. I looked down at my white T-Shirt which I had stained outside whilst drinking pop and I began to chuckle faintly thinking- 'how could I have possibly gotten angry over this'?. I remembered feeling pissed when it happened but now it looked so insignificant. I felt in an almost Buddha-like state where my insecurities, worries, and grudges had virtually no power. I wouldn't call it apathy because that implies that I felt coldly towards everything around me which wasn't the case per say. Instead, I felt like I had this protective layer around me that made anything that could potentially be interpreted as emotionally hurtful feel insignificant. It was a liberating feeling- I'm certainly not a person with a dark past, heaps of insecurities, and stored up guilt, but I could certainly see this as being therapeutically beneficial. \r\n\r\nAbout two hours in, my cellphone began to ring and I saw my parents were calling. Even though Kratom's effects felt prominent, I didn't feel anxious or worried to answer, if anything my confidence was higher. Normally when I'm talking to my parents, especially over the phone, I like to cut to the chase and just get to the damn point. Our phone conversation rarely last for more than 30 seconds and usually consist of a simple question that demands an answer: 'when will you be home for dinner?', 'how long do you plan to stay out', etc. I don't have a bad relationship with my parents or anything, I'm just generally not a very 'warm', extra-sensitive, loving person. But on Kratom, I was different. The moment I heard my mother's voice I wanted to talk to her endlessly. I'm just generally not a very 'warm', extra-sensitive, loving person. But on Kratom, I was different. The moment I heard my mother's voice I wanted to talk to her endlessly. It felt really good just talking about 'nothing' with anybody- 'how is your day', 'how are things at work', 'what are you making for dinner?', ANYTHING! I felt very connected to my family and felt a deeper love for them than usual. It was a warm, cozy feeling of pure, unblemished content. If I had a job where I had to interact with customers frequently, whether it be face to face or over the phone, I feel Kratom would be an immense help and actually make it somewhat enjoyable.\r\n\r\nAfter three hours in, I began to head home, still feeling the effects. I decided to lie in bed for a little bit and it felt incredible. Do you know that feeling you get when you wake up in the middle of the night, still half-asleep, you glance at your night clock, realize you still have a ton of time, and drift off back in your dreams peacefully? This was just as good. I began nodding, this is apparently common with opiates, which is an immensely calming experience. I close my eyelids and am essentially encapsulated by a blissful state where half of my mind is in a dreamy world but I'm still with physical reality. It's kind of hard to explain but imagine if you could enjoy the comfort and relaxation of sleeping without actually being asleep and missing it. It was extremely relaxing. \r\n\r\nI turned on a little bit of stairway to heaven and found it to be very soothing. Music didn't sound as enjoyable or euphoric as it does on pot or MDMA, but it was nice nonetheless, as long as it played on a very low volume. After lying in bed for about an hour, I heard the garage door opening which meant my parents had come home. I greeted my parents with open arms, delighted to see them, and suggested that we watch a movie. I don't normally enjoy spending time with family unless it's a special occasion, but this was certainly pleasant. We lit the fire place in my basement, made some warm tea, and watched 12 angry men, a wonderful movie I hadn't seen before. I felt at complete bliss with everything and the feeling of cosiness inside of me was indescribable. After the movie ended, I went to bed and nodded once again for an hour before falling asleep. While I was nodding, it felt like I was almost in a dream that I was controlling. At one point, the lucid dream felt like I was blissfully bouncing on a trampoline, at other points I was running through a green valley. It wasn't as visual as acid or mushroom trips, please don't get that impression. Rather, Kratom made my thoughts feel so clear and I felt so free, that I could essentially live out my thoughts in a dreamy kind of way. I eventually entered real sleep and slept better than I ever have. I woke up feeling incredibly refreshed, happy, and content, like an afterglow as a parting gift from Kratom. This is another reason why I love this substance- unlike other drugs, I actually feel better the next day, not worse. MDMA makes me feel lethargic and desensitized the next day while marijuana makes me feel slowed down. But with Kratom, I felt refreshed, relaxed, and ready to face the world.\r\n\r\nOverall, Kratom made me feel inherently content and humble and emotions of love and compassion were vastly heightened. Negative emotions like hate, jealousy, envy, boredom, and anger ceased to exist within me completely. What I found enjoyable in contrast to stronger opiates like Oxy (which I tried a few months after) was that I was not numbed to the point where nothing mattered. Oxy, although far more enjoyable, was also too overwhelming for me (perhaps this changes with tolerance as I've only tried it once) and I found it hard to form coherent sentences and certainly impossible to function on it. \r\n\r\nThe body high was certainly pleasant too and relaxing and I felt my muscles tingling with mild euphoria. The high lasted over 6 hours and would have probably lasted longer had I dosed earlier and not gone to bed. Nodding was a very enjoyable aspect of the experience and despite the effects being prominent and fairly powerful, I felt absolutely fine being around other people. \r\n\r\nIn short, Kratom holds a perfect place in my heart and has become one of my favourite substances. I've been indulging in Kratom for about a year now, doing it approximately two times a week, and never once have I (or my friend who loves it too) noticed any negative side effects. The only thing I have noticed is that my sexual appetite is reduced when I'm under the influence (it returns more or less the next day) but this really depends on your body chemistry because I've read reports where Kratom acts as an aphrodisiac for some. This stuff is incredibly cheap, it's legal, and I've never felt any physical withdrawals. I'll end this report by telling you my friend's description of Kratom, which I agree with wholeheartedly. 'Imagine the laid back feeling of alcohol without feeling drunk or cocky, imagine the pleasant body buzz of weed without the psychedelic high or time distortions, imagine the heightened empathy and bliss of MDMA without your entire body orgasming- That's Kratom.\n\n\n\n\n\nExp Year: 2014ExpID: 102713\nGender: Male \nAge at time of experience: 20 \nPublished: Nov 22, 2015Views: 2,272\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n",
  "doses": [
    "8 g oral Kratom (dried)"
  ]
}