{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t 5 mg\n\t\t oral\n\t\t 3,4-Dichloromethylphenidate\n\t\t (liquid)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   65.5 kg\n         \n\t\n\n\n\n\nToday I received a 500mg sample of 3,4-dichlormethylphenidate HCl (hereafter 3,4-CTMP), and I must say I am pleasantly surprised by how tolerable its exceptional power has been.  For those less inclined toward reading large bodies of text, the short version is as follows:  3,4-CTMP is, in my early experience, a highly functional stimulant which is quite active even when dosed sparingly.  The onset is quite gradual, and the duration significantly exceeds both methylphenidate and its cousin ethylphenidate.  The character of the experience is distinct in its utility as opposed to its euphoric potential, but its capacity to boost both confidence and mood should not be understated.\r\n\r\n[Erowid Note: \nIsopropyl alcohol is not designed for human internal ingestion and should be avoided whenever possible except for cleaning and external uses. Ethyl (drinking) alcohol should be used whenever possible for solutions that will be ingested.]\r\n\r\nBeing without an appropriate scale, I prepared a solution of 99% aqueous isopropanol @ 10mg/mL, arriving at a total of 50mL.  Solubility tests proved isopropanol to be slightly superior to water, and practically identical to aqueous ethanol of equal concentration.  The entire 500mg batch required approximately fifteen minutes of persistent coaxing to fully dissolve, ultimately achieving homogeneity after gentle heating to 60°C with constant stirring.  The solution held upon returning to room temperature.\r\n\r\n\r\nT:00:00:  Dose: 0.5mL (5mg). I am entering this experiment with an existing tolerance to amphetamines.\r\n\r\nT:01:00:  First effects appearing.  Feels like 8mg ephedrine.  So far, barely noticeable.\r\n\r\nT:02:00:  Still almost undetectable, yet there are some identifiable effects.  Mental clarity has increased significantly; my thinking feels 'open', lucid, orderly, and calm.  Visual acuity is enhanced; I do not require my glasses to read text at the same distance I otherwise would.  With that said, all of this would go unnoticed if I were not being deliberately mindful as to my state of mind and any impacts thereon.\r\n\r\nT:03:00:  No change.  The idea to boost enters my mind, but I think better of it owing to what I've read about the subtlety and power of this compound.  Instead, I prepare a cup of coffee, and make the firm decision to consume it slowly.  In the past, the synergy between caffeine and ethylphenidate has been at times unpleasant.\r\n\r\nT:03:15:  Impact.  Effects are now developing significantly, almost unpleasantly so (but not unpleasantly so).  I am helpless but to focus intensely wherever my concentration happens to fall.  The consequence of this has been the rolling of about 100 plastic bags into loose, orderly knots for neat storage.  This is a task I had been meaning to undertake, but could not find the motivation to actually tackle. I can't discount the caffeine as the source of ignition here.\r\n\r\nT:03:30:  My coffee is now cold and almost entirely unconsumed.  Over half the mug goes down the drain.  This action leads to a thorough cleaning of the kitchen.  I've noticed a profound bronchial dilation:  my airways are wide open, signalling a pronounced effect on the norepinephrine reuptake transporter.\r\n\r\nT:04:00:  Now I am running a replacement coaxial cable from the junction in the garage to the digital cable receiver on the upper floor, as the existing cable is decades old and vastly deficient.  This is another bit of procrastination annihilated by the 3,4-CTMP.\r\n\r\nT:05:00:  I've now cleaned the entire house, and despite sitting down the stimulation is still going strong.  Pulse is normal, but I have the 'feeling' of hypertension.  Some muscle tension has appeared in my neck as well.  The idea to soothe this with cannabis is ultimately rejected, as it seems unwise to place any further strain on my cardiovascular system.  Stretching feels absolutely fantastic.  Come to think of it, my entire tactile facility is enhanced:  now that I am paying special attention to my body, some light yoga proves to be orders of magnitude more enjoyable than it ordinarily is.\r\n\r\nI've begun to notice a mood enhancement as well.  This is especially satisfying, as this material is being explored for its antidepressant potential.  Previously, ethylphenidate had proven excellent for this aim, but its short duration and spotty availability prompted this investigation into another of Ritalin's many analogs.  As someone who has tried virtually all conventional pharmaceutical antidepressants in existence, I am quite encouraged by these early results.  With that said, this level of stimulation is entirely impractical for day-to-day living.  \r\n\r\nT:05:40:  The busy-body effect has subsided somewhat, allowing me to devote meaningful attention to composing this account.  While sitting at the computer, I feel calm, cool, collected.  There is slight trismus, and if not sitting straight it feels almost as though there is an amount of pressure on my heart.  This sensation is quite concerning, and causes me to identify this dose as the upper ceiling for my physiology.  Now seems like a good time for a little bit of passionflower tincture, to take the edge off.\r\n\r\nNow approaching six hours, it seems unlikely that any further noteworthy features will develop.  \r\n\r\nT:08:00:  The stimulation has relented somewhat, but still remains.  Despite relatively mild trismus, there is some lingering, aching tightness in my jaw.  Now feels like a good time to cap this off with a touch of cannabis.\r\n\r\nT:10:00:  I've returned to baseline, and am only now realizing that I've completely forgotten to eat.  I am suddenly incredibly hungry, as though I haven't eaten in days.  Next time, I will be setting alarms to remind me that it's time for lunch/dinner.\r\n\r\nDay after:  Sleep came reluctantly.  Background stimulation persisted for another four hours, bringing the absolute duration to fourteen hours.  Considering that the practical duration is about half that amount, lingering effects are somewhat of a nuisance, though I expect this to lessen after accumulating an amount of tolerance.  I will not be dosing in excess of 5mg, and intend to keep the dose  down to 3-4mg to maximize its therapeutic usefulness.\r\n\r\nAll in all, I'd have to conclude that 3,4-CTMP has revealed itself to be a potent addition to the catalog of cognitive and mood enhancing substances.  Better living through chemistry!\n\n\n\n\n\nExp Year: 2014ExpID: 102947\nGender: Male \nAge at time of experience: 30 \nPublished: Sep 17, 2014Views: 15,132\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}