{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t   \n\t\t  \n\t\t 4-HO-MET\n\t\t (powder / crystals)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   180 kg\n         \n\t\n\n\n\n\nIve recently completed my trial of 4-HO-MET having consumed and shared a total of 5 grams. Ive taken levels anywhere between 20mg and 150mg and normally start off new people with 20mg. Some report that this was too much and would have preferred half, but in general seems a good level.\r\n\r\nThis seems to be a friendly psychedelic. I had only one incident of someone having a bad trip and wanting it to stop on 24mg. Most people report having a good time and laughing in social situations. I have also seen this material create 1 and perhaps 2 plus ++++ experiences. I have observed about 20 other people under the influence of 4-HO-MET. Many of these people were not very familiar with psychedelics at the time. Its a very lovely and easy universe to exist in.\r\n\r\nI consider 4-HO-MET to be a Monday night psychedelic. Its very easy to take this during the week and turn up to work the next day. It does have a really strong tolerance however, and waiting a full seven days is recommended if I want to feel the full effects of this drug again (or any other tryptamine including LSD). I can have an effect by taking it sooner, but the ceiling is lowered, I cannot get as high.\r\n\r\nDosage for me seems most interesting in the 40-60mg range. After 60mg I dont seem to get a lot more stoned. I find the drug to have quite a low ceiling. Memory loss, time loops, tremors and scenery slicing are more common at high doses and can become unsettling if you dont like that sort of thing. At higher doses I can have a lot of movement and complex animated 3D visuals, but rarely does this lead to full fantasy hallucinations. Your mileage may vary, but in general I feel rather grounded in reality on this substance. Great for beginners in general. Great for a trip to the art gallery at low doses.\r\n\r\nDuring the come-up I normally have jelly legs and need to motivate myself to get up. This passes fairly quickly, but a bit of a downside. Making love I also find difficult.\r\n\r\nCompared to 4-AcO-DMT I find it much harder on this material to achieve ego loss, out of body experiences and fully realised hallucinations. It does seem good for telepathy and empathetic connections however. In this way I consider this a softer drug and not as interesting for spiritual research. Closed eyed visuals are also less interesting than on  4-AcO-DMT and 4-HO-MET has more distorted visualisations than patterned in general. Although I have less experience with 4-AcO-DMT at this time (will catch up and submit a report soon though).\r\n\r\nWith the 125mg-150mg doses, I dont find this material very toxic, but its likely you will feel rather lost :) I have observed significant tremors in others at 20mg and if you are one of these people I wouldn't recommend going too much higher. I certainly dont recommend doing a high dose, but it felt safe with a trusted friends and my body chemistry. I most certainly would not go higher though as I dont think it has the potential to get more interesting further than 60mg.\r\n\r\nFor me visuals often include serpents, snakes and ancient beings, sometimes engaged in sexual activity. Visuals require concentration and objects to be still, things that are moving are less interesting (except at high doses). Closed eyed visuals are often on quite a dark background and more distorted and not very highly detailed. On rare occasions, I have had my body dissolve with eyes closed. Open eyed visuals are much more interesting in general I find. Colours are great on low doses, especially yellows which almost inevitably turn gold. My girlfriend finds green particularly disturbing on this material and too much. Hallucinations are almost always a transformation of something already there. e.g. skin turning into scales, or patterns animating into new ordered hallucinations. On low doses its definitely a good cloud watcher, freezing a section of clouds in a hallucination, and moving onto a neighbouring set of clouds, and freezing that can produce large and interesting images. It also is quite easy to rotate these cloud hallucinations in three dimensions with practice, and also have them animate or repeat across the sky. All in all this material can be a lot of fun and is a fairly easy psychedelic for inexperienced people at low doses.\r\n\r\nPeace, Love, Light and Stay safe!\n\n\n\n\n\nExp Year: 2014ExpID: 102905\nGender: Male \nAge at time of experience: 35 \nPublished: Sep 13, 2014Views: 4,007\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n",
  "doses": [
    "4-HO-MET (powder / crystals)"
  ]
}