{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t   \n\t\t smoked\n\t\t Cannabis\n\t\t  \n\t\t\n\t\t\n\t\t  \n\t\t 2 hits\n\t\t buccal\n\t\t 25C-NBOMe\n\t\t (blotter / tab)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   250 lb\n         \n\t\n\n\n\n\nNot long after my first experimentation with psychedelics, my significant other suggested we have a day trip. The idea instantly interested me, as my first trip really compelled me to go outside. The thought of going outside and experiencing visuals during the day light was something I simply could not resist. \r\n\r\nI made sure to be fully hydrated and nourished with food, because for me preparing for a trip on psychedelics is most enjoyable when your body has what it needs to sustain energy and mental sharpness. Before taking our tabs, we smoked a couple of bowls of some delicious sativa and listened to some relaxing music to set the mood. The room was dimly lit with white Christmas lights and there was only a little sunlight peaking through the windows. \r\n\r\nWe each put two tabs under our gums in our upper lips. There was no taste at first (there was a chemical taste that settled in once the 25c started to kick), but I could feel a very distinct tingling sensation in the area where the tabs rested. After a short while(15 minutes), I realized why I had previously been under the impression that tabs of LSD, 25i, 25c 'dissolve'. They don't actually dissolve, but once you've absorbed the drug, it does feel like the tabs have melted into you. I did not swallow the tabs after the 25c absorbed, and I personally do not recommend doing so. I swallowed my tabs the first time I tripped and experienced an unpleasant stomach ache. \r\n\r\nThe first thing I began to feel that was telling me the 25c was starting to kick was the cold and tingly sensation I felt in my fingers and toes. That was followed by a light tingling sensation in my spine at the base of my neck. This began about 15 minutes after placing the tabs. Soon after that I began to feel my come up. It felt as if I had butterflies in my stomach, and I was instinctively started inhaling and exhaling slowly. As I inhaled, my body felt like it was ascending, and as I exhaled I descended. \r\n\r\nJust like flipping a light switch 20 minutes after the tabs were placed, I was tripping. I looked at my hands and my fingers seemed very disproportionate to my hands. There was a pattern radiating on my hands that looked what pale skin looks like when it's cold. Then the unstoppable grin and sensitivity to humor began. My significant other started telling me funny stories, and he was making me laugh so much that it was nearly overwhelming. By this point we had smoked plenty of marijuana, and it definitely seemed to intensity our trip. \r\n\r\nLaying down on the bed, I began to stretch. I never would have thought to do this, but my significant other swore that it is the ultimate sensation whole tripping on 25c or 25i. Stretching is most definitely a pretty amazing feeling while on 25c. It was practically orgasmic, sending warm and tingly sensations radiating down my arms/legs/back as I stretched harder. \r\n\r\nI looked over at a poster of an oil painted Bob Marley, and it looked to be submerged under water, rippling down towards the floor. The white Christmas lights were in my peripheral, and the pattern of light reflecting on the walls were large bursts of light pulsating with my heart beat. I felt a very intense body high beginning at this point(even without stretching), it was pretty comparable to the body high experienced on MDMA. \r\n\r\nI realized I was peaking when my vision seemed to dramatically change. I could no longer look around me and notice individual things. As I looked around me, it was as if I was sitting in front of a panoramic photo and everything within my direct view was overwhelmingly being observed and processed. My perception of distance and proportion was very distorted. My significant other was sitting only a foot away from me, and although I could feel that he was close to me, he looked like he was across the room. I could no longer make out the bed I was sitting on, I felt like I was being pulled into a floating cloud on the floor. Every surface and object I looked at held unique radiating patterns. The walls, the lights, my skin, pillows on the bed etc. I looked to the oscillating tower cooler, and it was blowing out what I can only describe as textured air. \r\n\r\nWhile experience my peak, I felt compelled to look at the time. The screen on my phone looked like a hologram, and my phone seemed so far away. Only 40 minutes had past since we placed our tabs. At this point my body high was very intense, but my visuals were so enjoyable that it did not feel upsetting to me. My significant other layed next to me on the bed and we melted into each other as we zoned out on the ceiling. The dog in the room was very drawn to me, he began licking my arms and my face. The invasion of my personal bubble and his sudden fondness for me was causing me to burst out into a fit of uncontrollable giggles. I begged my boyfriend to make him stop in between giggles and snorts which made me laugh harder. I called him a 'tiny little stalker', and that caused my significant other to laugh hysterically. He finally calmed down enough to make him leave. \r\n\r\nAfter he snuggled next to me on the bed, the mood dramatically changed. We wrapped ourselves up in each other, and our bodies felt melted together. Our energies radiated out towards each other, and I felt this pleasantly overwhelming chemistry with my love as we lay entangled on each other. Although the body high on 25c feels similar to that of MDMA as I mentioned before, it did not make me feel 'turned on' the way MDMA does. However, from the depths of my soul I wanted to make love to my boyfriend. We were both still tripping very hard, and I had a split second where I thought I'd feel disappointed if sex wasn't something he could focus on. My very sharp and objective mind reminded me that the energy of the room was whatever I decided to create. My very conscious mind was telling me to take my desire and let the energy flow to my partner through me. \r\n\r\nWarning: there is adult content beyond this point! \r\n\r\nI began to run my hands up and down my significant other's arms and neck. He nuzzled his face into my neck, and didn't kiss me but lightly rubbed his lips and cheek up and down my neck, across my shoulder and back again. The feeling was utterly sensual all by itself, and the energy flowing to each other made me feel like we were two souls inside of one conscious mind on the neck of one body as we were sucked into time and space, watching the world around us progress through time. I closed my eyes and could see a damask pattern of Indigo and violet. We began to kiss, and it was slow as our hands grasped each other's faces. \r\n\r\nWe gave each other oral sex, and time seemed to stop as the feeling of pure ecstasy flowed through me. We very quickly progressed to the love making process, and as our bodies connected, I was so engulfed in the pleasure that my mind was unable to recognize any feeling beyond that. We moved our hips into another slowly but deeply, and the feeling of him making love to me was so intense and orgasmic on its own that my sexual pleasure didn't peak into an orgasm. After what felt like an eternal trip into a pleasurable reality, he crashed next to me on the bed. I asked, 'did that really happen?' The experience of lovemaking while tripping was so intense that I really wasn't sure if it was real or not. \r\n\r\nBy now we were an hour and a half into our trip. 25c dramatically affects your perception of time. 15 minutes feels like an hour. Maybe it was because of the unstoppable giggles, but I found the distortion of time to be extremely comical. \r\n\r\nAfter we smoked another bowl, my brain shifted it's focus to engage in activities that would help me come back to reality. We ventured outside to the patio and sat at the table. I smoked a cigarette and we talked about past experiences, while enjoying our visuals as they began to mellow out. \r\n\r\nOnce the sunlight became a little too much for us, we went back to the safety of the inside world. I was suddenly overcome with the desire to eat. My significant other suggested a Clif bar, and just as he said it would be, eating was very interesting. I wouldn't say it felt like a chore, but I could feel every unique texture and the chewing process seemed to take a long time before I felt ready to swallow. However, the taste was extra stellar. After ultimately enjoying some nourishment, I drank a cup of English breakfast tea with honey. \r\n\r\nIt had been two hours since placing our tabs, and my food and tea brought me back to reality. The come down from 25c is just as quick as the come up. It was quick and easy, and I felt very relaxed and ready to live out the rest of my day. Colors were still brighter and textures were still more noticeable for the next couple of hours, but I had a very enjoyable drive back home and mental sharpness was still very present through out the day. \r\n\r\n25c is short, but oh so sweet.\n\n\n\n\n\nExp Year: 2012ExpID: 103168\nGender: Not Specified \nAge at time of experience: 28 \nPublished: Aug 19, 2015Views: 1,148\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}