{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t 1 g\n\t\t oral\n\t\t Smarts - Oxiracetam\n\t\t (liquid)\n\t\t\n\t\t\n\t\t  \n\t\t 1200 mg\n\t\t oral\n\t\t Lecithin\n\t\t  \n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   80 kg\n         \n\t\n\n\n\n\nIntroduction:\r\n\r\nMy history of stimulant use is limited to caffeine. I liked coffee, but in the long run caffeine use diminished my overall performance (both physical and mental), so since I started using oxiracetam. I've not taken any other stimulant. I started taking oxiracetam mainly for its stimulatory effects, because it's considered safe and may also enhance cognition. I will address both effects in this overview plus some random information ('withdrawals', drug combinations et cetera) \r\n\r\nEffects as a stimulant:\r\n\r\nSince caffeine is the only other stimulant I've tried, I don't have much to compare to. I would describe oxiracetam as a mild stimulant at best. That doesn't mean it's bad though - actually the opposite. I usually take about 1 gram dissolved in water in the morning (not every day; a pretty low dose too), and depending on my day I might redose about 500mg every 6 hours. I don't feel stimulated or even 'notice' the effects, it only comes to my attention later that I've done a lot of things and I don't even feel tired. Mental clarity, as opposed to caffeine which dumbs down my mind after a long day, is the main reason I keep using oxiracetam. Other effects include reduced mental fatigue and reduced boredom while doing a repetitive task for 10+ hours. It's not a physical stimulant in my case though, and I've fallen asleep not long after dosing. That means it doesn't reduce sleepiness by a considerable amount for me.\r\n\r\nPerformance comparison between using and not using: \r\n\r\nI often do repetitive tasks (as a hobby) which require about 80% constant attention and clicking in a game. This particular task consists of a unique process which lasts around 65-70 seconds, repeated indefinitely. Sober, I usually get bored and quit after about 10-12 hours. On oxi, 15 hours without breaks (only physiological needs) is not a big problem. Long days at the uni and long lab works are also handled somewhat easier with noticeable mental clarity even at the end of the day.\r\n\r\nEffects as a cognitive enhancer:\r\n\r\nNot much to say here to be honest since I don't normally have problems with studying anyway. The mental clarity and non-decreasing attention certainly do help on 10+ hour university days, but I haven't noticed any change in my logical thinking. I also take an acetylcholine precursor (lecithin 1200mg), because without it oxiracetam makes my head ache after 10+ hours. Reason being is that acetylcholine (ACh) is an essential compound in the brain which is involved in memory etc, so for oxiracetam to be fully effective, there needs to be enough ACh. It's like having an upgraded car engine - it needs more fuel. Choline, a precursor, is contained in a variety of foods like egg, meat.\r\n\r\nOverall effects on everyday life:\r\nLately I've been taking oxiracetam 5 to 7 days a week, usually 700-900mg once in the morning, which is a fairly low dose. I feel that it improves my overall mental wellbeing. I feel more clear-headed, motivated and even more talkative. In a subtle way, of course. It seems that it enhances the positive qualities of my persona: Im more kind, patient etc.\r\n\r\nDose chart and 'withdrawal':\r\nNote that this is only my dose chart, everyone responds differently. My normal dose starts at 500mg, up to 1000mg in the morning. I feel all the positive effects and don't feel the need to redose until the next day. Doses above 1250mg are in the range where I feel like the drug interferes with my thought processes, in a similar way that caffeine does it. I feel like my mood is swinging: at one moment I feel great, the next moment I feel down. My brain feels like it's entering a slight overload and I just wish for the uncomfortable feeling to go away, which it does in about 3 hours and levels off to the nice, pleasant 1000mg 'high'. I've exceeded 2000mg only once and my brain felt like it was violated. It did feel euphoric at the start, but I was quickly overwhelmed with feelings of discomfort and mental fatigue.\r\n\r\nAs for withdrawals, I think they are subtle yet real. It usually starts on the 2nd day after cessation. I feel a little lethargic, unmotivated. I do everything that has to be done, but not more. I feel 'drained' if you will. The feeling slowly goes away and within 5-6 days it's gone.\r\n\r\nCombinations with other drugs:\r\nAs far as I'm concerned, it has little effect on other drugs. I may or may not feel a little more drunk when drinking alcohol on oxi. What got me curious, however, is the fact that someone reported piracetam enhancing LSD effects greatly. I decided to do a similar combination: oxiracetam and LSZ. It turned out to do jack. So as far as my experiences go, oxiracetam doesn't interfere with other drugs in a noticeable way.\r\n\r\nHealth effects:\r\nThe medical community's consensus is that oxiracetam has little to no effect on physical health. In my history of use, I have not noticed any signs of diminished health. I am no doctor by any stretch of imagination, but I think daily oxi use may or may not add a little stress on the kidneys. Healthy individuals have nothing to worry about, but if you have a problem with kidneys, I think it's worth checking with your doctor first. And of course, don't take my word for it! It has little addiction potential, but I have to admit that I may have developed psychological addiction to the mental clarity it gives me. The logic behind it is comparable to spicing food - it enhances the taste yet it's not harmful, so why should one refrain from doing so if one wants to do it?\r\n\r\nIn conclusion, I would say that oxiracetam is a substance worth using. It is certainly nowhere near amphetamines, but as a result it also doesn't have respective drawbacks such as addiction, adverse health effects and unpredictable effects on the mind.\n\n\n\n\n\nExp Year: 2014ExpID: 103228\nGender: Male \nAge at time of experience: 20 \nPublished: Oct 18, 2015Views: 942\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}