{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t   \n\t\t  \n\t\t Etizolam\n\t\t (daily)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   120 lb\n         \n\t\n\n\n\n\nBackground:  I have zero experience with benzo addiction and had only used Xanax when flying for legitimate anxiety.  \r\n\r\nI first began using etizolam when my grandma died and I was left alone for a week during Christmas because my roomie was out of town.  I've always had problems sleeping and found it very convenient to be able to take a pill and pass out.  Over the next few months, I discovered etizolam's recreational potential when combined with 4-fluoroamphetamine (4-FA).  It removed inhibitions and produced a drunken feeling.  Cool.  I soon began taking it in social situations, which have always been tough since I suffer from Aspergers and cannot tolerate alcohol.  \r\n\r\nThe positive effects of etizolam include reduced anxiety and feelings of tranquility.  The negative effects FAR outweighed the positive, but because it also impairs cognition, it took me a full year to connect the side effects to the drug.  Most days I would take 1-2 mg, but I occasionally fell into 3-day binges averaging 10-15 mg per day.  At these doses, etizolam produced a mania in which I would stay awake for days drawing pictures repetitively and doing other strange things.  My last binge of this nature resulted in full-on open eye hallucinations.  I saw spiders spinning webs as I sat on the toilet and watched a piece of hair transform into a ballerina twirling in circles in the shower.  I watched 'All in the Family' on a loop for 10 hours.  I could feel my psyche cracking in a way that was totally foreign to me. Is this what my bipolar grandma felt like during a manic episode? I developed a newfound respect for people with mental illness.    \r\n\r\nDuring my year of etizolam use, I also acquired a long list of life-ruining physical ailments that is too complex to discuss at length. Rapid weight gain, constipation, loss of libido, constant lower back pain and nightmarish menstrual cramps are among them. The back pain landed me in the ER, where I was diagnosed with 'ovarian cysts'.  These symptoms could've been a total coincidence, but hours of reading have lead me to believe they could be caused by benzodiazepine abuse. \r\n\r\nBy the end of my run with etizolam, interdose withdrawal was an ever-present problem.  Each dose now made the withdrawal symptoms WORSE, so I had no choice but to quit cold turkey.  Nothing could've prepared me for the hell that was to come.  I'll spare you the details and say this:  I lost it completely.  The last 7 months have been filled with unprovoked panic attacks, insomnia and the deepest depression a person can experience without killing themselves (which I tried to do a couple times). Mind you, I'm not bipolar and have never attempted suicide before. \r\n\r\nToday marks the 7 month anniversary of my benzo sobriety, and I still feel like utter shit.  My cognitive abilities are greatly impaired, my moods are all over the place and I still suffer from severe bowel problems (bloating and constipation, aka 'benzo belly').  In fact, I was diagnosed with IBS yesterday during another late-night trip to the ER for back pain.  At 30, I'm finding gray and white hairs all over my head (and other places), which began popping up during the height of my etizolam abuse.  Seems unrelated but a quick online search proves that I'm not alone.  Benzos can interfere with hormone levels including prolactin, thyroid hormones (T3 specifically), cortisol and others.            \r\n\r\nEtizolam is uniquely dangerous in that it is available without a prescription for a very low price.  People often claim that it's not as dangerous as 'true benzos' because it's a thienodiazepine.  I call bullshit.  While I've never been addicted to any other benzos, my many hours in benzo support groups have shown that my symptoms are identical to those of people quitting Xanax, Klonopin, Ativan, etc.  This experience makes opiate withdrawal feel like the sniffles.  I've withdrawn from stimulants, antidepressants, opiates and empathogens after extended use, and NONE of it compares to the hell of etizolam withdrawal.  \r\n\r\nMy goal is not to demonize etizolam or put its legal status in jeopardy, but to warn people of the risks so they can make an informed decision.  What you do with the info is up to you.\r\n\r\n[Reported Dose: '1-12 mg daily']\n\n\n\n\n\nExp Year: 2013ExpID: 103276\nGender: Female \nAge at time of experience: 28 \nPublished: Nov 14, 2015Views: 1,708\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}