{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t 2 mg\n\t\t insufflated\n\t\t 25I-NBOH\n\t\t (liquid)\n\t\t\n\t\t\n\t\t   T+ 0:00\n\t\t 4 mg\n\t\t oral\n\t\t Etizolam\n\t\t (pill / tablet)\n\t\t\n\t\t\n\t\t   T+ 4:00\n\t\t   \n\t\t oral\n\t\t Etizolam\n\t\t (pill / tablet)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   89 kg\n         \n\t\n\n\n\n\nFirst I'll start off with a little background; I'd tried 25I NBOH twice before, both on blotter form and had a wonderful experience both times, so I figured I'd go and source some 25I NBOH crystal online, the crystal arrived on Tuesday and my milligram scales should have arrived Thursday; sadly I didn't notice they were on economy shipping from Hong Kong so I'll be seeing them some time this (or next) month. \r\n\r\nI settled on buying some 0.01g scales from a local headshop; they cost more than the 25i and weren't as accurate as I'd hoped, the only thing for it was to weigh all the NBOH (which I did three times) and make a solution of all of it. That way 10mg one way or another is only +-100mcg on an actual dose. The 100mg sample I'd ordered weighed in at 120mg; the online psychedelic vendors always seem to be generous with what they give out.\r\n\r\nSo after firing the crystals into a safety-capped medicine bottle I carefully measured 12ml of vodka and added that too. A hot water bath and a little shaking had it almost dissolved, it was all done by next morning.\r\n\r\nThe next day I decided to be the lab rat for my own solution, I wouldn't give anything I made to friends without first testing it on me myself; I figured the scales may have been out 20mg and that I really had a 8mg/ml solution, in light of this I (rather stupidly) decided to dose 2mg/1.6mg nasally; I'd had 1.6mg of blotter before, 2mg of nasal NBOH isn't going to be much stronger I thought. I was very, very wrong.\r\n\r\n    T+0 - I carefully measure 0.2ml out into a 1ml syringe, tilt my head back and empty the syringe into my nasal cavity, even though I added water to the syringe to dilute it to 0.5ml the vodka still stung like hell, I've not snorted anything in ages either, probably contributing to the burn.\r\n\r\n    +05 - I start to wonder if the liquid is bunk, then I look in the mirror and see that my pupils are like saucers, I sit down and wait for me to start tripping, from what I remember of NBOH it was somewhat slow to work.\r\n\r\n    +10 - Suddenly, as if someone had flicked a light switch I start to trip harder than I've ever tripped in my life, harder than DMT (though I've never taken a massive dose of it); the walls are melting, the rug is blowing as if in the wind and the light level in the house is going up and down so rapidly it's like someone's shining a flashlight at the curtains. I stumble over to the TV and by some miracle manage to get it and the PS3 working, I assume I wanted to put on some music but seeing as I can see two playstation controllers there's no way I'm going to be able to navigate the menus. Instead I lie down on the sofa. \r\n    \r\n+15 - A wave of nausea overcomes me and I run to the kitchen to vomit, up come the 4mg etizolam that I'd taken to try and 'take the edge off', though I guess the NBOH didn't want me to take the edge off, I washed the remnants of the etiz pills down the sink. If I'd been less experienced with psychedelics, a very anxious person by nature or just less sure of my measurements and knowledge of chemistry I'd had phoned an ambulance. The thought that I might have been sold something far more potent or toxic crossed my mind more than once, though I decided that if I were really dying I wouldn't be thinking like this but rolling around on the ground covered in vomit unable to speak or think. With this reassuring thought in my mind I went back into the living room.\r\n\r\n    +25 - The trip continued to intensify and I continued to look at the shapes materialising out of nowhere; they didn't have a defined edge, rather it seemed like the edges were constantly spiraling fractals. I continued to watch the room morph and listened to the popping, buzzing, whizzing and crackling in my own head. Usually while tripping I'll wave a hand and use the tracers as a gauge to see how hard I'm tripping, when waving my hand now the tracers had tracers of ever spiraling geometric fractal shapes. I continued looking around the room in childish wonder for at least an hour, it was one of the most heart touching and beautiful hours I've ever experienced.\r\n\r\n    +1:15 - I finally figure out how to work the playstation and stick on some Aphex Twin and bring up some Alex Grey pics, everything was morphing, changing and changing some more, the walls were covered in geometric jigsaw patterns that took on a yellowish rainbow hue, I could almost swear some of it looked like writing. I'd finally discovered the definition of tripping balls, prior to this I'd taken quite a bit of acid, AL-LAD, LSZ, DMT and a bunch of 2C compounds and various other alphabetamines; this blew them out of the water. I brought in the cat to play with and as per usual the cat could sense I was tripping (weird huh) and became super playful; playing with the cat whose long hair kept morphing on a rug that continually changed was the most fun I've had in my life. Eventually the cat jumped up on my lap and looked me dead in the eye as if it were trying to tell me something; I realised something in that moment, though within seconds the realisation was gone. Rather than puzzle endlessly over my cat trying to communicate with me through telepathy and have a trip that ends in confusion and letdown I decided to feed the cat, this distraction drove the further confusion out of my mind.\r\n\r\n    +1:50 - Feeling somewhat cold, yet still tripping very hard I decided to light the fire, which is probably not a good idea, especially when you have no paper and are using a mixture of model car fuel (methanol+nitromethane) and motor oil as a thickening agent, the result being a highly flammable paste which has already almost blown me up while sober, however thanks to NBOH's clearheadedness and the fact that I seem to have a guardian angel watching over me the fire went off without a hitch. The next 45 minutes or so were spent watching the wood and coal morph, while geometric jigsaw pieces appeared in the flames. Watching a fire while tripping is amazing, though lighting one alone is highly irresponsible especially if you are tripping this hard, if anyone else wants to watch a fire while tripping I'd urge they light it while sober and keep a kettle full of water with them in the room.\r\n\r\n    +2:35 - After warming up a little and the trip seems to be lightening off a little I fire up PS move and try to play a game of sports champions; it's a great game to play while tripping, the controllers light up and make the most wonderful tracers, naturally there's the added difficulty of not knowing where the hell the basket is in disc golf because the greenery keeps morphing, nevertheless I found the game to be laugh-out-loud funny at points; for any tripper (especially social trippers) a PS3, PS move and sports champions are a must buy. After about half an hour I went back to watching Alex grey and listening to Aphex Twin.\r\n\r\n    +3:15 - I spent the next hour looking at Alex Grey in 1020P (though it seemed like 100020000P to me) and admiring the colourful jigsaw patterns that adorned the wall, I could no longer 'see the air' and the trip was still at a pretty high visual intensity, along the lines of 2 good hits of blotter acid (though acid comes with different visuals and headspace) or a middle-heavy dose of a 2C. I continued, I kept this up until the 4 hour mark, when I moved upstairs and started watching some TV on my computer.\r\n\r\n    +4ish - Sat upstairs watching TV for the next two hours, for the first hour I was still mildly (one hit of half-decent acid, medium dose of 2C), by the second I was almost at baseline; I went and cooked a meal, popped some etiz and fired up dark souls. By 6h the effects were almost gone.\r\n\r\n    For a drug which is so cheap and easily obtainable care must certainly be taken and one must only make a solution if they know what they're doing. Most vendors won't send NBOH crystal out without first being asked in a professional manner, though I'm sure uneducated kids could potentially get their hands on crystal which is worrying. This is an experience with 2mg of the stuff and though it was a wonderful experience which I definitely want to repeat I have to warn other psychonauts that this stuff is _very_ potent. If you keep it in a baggie or a container make sure you have it clearly marked saying what it is. When I received it from my vendor it was in a baggie which was inside a bigger baggie (which was marked with the chemical name) however the actual baggie containing the substance was unmarked and I shudder to think what could happen if that baggie was lost/dropped/stolen and someone consumed it thinking it was MDMA (it looks quite alot like MDMA, but with smaller crystals) so make sure your supply (if you have one) is clearly marked.\r\n\r\n    Other than my above fearmongering I think 25I NBOH is a wonderful chemical and despite having quite a bit left I'll probably buy some more to hide away before they ban it. 25I NBOH may indeed by my favourite psychedelic and I feel it's something any psychonaut should try.\n\n\n\n\n\nExp Year: 2014ExpID: 103323\nGender: Male \nAge at time of experience: 21 \nPublished: Nov 15, 2014Views: 4,259\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}