{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t   \n\t\t  \n\t\t MT-45\n\t\t \n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   175 lb\n         \n\t\n\n\n\n\nBefore we jump into the details of MT-45, a little about myself. I have been around the block a bit myself with opioids before. In my flirtations with Lady Poppy, I have tasted several natural and synthetic opioids: heroin, kratom, opium, poppy tea (oddly enough, my favorite opiate of the bunch -- nothing can quite beat a good cup of poppy tea), morphine, codeine, hydrocodone, hydromorphone. Ive experimented with several ROAs, including smoked, oral, intranasal and intrarectal (though not intravenous/intramuscular injection). Ive found that intrarectal administration is ideal, if I use a proper needleless syringe and go about it right. Theres an immediate euphoric rush which doesnt exist for other ROAs Ive tried, and it uses less material, which is always a massive boon when it comes to opioids. If you find it possible to mentally get past the taboo, it truly becomes a simple and clinical task which lasts a few minutes at most and has great benefits. In my experience, IR is the only viable means of taking MT-45, taking a boring and generally shitty drug (orally and intranasally) and turns it into a real gem.\r\n\r\nDuration: With intra-rectal ROA, the initial wave lasts 1 hour, slowly dropping off into a more relaxed opiate buzz. The precise length of experience isnt known as I redosed post initial wave of effects, lengthening the duration. Orally, takes a long time to kick in: in a gel cap, it took nearly 2 hours before I began feeling the full effects, taken on a nearly-empty stomach.\r\n\r\nOpioid Tolerance: None at time of experience.\r\n\r\nDrug:\r\nPhysical qualities: fluffy, slightly off-white (perhaps eggshell or faint cream) powder; soft and very sticky. Will coat my fingers if I handle it.\r\nTaste: Extremely bitter. Do not eat this uncapped: taste lingers in your mouth for a long time.\r\nSmell -- extranasally/wafting: faint earthiness. Essentially no smell.\r\nSmell -- intranasally: bitter smell much like taste. Insufflation not recommended. Is painful (no where on the level of a 2c-x though): insane bitter + mucous + pain = terrible drip = not a good time. Moreover, the compound doesnt appear to be particularly water soluble.\r\n\r\nAllergy Test: ~3mg is placed into sublingual cavity. Profound chemical-flavor and bitterness is noted. After few hours, it is determined that testing is safe to proceed.\r\n\r\nTest 1: Oral 1\r\nt+0 Empty stomach. No drugs or medications in body in significant amounts. Swallow 50mg in gel cap.\r\nt+15m No alerts. Grow impatient and take more (30mg at t+20m).\r\nt+45m Still nothing. Decide to take another 30mg.\r\nt+60m Begin working on other things and get distracted, forgetting I even took drug. Remain busy until t+120m when I notice significant impairment of mental faculties, sudden increase in somnolescence, warmth spreading through body.\r\nt+130m Drug picks up much faster now. Im getting quite fucked up. No significant euphoria however: comparable level of intoxication from hydrocodone would give much greater euphoria.\r\nt+??m Timeline begins to be quite shaky here. I become quite dissociated and proceed to do strange things around my apartment and walk to the nearest store: both moving physically and interacting with other people is difficult. I come back and fall asleep.\r\nNext morning - feel excellent, no hangover to speak of, no strong desire to take more; but still a touch confused as to what I was doing at certain points during the night.\r\n\r\nTest 2: Oral 2 (one week later)\r\nt+0 Empty stomach. No drugs or medications in body in significant amounts. Swallow 100mg in gel cap. Know to be patient now, plan on feeling onset at t+90m at earliest.\r\nt+2h Feeling it and feeling quite good. Less dissociation than last trial, more opiate-styled relaxation: the itchy-scratchies are there, the mellowness, but not much euphoria and certainly no nod.\r\nt+4h Want to sleep now, as I have an early morning. Assumed I could fall asleep easily on an opioid, but strangely I cant. I take 4mg melatonin + 50mg diphenhydramine to help with sleep.\r\nt+5?h Sleep.\r\nNext morning -- fitful, difficult sleep. This one wont give you the delicious beautyrest that the classics do, so look elsewhere opioid-loving insomniacs: MT-45 is probably not for you.\r\n\r\nTest 3: Intra-rectal (a few days later)\r\nGot tired of the lack of euphoria with oral ROA. Decided to try plugging, as that is the most rushy and euphoric ROA for me (as I do not use IV injections as an ROA).\r\nt-15 Prepare solution for IR administration. Dissolve ~25mg in 2mL of Propylene Glycol at 27C. Powder dissolves readily with minor stirring: clumps formed initially but were broken up via stirring/crushing-up with needless-syringe.\r\nt+0 Lie on side. Drop drawers. In it goes 2mL of MT-45 solution up the butt.\r\nt+25s Damn. Feeling alerts. Growing and creeping warmth envelops my body.\r\nt+90s Strange taste in my mouth: not immediately reminiscent of PEG or MT-45. Possibly psychosomatic; possibly vascular dissemination of the chemical resulting in the activation my tastebuds/olfactory receptors. Who knows. Was strange.\r\n\r\nt+3m Itchy scratchies, glowing euphoria, body warmth: all the good stuff. MT-45 finally delivers.\r\nt+5m Feeling real good. Mentally, the lovely opiate bliss has descended. Gonna go do shit for a while. \r\nt+35m Decide to push peak higher: redose ~20mg, same ROA (different syringe, you sick fuck!). Also decide to dose 50mg diphenhydramine for itchy-scratchies.\r\nt+50m Roll two weed/JWH-018/tobacco spliffs (half a cigarette of pot and tobacco, with approx. 10mg JWH-018 in each). Take one and get into shower for fifteen minutes.\r\nt+65m Mounting dissociation after last dose; this occurred contemporaneously with cannabinoid consumption, but was noted in greater amount in the first trial (without any addition of cannabis/synthetic cannabinoids). YMMV.\r\nt+105m Got distracted and didnt keep good notes for a while. Disco elements have almost completely faded. Just residual opiate buzz. Lovely itchy-scratchies, kept in check by the diphenhydramine.\r\nt+120m Smoke that second spliff. Life is good. Throw on a movie with the roommate.\r\nt+?? Forgot to keep up with logging the experience. Mostly sat around and felt awesome. Came down, took some Melatonin and fell asleep (much easier than last time). Woke up feeling refreshed and good.\r\n\r\nDissociation -- Headspace is definitely strange for an opioid; this one is strongly inflected with the flavor of NMDA antagonism, to the point Id almost describe this drug as being equally an opioid and a dissociative. If youre not a fan of methoxetamine/ketamine/other discos, then youre probably looking in the wrong place for your kicks.\r\n\r\nThe difficulty in moving fluidly which presented itself in the first trial was strongly reminiscent of the robo-walk or that awkward shuffling K-heads do when they get into a metaphysical fist-fight with gravity; certainly more-so than the typical apathetic sluggishness of opiates, which was absent.\r\nVisuals -- no OEVs in the disco style (color enhancement, twisting shadows, strange distance perception, third-person or God-view, blurriness, extremely vivid dream-like trance states, etc.). Faint CEVs were noted at t+70ish but this may have been due to JWH-018/cannabis consumption.\r\n\r\nMT-45 orally is a complete waste, not worth anyones time, IMHO. IR, however, it becomes a pleasant opioid most reminiscent of hydrocodone, with a bit less persistent euphoria and a side dish of vaguely MXE-like dissociation. Better legs than hydrocodone, and comparable initial wave of euphoria. \r\n\r\nGiven how promiscuous MT-45s binding profile is alleged to be, Id be willing to bet it has some action on Dopamine which is responsible for its stimulating effects. Not surprising, considering that its close cousin Diphenidine (a full disco!) has been reported to have DRI effects; not to mention that the archetypical NMDA antagonist (PCP) has very significant DRI effects.\r\n\r\nAddiction Potential -- Cheap, moreish and an opioid. Action at NMDA and likely dopamine. It has a lot of addiction potential, but you certainly wouldnt think so taking it orally. Be careful, folks.\n\n\n\n\n\nExp Year: 2014ExpID: 103454\nGender: Male \nAge at time of experience: 22 \nPublished: Nov 15, 2014Views: 9,889\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n",
  "doses": [
    "MT-45"
  ]
}