{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 20:30\n\t\t 350 seeds\n\t\t oral\n\t\t Morning Glory\n\t\t  \n\t\t\n\t\t\n\t\t   T+ 20:30\n\t\t 1 glass\n\t\t oral\n\t\t Alcohol - Beer/Wine\n\t\t (liquid)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   200 lb\n         \n\t\n\n\n\n\nI've had three experiences now with this seeds, the most recent being 2 days ago. Before experimenting with active doses of these seeds, I ate just a few to make sure I wasn't allergic. Safety first! The following is an account of my most recent, and most interesting, experience.\r\n\r\nThe day of my planned trip, I had a small meal of buttered toast and milk, with black coffee, about 10 hours prior to ingestion. Otherwise, my stomach was empty. I work evenings, and arrived home at about 9 PM. At this point, I counted out about 350 washed seeds and placed them in a pepper grinder. Though using a pepper grinder is physically taxing, and much more time consuming than a coffee grinder, I appreciate the fact that it involves some work. Theres a pastoral quality to it, a sort of memorial of simpler times, and practically, you risk less LSA destruction because theres no heat involved. I saw that some seeds couldnt find their way into the grinding mechanism, so I counted out about 20 extra seeds and tossed them in, to make up for the loss. I ground them directly into an opaque container (a travel mug), to which I would later add my solvent. I did all of this under low light, even though I believe LSA is only at risk while in solution, but I just wanted to be safe. \r\n\r\nOnce I had all my seeds ground into my travel mug, I poured an entire 12 oz. bottle of hard cider into it. This is a method that interested me, theoretically, because hard cider has all the qualities of a good MG solvent: it is acidic, contains alcohol, and is filtered. It has worked well for me in the past, so I implemented the same method this time. I also added a small amount of peppermint extract and lemon juice, to further alcoholize and acidify the solution. Ive also heard peppermint helps abate nausea, but I think using it in the form of an extract actually created more initial nausea because of all the alcohol, taken in on an empty stomach. \r\n\r\nI placed the lid on the mug, shook it a few times, released the pressure buildup, shook a few more times, released pressure, and on and on. I kept the mug in the freezer and out of light by default because the container was opaque. In all, the LSA was in solution for approximately 40 minutes, shaken for about 1 minute, every 10 minutes. When this process was complete, I used a sock as a filter, placed over the opening of the mug, to pour the liquid contents into a glass, capturing the solid seed matter in the sock. I made sure to squeeze as much liquid as possible out of the sock, and when I was satisfied with the amount, I simply threw the sock away, along with the seed matter. I drank the remaining liquid at about 10:30 PM. The following is an account of the effects, with approximate time intervals (I never seem to remember to keep exact track of time, mostly because such things seem unimportant when the full effects begin to manifest, but I will do my best).\r\n\r\nT+ 0:00 -- The solution is ingested. The cold, rather than the taste, keeps me from finishing it all in one go. Peppermint is the dominant flavor, despite the small amount I actually used. From this point, I do some mundane tasks to pass the time Take care of dishes, get a nice hot shower, find some interesting things to watch or listen to. I drink a short glass of V8 juice to get some electrolytes and vitamin C, along with a couple gel caps of garlic extract, to aid circulation.\r\n\r\nT+ 0:15  I am quickly feeling the effects of hard cider, with peppermint extract, on an empty stomach. I feel slightly intoxicated and a bit nauseous. I prepare some peppermint tea and add a teaspoon of ginger, and let it sit for a bit to cool. As nausea increases, I get a bowl in the unfortunate event that I need to spew. \r\n\r\nT+ 0:30  The nausea is fluctuating, at worst very uncomfortable, and at best only slightly off-putting. I have been sipping the tea and the taste of the ginger is very strong, and stays in my mouth for quite some time. Im not sure if it actually eases my stomach, or simply takes my mind off of it because the flavor is so potent I also took a caplet of extended-release niacin to counteract vasoconstriction. I may be starting to feel the first effects of the MG seeds, but its hard to tell where my slight alcohol intoxication ends, and my slight LSA intoxication begins.\r\n \r\nT+ 0:40  Ive been watching The Tonight Show with Fallon and texting my brother, and Im slowly beginning to realize the perceptual effects of the MG seeds. These always seem to come before the real come-up. Theres a slight shimmering quality to things, like the after-image that exists with closed eyes when you stare at a scene for a long time, only its projected over everything. Ive had this each time with MG seeds. Ive forgotten about my tea, but the nausea remains manageable if I just sit still.\r\n\r\nT+ 0:48  Timestamps from texting with my brother are helping to organize my memory of the experience. At this time I sent him a text saying Starting to feel the come up now. Feels like theres an itchy ball of laughter growing in my chest. That is really the best way I can describe it. Theres a light and warmth to it, and a happiness, but not a forced happiness like weed, and it doesnt necessarily lead to smiling or laughter (though it often will). Its much more subtle, but also feels more empathetic and pure, like youre witnessing a beautifully rare and natural moment. Its very hard to describe accurately. \r\n\r\nT+ 1:15  Visual effects are becoming more apparent, with the same shimmering and a bit of breathing or waving along flat surfaces. The last time, a small meal helped abate nausea, so I make a buttered English muffin and have a small glass of milk. The warmth and taste of the butter when I take the first bite is magical. I certainly experience more profound pleasure in this experience than I normally would. Still on the couch, watching Fallon, I notice some of the circulatory issues starting to arise. My feet in particular are cold, but it helps to move my legs, tap my feet, etc. I begin to notice that voices on the TV sound muffled, but since my hood is up, I just assume theyve been that way for a while and Im only now noticing it. Otherwise, no auditory disturbances are noted. \r\n\r\nT+ 1:30  Shortly after eating, I felt my nausea dissipate in a very interesting way. It was as if my nausea were a tightly clenched fist in my stomach, holding in all these good feelings and imposing its negativity on my gut. Then I distinctly felt a warmth in my tummy, as if the fist opened up and surrendered its good feelings, which then dissolved into my flesh. From this point on, I experienced no nausea whatsoever, and the pleasure and novelty of having it disappear in this way almost made it all worth it.\r\n\r\nT+ 1:45  I decide at this point that Im bored with the TV, and prepare to move into my bedroom. I get a glass of water and some crackers, set them down on the nightstand, and crawl into bed. Being under a comforter in my sweats is very pleasurable. For a few moments I just move myself against the materials, like Im making snow angels in my bed, and Im very content. Normally Id put on some Family Guy, but I decide first to watch a video of long-exposure video sequences of beautiful landscapes, set against a soothing piano track. This isnt particularly enlightening, but I enjoy a few extended musings on the motion and rhythm of nature, the fact that everything that lives has a sort of breath and dance to it -- even though it may take thousands or millions of years to accomplish, this is only slow to me. The sped up motion of the video accentuates the quivering of plants in the wind, and the billowing of clouds and mist, and Im happy to be a small part of it all. \r\n\r\nT+ 2:15  I search YouTube for a song I used to listen to frequently, Ocean by the John Butler Trio (though really its just John on a worn out 12-string). I first view a studio track, and Im entranced by the sound, rhythm, and structure of the music. When I close my eyes, I imagine scenes taking place that occur in harmony with the mood and tempo of the music. They are disjointed and unclear, but certainly beyond my normal imagination, and certainly affected by the music as well. This is very pleasant to me, and though I cant remember specifically what was imagined, it was certainly interesting enough to keep me locked in for quite some time. I also listen to a few live recordings of the song, and I notice a maturity in style and delivery in Johns later shows, in comparison to an earlier recording. I also distinctly remember one concert, set against the backdrop of a large rock formation, which John described as a launch pad of good vibes to the rest of the world. I remember thinking at the time that his comparison was very astute, and I appreciated and clearly felt his positive attitude. I also found myself more attuned to his lyrics, and able to empathize with his emotional state. \r\n\r\nThe vasoconstrictive effects of the seeds were also at full bore by now, particularly around my knees and the under-/inner-parts of my lower thighs. The feeling was foreign to me before now, and I can only describe it as a tingling, burning sensation, what I imagine moderate neuropathic pain might be like. It wasnt really painful, though  just enough to be annoying, but I could ignore it if I wished, and I found it improved if I repositioned myself frequently, or got up to move around. It didnt occur to me to take anything for it, such as a NSAID or another niacin cap, I assume because in my mind it was a normal side effect of the seeds, not anything that shouldnt be happening. Next time, Ill try to prepare a remedy in advance, in case I feel the need to combat these symptoms. \r\n\r\nT+ 3:00  At this point, give or take some time, Im totally locked into Family Guy. I find it comforting and entertaining. There are few visual effects at play with the show itself  perhaps a bit of growing and shrinking motion of the characters themselves. Ive been to the bathroom a couple of times, and by now my pupils are dilated quite a bit. I dont find urination very difficult at all, and motor skills are only slightly impaired. In fact, I wouldnt even call them impaired. Its as if the sensation of movement itself is a bit off base, so I take smaller steps than normal, sort of shuffling about, rather than my usual gait. Im not at all uncomfortable with moving about, or making myself a drink or some food, which I crave at this point. The past couple of times Ive taken these seeds, I do feel something akin to the munchies after a few hours. Im not sure if this is due to the fact that I take them on an empty stomach, and only at this point does hunger return to me, or they actually awaken a pleasure in eating itself. I tend to think its a bit of both. In any event, after some time, Im back in bed with some food and water and thoroughly enjoying both, as well as Peter Griffin and his high-jinks.  \r\n\r\nT+ 4:00  Though Im not certain of the chronology of my trip at this point, I include this last time stamp simply as a general agreement with many reports that the peak of most of the effects, specifically perceptual changes, seems to come here. I would find, watching Family Guy, that a number of interesting visual effects would take place mostly in the background and surroundings of the focus of my vision. The general color scheme of my surroundings would mimic that of the television, specifically if there was a preponderance of a particular range of the spectrum. For instance, one scene of Family Guy focused on a sunset, and my surroundings consequently took on shades of red and orange. I also found that the shimmery after-image effect Id experienced since the onset of the trip took on more intensity and body, forming lines, bars, and other simple shapes, but still nothing very defined or captivating. I also have, in my room, a light fixture made up of exposed bulbs that spell LOVE, and if Id look at this, then close my eyes, the word LOVE would persist in my minds eye and do interesting things, such as wave about, fly around, wiggle, and the like. Shadows also seemed to stretch and curl, and the light cast on my window by a nearby street lamp would strike me differently than usual  not that the light and shadows would actually become anything, but that my imagination would pick up on patterns in a more inventive and creative way, such that Id perceive shapes, faces, or designs where it would normally all seem flat. \r\n\r\nSome time later, I estimate between 3:00 and 3:30 (or T+ 4:30-5:00), I fell asleep with Family Guy still on. I did leave it on intentionally, as the thought of trying to fall asleep in silence wasnt very appealing to me. For the whole trip, in fact, I craved stimulus, either in the form of music or television (though Ive heard it recommended to sit in silence and darkness, in order to let the mind do its own stimulating I suppose Im not brave enough for that yet). I remember having a dream that night that I was fishing with some friends, and one of us caught a rodent-like creature, and it climbed up my body and bit my neck (unpleasant to say the least). I also remember the following night, I had a dream that I dropped acid and had one of the most amazing experiences of my life, replete with euphoria and mesmerizing visuals. Both of these dreams were rather vivid, and because I dont remember my dreams often, I attribute this increased brain activity to the residual effects of the MG seeds.\r\n \r\nI woke up the next day (or the same day, technically) at about 11:30 AM, or T+ 13:00, and felt slightly off baseline, but relatively sober. Physically, my knees and lower back were sore, and continued to be until the following day, with a bit of shakiness that subsided after being awake for a couple of hours. Mentally, I only felt slightly hazy, noting that my concentration would wander slightly, though I had no problem carrying on about my day or remembering the events of the previous night. I did experience a bit of afterglow in the form of heightened awareness, I suppose you could call it, as I could detect some residual shards of that altered plane of consciousness impacting my thought and speech. This left before the next day. \r\n\r\nIm not very experienced with these sorts of substances, but if I had to characterize this trip according to the Shulgin scale, I would call it a strong ++/moderate +++. If I stayed in bed and let my mind wander, all effects became much more apparent. If I got up to walk around, however, I could easily focus on simple tasks without any real issue. It would appear the effects of MG seeds differ greatly from person to person, and also depending on the method of consumption. But in my experience (which, again, is limited) Morning Glory seeds are a very mental and physical substance, with any perceptual changes, while certainly present, taking a back seat. The body load is uncomfortable at times, but manageable, and the empathetic quality is very interesting and unique. I never felt paranoid, threatened, or at risk of losing control at any time, but I imagine this might come at higher doses. I cannot deny, however, that these seeds do inhibit concentration quite a bit. I typically browse the web and watch TV at the same time, keeping track of whats happening on both fronts, but while under the influence of these seeds, if I pulled my concentration away from the TV and onto my computer, or to the motion of the walls, I would look back to find I had no basis for the current situation or conversation. I might be able to resurrect the train of sensory input, at great difficulty, but just as often, this was an insurmountable feat. \r\n\r\nAs I said, the Morning Glory seed experience will be different for everyone, so if you were to ask me if I recommend trying them, I couldnt really give an honest answer. If your experience were guaranteed to be like mine, I would say knock yourself out. Ive read plenty of reports, however, that tell of terrible nausea and worst-feeling-of-my-life puking. Ive read just as many that contain no nausea whatsoever, and weave tales of wonderfully reflective psychedelic experiences. My journey falls somewhere in the middle, as I imagine a majority would. If you decide you want to try these seeds, as with any substance, do your homework. Make sure youre prepared, mentally and physically, and Im sure youll learn something about yourself. Its a wonderful life!\n\n\n\n\n\nExp Year: 2014ExpID: 103654\nGender: Male \nAge at time of experience: 24 \nPublished: May 8, 2015Views: 2,518\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}