{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t 5 capsls\n\t\t oral\n\t\t Ibogaine\n\t\t (powder / crystals)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   194 lb\n         \n\t\n\n\n\n\nBjorn's Ibogaine Testimonial\r\n\r\nI first came across ibogaine while browsing absentmindedly through online documentaries sometime around mid-2012.  What struck me about it at first was its supposed ability to break the strongest chemical addictions (heroin, cocaine, etc.) in a single treatment.  I was intrigued by how a molecule from the root bark of some central African tree could carry this amazing medical intelligence.  My increasing curiosity led me to learn later that, along with its seeming ability to reset neuro-receptors and realign chemical imbalances in the brain, ibogaine has powerful psychotherapuedical benefits.  In what might be considered the spiritual dimension of ibogaine, the substance has the psychoactive ability to transcend the ego, and carry a person deep into the unconscious, face to face with long-buried memories, and to the root of phobias, obsessions, and complexes, while in a state of fully lucid awareness.  And all the while, in the mysteriously tangible presence of a sort of benevolent guide, described as the Iboga spirit.\r\n\r\nOver the years I felt I had accumulated an enormous mass of negative energy within me. I had become short-tempered, tense, angry, distracted, and demotivated.  I had drifted beyond a state of healthy cynicism.  I felt an overall sense of melancholy and indifference, and I was mildly self-destructive.  I suffered from a disorienting kind of forgetful delirium, whereby my long-term memories appeared like fleeting, disembodied blurs totally disjoined from any continuity in my chronological reality.  I was detached from myself and lacked a sense of direction and purpose. And compounding this was the fact that I had also been drinking too much for many consecutive years, amounting to almost two decades.  My better, essential, stronger, familiar self, like a mother signaling to a lost kitten, wanted me back.\r\n\r\nI knew I needed some form of psychotherapy.  Yet, having no specific psychological disorders or addictions, I was also no candidate for conventional psychiatric treatment, nor would I have been remotely interested in it.  My problem was more entire, eluding the medical gaze, ever out-flanking any possible diagnostic clasp.  I just felt I had to embark on an intensive excavation of my inner psyche and put the pieces back together again, on my own unique terms.  Ibogaine began to unravel itself to me as exactly the thing that could do this.  I was also curious if ibogaine could treat my alcohol abuse as well as what medical effect it might have on my mild psoriasis condition.  Somewhere along the line I accepted that ibogaine was for me.  And once I did that, the Iboga spirit would not let me go until we met.\r\n\r\nIn late 2012, I finished a UN contract in Africa and returned to my adopted place of residence, Malaysia.  Having learned from the internet that ibogaine treatment was available in neighboring Thailand, I resolved to undergo the treatment at the [name] Center.  I had a load of obligations to take care of after arriving back in Kuala Lumpur which took almost two months to complete, but everything I was doing was just a matter of pushing it all out of the way, so that I could meet with Iboga.  And, truly nothing could get in my way; no anxieties I felt about ibogaine as a powerful, psychedelic hallucinogen, no amount of skeptical ridicule or dissuasion by people I mentioned it to, no lucrative new UN contract offers, no beautiful women - Nothing.  It felt as if an irreversible magnetic pull-force was drawing me towards it.\r\n\r\nI contacted the staff at the Center by phone and made arrangements for an appointment.  They were very flexible and provided me with a convenient range of accommodation and payment options.  After completing the requested pre-treatment medical checkups I set off to Thailand on a no-frills airline.  A few days later, on Sunday morning, February 24, 2013 I arrived by ferry packed with full-moon trippers on the island of Ko Pangnan, where I was met with a paper name-board at the bustling pier by a friendly, shaggy-haired, Austrian temporary-staff helper of the Center who had himself recently undergone ibogaine for heroin addiction.  We promptly mounted his motorcycle and after a 45 minute drive through the verdant interior of the island we arrived at the Ibogaine Center.\r\n\r\nAt first glance, I was slightly bemused to find that, rather than the sort of sanitized, concrete clinic with pre-occupied nurses and formal reception counter that I had vaguely imagined, I was instead greeted by a cluster of rather charming, rugged, wooden bungalows on a hill-side overlooking a turquoise-blue ocean cove.  I was taken in to the main house where I met the head staff person, a smiley, slim, tattoo-d American approaching 40, wearing raggedy shorts and a T-shirt.  I sat down on his couch under a giant Buddha painting and almost immediately felt completely at home.  The place was entirely unpretentious and seemed serenely focused on its vocational ethos of alternative healing, which was not limited to ibogaine treatment.  I spent the day having casual discussions with the staff, a truly interesting bunch (and learned for example that [name], in his early 20s, had spent a couple of years in the U.S. Army with top-level security clearance working on nuclear war-heads at a base in upstate New York).  They explained that they like to have at least a day prior to treatment to get to know the patient as ibogaine is a very personalized calling.  The staff at the Center, a small array of western internationals, deeply impressed me with their immense and detailed knowledge and experiences of alternative medicine, psychopharmacology, ethno-botany, colloidal alchemy and their keen global political awareness of the context in which such work is performed.  They were able to identify a wide array of trees and plants in the surrounding tropical vegetation and explain their medicinal properties.  And they had a truly endearing sense of humor and humility, and were some of the most considerate, compassionate people I have ever met in my long and interesting life.  \r\n\r\nIt dawned on me a few hours in that this Center is not a business venture in any sense.  It is not even a non-profit organization.  It is simply a place, a place where committed alternative therapists practice their trade to help those who require healing not available in, and aggressively marginalized by, the hegemony of the pharmaceudical, psychotropic mainstream.  And the fees incurred are not intended for profit, but merely to cover the costs of continuing the work.  This only happens where people genuinely believe in what they are doing, which I cant say for myself since the longest time.  I saw in them an affinity with monks and humanitarians.  They were new-age shamans filling a critical gap in a world sick with consumerism and relentless positivism.\r\n\r\nWhat moved me, above all, was the remarkable professionalism of the staff at the Center. I reflected on why it should seem so incongruous that a group of tattoo-d, flip-flop wearing, individuals, who address patients as bro and use California surf vocabulary like sweet and awesome, could embody this quality so superbly.  We are conditioned to hierarchies, uniforms, titles and disclaimers exhibiting this, but what I saw at the Center easily outmodes any purported professionalism I have ever witnessed working inside the rather specious, sinister, political simulations of the supposedly legit-supreme United Nations.\r\n\r\nMy medical tests were reviewed and cleared.  And I was permitted to eat only fruit and drink water the day before the treatment. I had many questions about what I should do when under the treatment of ibogaine and was assured that you dont do ibogaine, ibogaine does you.  The idea was to relax and let it work its way through me, as it knows what needs to be done.  To the inevitable question of, Will I still be myself after this? The response was, Of course, the only difference is that you will be a better you.  Understandably nervous the night before, I was given some melatonin caps which helped me get the much needed sleep before the 30-odd hour psychedelic trip I was about to embark on.  I was shown my bungalow overlooking the hilly, green valley and left to retire for the night.\r\n\r\nThe next morning, I showered and put on some comfortable, loose clothes.  A staff member came up to the bungalow and said cheerfully, good morning. You ready?  I had been ready for months. Time to go for it.  I was given a test dose to ensure I was not allergic to it (which has never yet been shown to occur in anyone), and I laid down on my back.  About forty minutes later I was administered the full remainder of the dose, which was a few capsules, about 20 mg divided [Erowid Note: This may or may not be an error, as ibogaine dosing tends to be higher, see Ibogaine Basics], as we discussed and agreed on the previous day for targeting my mainly spiritual needs, into 80% TA (the more spiritually active strain of ibogaine) and 20% HCL (the strain more physiologically active given to addicts).  I was connected to the pulse-reading device with which my vital signs would be monitored by staff working in six hour shifts throughout the two day period.  And then I was advised to close my eyes. It was Monday, just past 9 a.m.\r\n\r\nThe effect came on slowly.  A soft vibration of warmth entered me through my toes and steadily crept up the full extent of my body, gradually intensifying in wave frequency.  Like zillions of infinitesimal micro-dogs, tails wagging, inquisitively sniffing out their new environment, my body was soon filled with playful scrutiny.  I felt increasingly possessed by a stream of excited energy that had a kind of festive yet unmistakably disciplined character about it. It coursed throughout me with seemingly incredible efficiency, as if rapidly probing out any inkling of damage in each and every one of my cells, and meticulously taking down notes on my bio-status and on precisely what components of me had ever so slightly veered from their original, primordial, molecular blueprints.  I was being scanned by ibogaine.  It came with a low buzzing sensation which I could clearly hear in my minds ear, and which would last the entirety of the trip.\r\n\r\nThen, suddenly, began the visual phase. It started off in front of an old Hessen-style German stone archway adorned with the kind of flowers seen on rural German window sills.  And casually leaning against the side of the arch, with folded arms, was a slender, relaxed, middle-aged, male figure with a full head of reddish hair and beard, in old-school country garb, who cast me a glance of encouragement with a reassuring smile that said, youll be ok. Go on and have a good trip.  I immediately registered that this introductory figure represented my guardian angel (and Ill never forget him).\r\n\r\nThe next thing I knew I was securely seated on a bee-like, aeronautical, transporter flying me around my deep unconscious domain.  This flying insect was stern and unmistakably male, the gender in which the so-called spirit of Iboga characteristically appears to people, and he would be taking me on a tour of myself.  I was carried around to visit scenes of people and experiences that had profound impacts on my life.  Negative images, after being left for me to view for painfully long periods, would be briskly chiseled away and shattered by my insect guides power-drill like nozzle, as if to rid me of them. My apoideal guide would go on and on swiftly navigating this strange spherical unconscious realm with me helplessly strapped to his back.  At times we swooped and swerved so fast it felt like a kaleidoscopic rodeo or rollercoaster.  My guide spent a large part of the time emphasizing my mother and hammering home the point that I have selfishly lost my appreciation of her and have been neglecting my relationship with her.  He vividly showed me what a beautiful, loving person she has been to me my entire life.  With intensely realist imagery cosmically tying together globe, womb, and mother, he showed me how my mother is my connection to mother-earth and that my path to happiness in this world must pass through that full recognition.\r\n\r\nI can report that the unconscious mind is a truly frightful and ugly domain, being the dumping ground of everything repulsive we suppress in our usual reality.  It is like a sewer into which we flush all the casual terror of our lives and all that which is not actively useful in waking reality, making it a place both horrible and mind-numbingly monotonous.  And my Iboga guide plunged me into graphic visions of what that means.  I was introduced to slimy, squirming, gnome-like creatures and encouraged to speak with them. I would manage lame, unrehearsed questions like, shit..what is it like to be down here? and got mostly chiding responses from them like, what does it look like? Or, fuck off, you tourist!  A few slimy slugs, or steely sharp-edged industrial beings, spoke to me at length with a forceful tone that always smacked of a kind of karmic resentment.  Still other amorphous creatures seemed excited and happy to see me and saddened to see me move on (and Iboga did not leave me much contact with those, as we had work to do).  I saw disease, mass slaughter, beheadings, brutal beatings, etc., etc., yet none of it terrified me in the least, but rather solemnly made me realize, as if for the first time ever, how much violence there is in our reality and how self-evidently evil it is, never justifiable in terms of nature, and that not the slightest bit of morality is ever required to comprehend it.  At one point I was awash in a flowing gush of diarrhea and wading through decomposing vermin before Iboga mercifully pulled me out, with a smirk.\r\n\r\nAt steady intervals throughout the trip, I felt the welcome visit of the pulse monitoring device I was attached to gently pump up tightly around my left arm and then pleasantly deflate, reminding me of the presence of the monitoring staff member on duty at my bedside and, with that, my reassuring anchor in consensual reality.  Now and then I would be lightly tapped on the arm and offered water whereupon I would lift off my eye band and feebly lean over to take a few gulps before collapsing again onto my back and being fully re-engulfed by Iboga.\r\n\r\nAs the odyssey continued, I eventually gained enough confidence in what was going on to request Iboga if we could perhaps stop at places of my own choosing and spend some time there.  My insect pilot, as if empathetic to the brutal ordeal I was going through, motioned tacit agreement, knowing that where I wanted to stop was also part of where I needed to stop. My guide never communicated in words, but only with expressions somehow clearly discernible from his beady little insect visage (which is hard for me to re-imagine in retrospect).   So being allowed to lay anchor for a while in childhood, I was immersed in the most beautiful dreamscape, my sister and I playing with my mother next to us, surrounded by soft, evanescent, diamond-shaped tufts of light, blue, red, and yellow.  I was drifting along in childhood bliss until the bee flicked its head gesturing, alright enough, lets go.  I then requested to visit my sister, who I hadnt seen in five years, and her young family to see how they were doing.  I saw her playing happily with her kids in some kind of urban park.  Seeing her with her children so closely resembled my mom with us as kids.  Other places I was granted a visit were less remarkable and the Iboga bee would wait patiently for a while before beckoning me to move on with a kind of roll of the eyes implying , damn when are you gonna realize this spot is a waste of time?\r\n\r\nI felt willfully entrusted to my little bee guide, and we even developed a faintly chummy rapport deeper into the journey, exchanging knowing glances about how weird some things appeared or how ridiculous, even comedic, some things were. Iboga really seems to have a sense of humor, irony, and unexpected charm.  We could go anywhere and confront anything in me.  I was fully protected with him.\r\n\r\nOne of the last things I insisted to know from my guide, as I sensed our sojourn must be nearing its temporal conclusion, was how my love life would unfold.  He accommodatingly took me on a swift, high-speed upward cruise of a spiral resembling a DNA helix on the top of which rested a beret-shaped sort of hat that seemed to represent the end of my life. At first I wondered if this lone, single beret worn at the end of my life meant I was destined to die alone, and felt momentarily disheartened.  But the appearance of this image also came with an alerting ting-like sound, and ambivalently also looked like a flower.  I realized Iboga was leaving this gapingly open to me, adding that ting to impart a sense of immanence, a call for resolve.  I understood that if I am to find my femme de vie I needed to revise my intentions towards women.  And they (she) will take care of the rest.\r\n\r\nThese have been just a few of the more noteworthy excerpts.  My bee ride discreetly vanished somewhere towards the end of the trip and seemed to drop me off near myself, as if to let me take the last few steps back into the world of my membership.  It was a strange and relieving sensation the moment I finally felt the ibogaine leave me, like a steady electric charge had suddenly switched off.  It was just gone, and there I was lying on my back.  I lifted off the eye mask and immediately the staff person on duty leaned in towards me, unhooked the monitor, and said softly, Hey, how you doin bro?  I asked, How long have I been gone?  He said, Well its Tuesday afternoon. So.. Over 30 hours.\r\n\r\nI was thoroughly exhausted.  I have never felt such a sense of depletion in my entire life.  This was the effect of a lifetime detox I had just gone through.  Later that afternoon I gathered the strength, with the support of a staff person, to wobble to the toilet for a piss. That night, I barely slept. I just lay overwhelmed, and I cried like I have not done since I was a young child.  My back ached from lying on it for over 40 hours.  The next day around noon on Wednesday I slowly emerged onto the veranda of the bungalow.  Staff was always ready to keep me company up there if I wanted it.  That afternoon I was brought a fruit shake which was possibly the most delicious thing I have ever had.  And that night I slept very deeply.  For most of the day on Thursday I sat on the balcony of the bungalow reflecting and integrating and sucked down another three succulent fruit shakes.  I had great conversations with some of the other patients and staff on that day.  I slept well again that night.  On Friday I finally found the strength to take a shower and descend the stairs of my bungalow.  I walked around the premises and looked out over the beautiful ocean cove.  I requested my first real meal in four days, white rice with steamed garlic morning glory. I also went down to sit and chat with the staff and patients in the main house.  I was regaining my strength.  On Saturday morning I finally felt ready to leave the Center.  \r\n\r\nIt was difficult, like leaving a nest.  We took some photos and I was given a warm farewell by the group at the Center, and then I made my way back to the ferry terminal where I boarded a boatload of backpacking party people, a herd of interchangeable automatons subjugated to the consumer fantasy of authentic travel experience.  A sultry Thai female voice over the loud-speaker managing the stumbling Lonely Planet hordes, condescendingly repeated softly, with an accent, Pleass put yu luggage at de flon of de catamalaaaan..  I felt defiantly alone as her supple command carried certain significance for me after what I had just gone through, and conveyed through metaphor, that communicative form so desperately devised to keep truce with reality, the reality I had now re-entered. And, I sailed off back towards the mainland.\r\n\r\nI consider the people of the Center new friends of mine and will forever love them for the almost unconditional kindness and care they showed me during my stay with them on the hill, as they call it.  I have gained an immense respect for contemporary shamanism and have recognized the undeniable importance of alternative healing.  Most of all, I thank them for having made the task of me helping myself as comfortable as possible.  I showed up in a low-cost airliner. Iboga came over from Africa in a tree bark powder.  And the Center was the event organizer of our spectacular, sacramental meeting.\r\n\r\nNow, two months later, I feel much more lucid about what matters to me in life and feel less anxious about how each day, and all days, will turn out. I feel focused, relaxed and positive in a way I can hardly remember feeling before.  I feel somehow existentially re-admitted to a world in which I have to and want to belong.  My alcohol consumption has dropped off significantly and even my psoriasis seems uninterested in afflicting me so far.  And I have started meeting some amazing women.  But the integration of this experience will go on for a long time to come.  Ibogaine is without a doubt one of the most powerful and effective medicines on earth, and I find it criminally insane that it could be illegal anywhere on the planet.\r\n\r\nI feel blessed that Iboga called on me.  And I hope I never have to meet him again.  But if I do, next time, it will be me calling him.\n\n\n\n\n\nExp Year: 2013ExpID: 103981\nGender: Male \nAge at time of experience: 39 \nPublished: Jan 26, 2015Views: 4,174\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}