{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t 53 mg\n\t\t oral\n\t\t Allylescaline\n\t\t (capsule)\n\t\t\n\t\t\n\t\t   T+ 0:00\n\t\t   repeated\n\t\t  \n\t\t Alcohol - Beer/Wine\n\t\t  \n\t\t\n\t\t\n\t\t   T+ 3:21\n\t\t 10 mg\n\t\t oral\n\t\t 5-MeO-MIPT\n\t\t  \n\t\t\n\t\t\n\t\t   T+ 0:00\n\t\t   repeated\n\t\t  \n\t\t Cannabis\n\t\t  \n\t\t\n\t\t\n\t\t   T+ 0:00\n\t\t   \n\t\t oral\n\t\t Noopept \n\t\t (daily)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   200 lb\n         \n\t\n\n\n\n\nBASS SLINGER\r\n\r\nDOSES:\r\n\tT+00:00 Allylescaline 53 mg oral\r\n\tT+03:31 5-MeO-MiPT 10 mg oral\r\n\t(repeated in moderation) Cannabis smoked/vaped\r\n\t(repeated in moderation) Beer\r\n\r\nWHO I AM\r\n\r\nA 42-year male with quite a few experiences under my belt, I am familiar with several well-known psychedelics and a few less widespread ones. I am a bit of a hardhead with all the phenethylamines that I tried (and I tried many), and with most tryptamines. I use no prescription drugs on a regular basis, with the exception of a nootropic (20-30 mg Noopept daily). I avoid even OTC meds like aspirin unless I have real need.\r\n\r\n\r\nSET AND SETTING\r\n\r\nI like to have a fellow psychonaut when I set out on a trip. It feels good to share and to discuss the experience - both during the action and later on - with someone who is/was part of it. However, in this particular occasion, I was the only one to assume the chemicals, and I didn't tell anyone.\r\n\r\nI'm with a band. It's full summer. We have a concert in a mid-sized town by the sea, quite far from home. We have a deal with the agency organizing the concert: they will pay us half as much as usual, but we have free transportation: a 50-seat tourist coach is at our disposal and will take us there and back. We're welcome to invite friends and fans. They will have free entry. This means none of us will have to do any driving ;-)\r\n\r\nCHOICE OF SUBSTANCE AND DOSAGE\r\n\r\nI have to play, so my choice goes to substances that don't impair cognition/bodily coordination and that I can handle well. I've already played in public on LSD (up to 300 ug) and mescaline (up to 500 mg) to name the most memorable, but I want to try with something new. This time, allylescaline is my choice because I've experienced its fairly long but forgiving effects. I have no tolerance going - the last time I used a psychedelic has been 2 weeks ago, and it was a low dose (around 10 mg) of 2C-D. I've explored allylescaline at up to 40 mg already. The effects never went beyond the low side of a ++, so I'd like to tackle something a bit higher but still safe - say, around 50 mg. \r\n\r\nOne Erowid report that rings true and convincing to me ( http://www.erowid.org/experiences/exp.php?ID=101484 ) suggests that allylescaline 'would prove very beneficial in combination with a number of tryptamines.' I've never tried such a combination before, and I do like to make every experience new in some way, so I bring some 5-MeO-MiPT with me just in case. I choose this particular tryptamine because I've experimented with it a few times already, although not in combination, and I know that it allows my rational mind to function more or less normally at least up to 20 mg.\r\n\r\nTHE TRIP\r\n\r\n12:00 T-04:38 The happy bus leaves. There's the band (7 people including myself), plus a couple of spouses and a bunch of friends - just under 20 people in total. I invited two girls I like: Elsa and Mary.\r\n\r\n~13:00 T-03:38 After about an hour, I reckon it's time to dose. Alas, a quick search of my baggage reveals no goodies. I start calling myself names inside my head. I must have been too sleepy when packing yesterday night. Well allright, it will be fun anyway.\r\n\r\n~13:30 T-03:08 Lunch time. Many of us eat their sandwiches. I'm not hungry. I'm still pissed off that I left the magic stuff at home. However, I brought some grapefruits - it's good for me when tripping - and I eat one. Albert, the percussion player, prepares a joint.\r\n\r\n~14:00 T-02:38 We stop for a quick coffee break on the road. Albert lights the joint. I have one toke. At last, I eat my sandwich and have a beer with it.\r\n\r\n~15:30 T-01:08 I felt very little from that single toke - or from the beer, for that matter. I never smoke before playing, but the soundcheck isn't due before 18:30, so there's ample time. I take out my portable vaporizer, load it and share it, then I reload it for those left out from the first round. Everyone in the band has at least a couple of good hits, except for me (one small symbolic toke) and the mandolin player, who doesn't use cannabis at all. Elsa also enjoys her share.\r\n\r\n16:38 T+00:00 We're going to arrive soon. First thing, we'll throw ourselves into the sea. I rummage through my bag looking for beach clothes and - ta-dah! - the magic stuff is actually there! Doubly stupid me, I smile and think. I quickly ingest a 39 mg and a 14 mg capsule of allylescaline, washing them down with grapefruit juice. That makes 53 mg as planned.\r\n\r\n~17:20 T+00:42 Everyone is in the sea by now. I'm playing ball in waist-deep water in a circle of 4-5 people. I still don't feel anything coming up, but I'm concentrated on throwing the ball. The fresh water on my skin is tingling, unusually pleasant. Throwing the ball is fun. And what a beautiful thing friendship is! Hm, maybe it IS coming up after all. Not only is allylescaline generally mild and gentle to me, its comeup is subtle too. Stealthy, almost. Is this placebo effect and simple happiness, or am I already at +? No OEV. I don't check for CEV, although in retrospect I think there would have been some.\r\n\r\n17:36 T+00:58 Sitting on the beach, having a chat with my bandmates. This is not placebo. I write down trip notes in my phone. I'm between + and ++. There's little introspection. I feel a definite entactogenic effect, and some mild euphory. Everything just feels right. The stage has been erected in a beach soccer field annexed to the beach and the bar, so there are stadium-like seats, although on a smaller scale. Nice indeed.\r\n\r\n17:50 T+01:12 At the beach bar, having a beer. A passage of clouds. Lightning at sea. Repeated thunder. The crew hasn't done setting up the PA system yet. Anything already on the stage gets covered with tarps. Will the concert be canceled? Wait and see. Albert has one more joint ready, but I don't take part. The lightning is a thing of beauty. It is not scary. Inside me, I know we will play as planned tonight. Mary is beside me, sipping a long drink. Still in her swimsuit. Terrific body, I can't help thinking. Slender with generously sized breasts and comparatively narrow hips. Colors are enhanced in a slight, natural way. The effect is subtle but definite. I think this is a ++. Plateau already?\r\n\r\n18:14 T+01:36 Back on the beach. I'm getting a little introspective, but without the depth or power of LSD or mescaline: just peaceful, objective, detached reflection. I think I want to switch to a polyamourous lifestyle, because I found that the 'normal' couple format doesn't suit me well. That's why I invited two girls, rather than just one. They don't know each other yet, but they're getting along well. The two of them go together for a walk in the old part of town. I think at least Mary has figured out I'm attracted to her, but I'm not pushing things in any way. I believe Elsa could be a good psychonaut partner, while Mary is probably not interested in this kind of things. I'm thinking about a relationship with both of them. Could it work? Would it be sustainable? While daydreaming, I close my eyes and the visuals are there, waiting for me. I almost forgot I am tripping, strange as it may sound. The visuals are fairly static and in soft colors, but pleasant enough that I can keep my eyes closed for minutes while watching the inner slide show.\r\n\r\n19:01 T+02:23 The crew has uncovered the gear onstage. We will play after all, but the soundcheck's going to be late. I don't worry a bit. Time for another beer. I manage to enjoy the lousy, anonymous, soulless music the bar is playing. Hm, yes, music appreciation is enhanced. I want to play. I begin tapping the table.\r\n\r\n19:58 T+03:20 The first sounds come out of the PA system. The trip is still at its weak ++ plateau, and from experience I suspect that's going to be the full swing of it. It doesn't feel much different from a 40 mg dose - or from a 20 mg dose, either. I guess that increasing the dosage (at least within reasonable limits, but still beyond the quantities I've probed) mostly changes the duration - not so much the intensity. I am confident I've reached the peak, and I suspect it's going to be fairly long.\r\n\r\n19:59 T+03:21 I want to take things up a notch. In the toilette, I swallow 10 mg of 5-MeO-MiPT. Could have done 20 mg, but let's play it safe.\r\n\r\n20:05 T+03:27 Soundcheck time. We've got to be quick, there's another band opening the stage and they also have to check sounds, so we rush it a little. However, the sound onstage is great. Music comes out from me easily, effortlessly and neatly. I'm playing the bass, which isn't my first instrument. The music is easy enough that I can manage quite effectively, but generally speaking my fingers (especially the left hand) aren't as skilled as I would like - so whenever a performance comes out easily, I am delighted, as if surprised that it really turned out right. Paraphrasing Stephen King's gunslinger character, a concept materializes - 'You don't play with your fingers; you play with your mind.' Those books stuck with me. I feel like a bass slinger. I'm disappointed when we have to get off the stage. I'd rather stay here and keep playing, making this beautiful sound. It is much too early for the 5-MeO-MiPT to have had any effect, so if anything, it's only the allylescaline that makes me so eager and enthusiastic.\r\n\r\n~20:20 T+03:42 The other band are having their soundcheck. It takes longer than ours did, although they're just a quartet (we are 7). The guys are good. They play a dubby piece with a wailing harmonica. The sound on the audience side is clean and not too loud. Hm, great. I like this. They stop it and begin to play another tune with more vocals and lyrics on the verge of pretentiousness. I don't like the singing much, and the band, too, seems less at ease and a bit out of focus with this kind of material. I feel reassured: apparently, I am not entirely uncritical yet. Elsa and Mary come back from their walk. They are friends by now. I feel proud that it happened because of me - and in just a few hours' time.\r\n\r\n20:52 T+04:14 All sound checking is done. I talk to the other band's singer and bass player - really nice guys. Like us, they came a long way too, but from the opposite side, so we definitely live far apart. I feel reciprocal instant liking. The bass player talks about valve amps and how it's a whole different thing, you know, yak yak yak. Just for the sake of argumentation, I say yeah, but the amp is ultimately just a tool, direct-injected bass can be fine too, you know, yak yak yak. I tell him my thought about playing with your mind, not with your fingers. We have a beer. The singer outlines the idea of an ambitious artistic collaboration between our bands. I'm afraid he's planning some theatrical blabber backed by anonymous, bland, unobtrusive music, so I diplomatically suggest we could at first just exchange gigs: they find a gig for us in their area, we do the same for them in our city.\r\n\r\n~21:03 T+04:22 About one hour since my 10 mg 5-MeO-MiPT, I still can't feel it as a separate, additional contribution on top of the allylescaline. Maybe it's just intensifying the previous effects - or is there a cross-tolerance issue because I timed the addition too late?\r\n\r\n~21:30 T+04:52 The other band opens the concert. We are in the backstage. There's no food. I am hungry. I get out looking for something to eat. All I manage to find without getting too far is a roasted corn cob. Roasted corn has never tasted better. I drink a whole 1500 ml bottle of water.\r\n\r\n~22:15 T+05:23 Our turn to play, at long last! I have written down very few trip notes about the performance, scribbling hurriedly in my phone during the intermission. I do remember distinctly the way I felt: great! I believe my hearing/perception of my own performance was objective enough, because in general I am always sternly critical of my own playing and very seldom satisfied. This time I did play correctly - more than that: I played well, with the right attitude, the right timing and the right phrases. The drummer - a consummated pro of my same age - was smiling at me all the time, which is enough confirmation.\r\n\r\n~24:00/00:00 T+07:22 Our concert ends. I am hungry like a wolf. Everyone is. As soon as we've taken our stuff from the stage, I run to find if there's still food to be had anywhere near.\r\n\r\n~01:00 T+08:22 I found a stand still selling sandwiches and stuff. I tell them not to close yet, there will be people coming soon. I go and call the others. We eat hurriedly: the bus driver wants to go back ASAP. I'm still feeling the effect: I don't feel much different than during the concert.\r\n\r\n~03:00 T+10:22 In the bus, I'm still at +/++. The comedown is gradual, pleasant, easy. I'm physically tired but I can't/don't want sleep. I want to play more! I start to play my melodica quietly. No one in the bus objects, though most are sleeping or snoozing. I keep it quiet and focused. However, my musical lucidity has gone: I can still play but not effortlessly, not crystal clear.\r\n\r\n~06:00 T+13:22 Bus arrives back to the collection point. We have to go and take our cars (more or less 1 km away). One of us has the car at the collection point so we're busy moving instruments, leaving someone to watch the stuff while the others are away etc. I feel tired but still active: my eyes don't close. After we bring the instruments in the studio and before we say goodbye, 5 of us have one more joint at the studio.\r\n\r\n~06:45 T+14:07 I feel safe I will be able to drive home without falling asleep. I do drive home safely. At home, I waste at least one more hour before eventually going to bed, feeling more or less baseline. I woke up 5-6 hours later, fully refreshed and with a pleasant afterglow that lasts the whole day if not longer.\r\n\r\nCONCLUSION\r\n\r\nAllylescaline: Inner slide show present but minimal. Headspace nearly normal. Little introspection at best. So what's the point? The pleasant body load? (Bathing was, indeed, fantastic.) The welcome oiling of social gears? The extra appreciation of music? Well yes - all of this, and more I can't put my finger on. Maybe it's that I kept my conscious, active mind totally unobstructed. Maybe it's that the ease of performing felt supernatural. I hadn't been playing that instrument in this context (or in any other, actually) for months, but it all came out better than at any of our rehearsals, without any anxiety/insecurity. Maybe it's that I was able to have two of the women I really like around for a day and I felt good about it, without a worry about banging either one (a few fantasies at most, ahem). Maybe it's that it feels like I can steer the trip wherever I like. It's subtle for sure. It's shallow, maybe. But it's definitely there. It is not menacing or difficult in any way. On the contrary, it seems to me this substance, while slightly stimulant, has definite anxiolytic properties, while keeping me in a vigilant, alert, active mood - totally unlike the sedating fog of benzodiazepines. Also, totally unlike TMA-2, another mescaline analog that seems quite useless to me, at least at moderate doses ( http://www.erowid.org/experiences/exp.php?ID=100301 ).\r\n\r\nA good thing I could say about allylescaline: I consider it a good possible introduction to psychedely for newcomers. It has no negative bodyload for me, and I found it easy to manage and not scary in any way. I offered it twice to beginning experimenters (at 20 mg), and in both cases they were pleased and willing to repeat in the future. I consider myself beyond the beginner level, and while being a big fan of expensive, hard to get mescaline, I still like to use allylescaline relatively often. One issue is the duration of the trip - fairly long at 8-10+ hours, so I will repeat it but only when I can take it in the morning with a full day to invest. I would like to up the dose to 60-70 mg or more.\r\n\r\n5-MeO-MiPT: in this context, it was barely felt. Maybe it did add some fun factor, but if so it was just a tiny bit.\r\n\r\nThe combination: worth experimenting again, with a different allylescaline vs. 5-MeO-MiPT balance (more of the latter). One issue I foresee is timing: if I want the fairly quick, fairly short acting 5-Meo-MiPT to kick in later on, as in this experience, will the allylescaline create too much tolerance for the second molecule to work effectively? Maybe I should ingest both at the same time.\n\n\n\n\n\nExp Year: 2014ExpID: 104036\nGender: Male \nAge at time of experience: 42 \nPublished: Jul 14, 2015Views: 668\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n",
  "doses": [
    "T+ 0:00 53 mg oral Allylescaline (capsule)",
    "T+ 0:00 repeated Alcohol - Beer/Wine",
    "T+ 3:21 10 mg oral 5-MeO-MIPT",
    "T+ 0:00 repeated Cannabis",
    "T+ 0:00 oral Noopept (daily)"
  ]
}