{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t 1 cup\n\t\t oral\n\t\t Ayahuasca\n\t\t (tea)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   61 kg\n         \n\t\n\n\n\n\nI warn you that this report is more than just a simple trip report.\r\n\r\nIt covers many months as the impact of the trip didnt stop after the active molecules had dispersed. I will try (as best as possible) to give a detailed account of what I went through with this powerful psychedelic.\r\n\r\nIt all started around 5 years ago.\r\nThats 5 years during which I couldnt write about what happened.\r\n\r\nAt that time I was already quite experienced with certain psychedelics: salvia divinorum, mescaline cactus, some magic mushrooms and weed (both smoked and eaten) Id had some bad trips but nothing really too bad. These experiences were nothing compared to what I was about to go through, but then I had no idea of that yet\r\n\r\nAt the time, like many psychonauts I had done a lot of research on ayahuasca, the books (and films) of Jan Kounen, Jeremy Narby (the classics), Jean-Marie Delacroix, etc I had read up on the subject over a number of years in fact. I was conscious that this was not something taken for fun or even pleasant. Like you, I was full of the idea that this experience could cure certain things, that it was a teaching plant with the shaman as guide.\r\nI had heard tell of rip offs.\r\nI saw friends go off to the south of France on weeklong seminaries, run by serious people, at least well mediatised ones (the Blueberry shaman). One of my friends even called me during his third trip, completely freaked out: he had left the ceremony circle and gone into the woods half naked, his only connection with reality being me on the other end of the phone I had managed to reassure and calm him down. He finally returned, a bit shaken up and very excited by his visions but full of even more questions than before hed left.\r\n\r\nIn short, I knew the risks. At least I thought so.\r\n\r\nSo one day at last I had the opportunity to participate in a ceremony. Someone recommended a specialist to me (a kind of organiser in fact). I was given his contact details, I checked him out a bit then called him.\r\nThe first time I saw him alone. Then there was an information meeting with the other future participants. Some old hands were there to tell of their experiences and to sing the praises of what was to come. Bit by bit I gained confidence. It seemed that the shamans in question (C. and M.) had already conducted many ceremonies. They exercised in Brussels and in Amsterdam (and in France, before the ban). Their speciality was also kambo - the venom of a south American frog that is supposed to be a very powerful stimulator of the immune system and a whole load of other merits Ive forgotten The ceremony that I was to follow was therefore a package of ayahuasca plus kambo in the second part.\r\n\r\nAlong came the week when I had to make up my mind. A doubt persisted, something from the gut (that I interpreted as fear). At that time I was convinced that I must overcome my fears. On the day that I had to pay up half in advance (80 euros) a customer at work (I was working  in a shop so I had seen this person many times a week over a year and a half) chose to speak on that very day about  ayahuasca! What a strange coincidence.\r\n\r\nThat evening, on the way to see the organiser, came a second sign while I waited for the metro. A tract was lying on the seat where I sat with a drawing of a snake on it and the title Saturday night SNAKE Party! (the ceremony was to be on a Saturday night, and Im sure you all know the symbol of the snake and the liana).\r\n\r\nSo, there I was, signed up. I had a few instructions to follow 2 days before (which I did) : no drugs, no sex and no salt until the ceremony. On the big day, one of the participants came to get me at work. I walked nervously up and down while I waited for him. Once in the car we chatted and I felt more relaxed. It wasnt his first time. He was a raver and had tried out a lot of different stuff. He said the nearest to ayahuasca was 2C-T-7. We listened to some sounds. I particularly remember: Younger Brother - Ribbon On A Branch.\r\n\r\nWhile listening, I had the feeling of going into the unknown and also towards a kind of little death. So I thought of those I love, my family and friendsspecially those I had argued or even fallen out with. I sent SMS to ask forgiveness and to make peace.\r\n\r\nWe arrived at last in Brussels.\r\nAfter a while finding the place and a parking spot, I felt the tension rising again. When the door to the hall opened, I smelt the characteristic smell of palo santo ( a wood that is burnt as incense during ceremonies)! I dont know why but my body rejected this smell and suddenly I had a sensation in my belly crying out DONT go in, turn round and make it to the nearest train station!!!\r\n\r\nI began to share my worries with the person I arrived with and he seemed rather uncomfortable he said no its OK, but I insisted. At that moment a 50 year (Mi) old man approached me confidently. He is a jewish company director and a father who claims to give ayahuasca to his 15 year-old son! He stared at me as if he could read my thoughts, then he began to list all the emotions I was feeling, and reassured me, Dont worry, itll be alright. Ive been through it too but you mustnt let your fear influence you! If you leave now, fear will guide you all your life! Etc\r\nAll of a suddenI didnt know any more.\r\nH.L. (the organiser) then came up to me and drove the nail home saying that I hadnt come all this way for nothing!\r\nThe shaman came over too, introduced himself and reassured me. He also encouraged me to join in, that all would be fine, etc\r\nI started to enter the room, then seeing that I still hesitated, the organiser said, Come on, were not hanging about all night, if you want to be scared all your life thats your problem So, in the flow of the moment and wishing to surmount my fear, I paid the last 80euros and followed the group.\r\n\r\n\r\nThe men (10) went to one side and the women (also 10) to the other. There was a portrait of Christ (they are a part of Santo Daime). But at the beginning of the ceremony the shaman invoked many divinities. The shaman offered a glass (that he refilled each time) to each participant. The drink was kept in a plastic bottle (coca cola type) and was orange-ochre in colour. The taste is quite specific and not very nice, but I had already tasted Calea zacatechchichi and shavings of San Pedro so it didnt seem that bad. I was next to Mi who hissed a sort of ttssss, ttssss like in the Jan Kounen films.\r\n\r\nAt first I didnt feel anything. Just a slight doziness, thats all. Then a bit of stomach ache and feeling sick (but nothing serious). We had been warned that we might feel like throwing up.\r\nThe chanting began with some drumming. The lights were dim.\r\nMy way of thinking began to change gently, becoming clearer. And with a kind of indescribable and gentle high.\r\nAt one moment I saw a snake skin (with fluorescent scales) that spread out covering the whole room!\r\n\r\nThis went on for a long while, when suddenly I had a kind of revelation: at the precise moment that this thought occurred in my mind, a sort of projector (the conscience?) lit up to reveal it!!! It seemed very simple but it was a proper revelation.\r\nI knew the principle having studied different Buddhist masters a bit and done some meditation, but this was something else, a full on experience!\r\nWith this weapon it was impossible to feel fear (and all the rest of the mental film). As soon as the fears arose they were targeted and vanished by themselves! I had the feeling that I knew a bit what Christ, Buddha (and others) had tried to explain to mankind.\r\nI felt euphoric at this discovery and delighted in this power.\r\n\r\nThe ceremony continued until the shaman let out a horrible scream!!!!!! At this moment I felt something tear inside me or break (my ego? my mind?). But I paid no special attention to this. The screaming stopped, that was the main thing!\r\n\r\nThen simple instruments were handed out (small drums, whistles, maracas, etc.) so that all could join in as they felt. Bit by bit the sounds became harmonious and we all made ONE. It was beautiful , the best moment for sure in the ceremony. I had a wonderful feeling of being a small child again, of rediscovering the joys of sharing that we lack so much in our society.\r\n\r\nThe first part of the ceremony was over after about 3 hours ( around midnight). Now it was time for kambo.\r\nThe shaman duo burned sticks to produce embers at the ends. With these they made small holes (3 for the women, 5 for the men, I think) on the shoulder or the leg. It wasnt a real burn, it was just to weaken the resistance of the skin so that the venom could enter quickly into the blood...apparently when it gets to the brain, you think its THE END. Its impossible to reason and your body feels that its all over, youre about to die. The heart starts thumping quicker end quickertut tut tuttut\r\nTUTUTUTUTUUUUUUUUUUUUUUUUUUUUUUuuuuuuuuuuuuuuuuu..\r\n\r\nMi was one of the first to take it and I watched as this big strong bloke, whos well experienced in ayahuasca, first turned green, then crumpled, sliding down as if in a faint while vomiting the staff took care that he didnt choke on his own sick\r\nHonestly I had no desire to take that and I said so. They explained that ayahuasca is like a bomb that destroys everything, leaving a wide open wound and that kambo acts as a bandage. Too bad, no bandage for me. Another person made the same choice as I.\r\n\r\nThe women seemed to resist better than the men.\r\n\r\nAround 4 in the morning, everyone lay down (mats, sleeping bags, etc.) though it was hard to sleep after all that had happened. Quite early in the morning, there was breakfast over enthusiastic discussions on the revelations of the night before. I set off around midday on the journey back with the same pilot. We drove mainly in silence, due to our fatigue. \r\n\r\nWhen I returned home it was quite surprising, I seemed to rediscover my street! With brand-new perceptions. I wanted to share the excitement of the revelations of the night with those close to me but at the same time I felt exhausted.\r\nI went to bed early that evening. I had already taken the following morning off work to recuperate well. I went in to work that afternoon but I felt strangely out of synch with the job, without being able to know why. \r\nI felt that something had changed. It was more of an effort to concentrate than usual. Having a job with responsibilities, that was a setback.\r\nI got through the day, got home exhausted and went to bed.\r\nThe following day there was a big load of work. By midday I felt out of it and feverish. When I got back home I felt so very knackered that I knew something was wrong. I noticed a red mark on my neck but I didnt think much of it (an allergic reaction? Had I eaten something that had reacted with the MAOI ?)\r\nThat evening I smoked a light joint that the driver back had given me on the way home. The revelations from the ceremony came back to me. I went to bed. The night was terrible I woke up every 30 minutes in a huge sweat and I felt very anxious.\r\nIt was the start of the strangest period in my life.\r\n\r\n[music supposed to illustrate the strangeness : Bluetech - Oleander (Phutureprimitive Symbiotic Remix)]\r\n\r\nThe next day, same thingand I had a strange sensation in my left cheek (just above the lip). It was quite freaky. A kind of vibrating/tingling. Id never had that before.\r\nMy loss of concentration was getting worse and organising stuff needed an enormous effort!\r\nInversely I felt much more in the present moment. When I walked, I didnt look to go somewhere, I didnt think at all.\r\n\r\nOver the following days I lost more and more sleep with very short nights (4h), repeatedly broken by sweats and strange sensations in my head, as if an energy was going from left to right, with accompanying fears and derealisation. I am normally a practical type of person but I thought about witchcraft and I wondered what had really happened during the ceremony. I couldnt get it out of my head. The days passed going from bad to worse. Many customers at work asked if I was Ok? Said that I looked awful\r\n\r\nI decided to see my doctor about the strange sensations in my cheek. He ordered a few tests that gave no results, then prescribed some tranquillisers (when I talked about ayahuasca that he had never heard of).\r\nI took them for a few days but they did nothing to improve my state: the confusion and the strange sensations remained and on top of it I felt dazed.\r\nOne evening I took a very bad turn and went to close myself in my bedroom. I had a strong feeling of imminent death. It was pure FEAR. I had already experienced bouts of anxiety before but nothing like this.\r\nI went out and walked in the rain, feeling that if I did nothing, I would die.\r\n\r\nI went to see someone I know who does reiki and who offered me a free session. It calmed me a bit and I managed to sleep slightly better that night. But the next day, it was back to square one I couldnt ask her this favour every day.\r\n\r\nI decided to get back to the organiser of the ceremony who was in Paris. He suggested I return the next month to drink again. I had absolutely no desire to do that (on top of which it meant paying 160 euros again). When I told him this he said Do a bit of yoga then! and hung up.\r\nI was devastated.\r\nLater on I got in touch with him again via Facebook to explain what was happening to me. He washed his hands of it all saying: Weve done thousands of ceremonies and theyve always gone well, so its your fault. Some time after I heard that many victims had reported these people (in Belgium)but I didnt know that at the time.\r\n\r\nI felt so very lostI didnt know where to turn. Im not a practising Christian (I was baptised but I hadnt been inside a church for years) but I started to go to pray every day in these holy places.\r\n\r\nAs allopathic medicine could do nothing for me I turned to homeopathy. The homeopath gave me various treatments to follow and after hearing my story, suggested I call a shaman that he knew in Paris who uses drums.\r\nAccording to him, this person could help me (at a price, of course).\r\nI was on the verge of despair so I got in touch with her on returning home.\r\n\r\nShe inspired me with confidence and, seeing as I was in such a state, she fixed an appointment for the next day. We got on well and I told her certain things and she seemed to guess others (quite strange) she told me that these people were mad: a group of 20 for a ceremony was far too many! She also said that luckily I hadnt tried the kambo.\r\nThen she asked me to lie down and began to play a drum over methen something happened (very personal).\r\nI began to cryI cried a lot and I realised that I hadnt cried like that for a long long time. Deep tears from way down inside my heart. At the end of the session she asked me to be as conscious as possible of my thoughts at all times, never to stop\r\nBefore the magnitude of the task, I felt overcome.\r\nNormally it is rare that people pay attention to each thought. Thats the principle of meditation. I had already practiced meditation a bit but what was so hard was to have to do it all the time. When you do so by choice its different, but to have to\r\nThe first days were extremely tiring but bit by bit I managed it.\r\n\r\nIn the meanwhile I couldnt handle my job any more so I resigned. Luckily my bosses werent tough on me, realising that something was very wrong, so they offered to break my contract (so I wouldnt be without any money).\r\n\r\nGradually I regained a bit of confidence, though still remaining very fragile. What I didnt realise was that the ceremonies with the drums were working slightly similarly (even if more safely) to the ayahuasca one. They were keeping the opening provoked by the plants.\r\nI went gardening every day in an associative garden. The contact with the soil did me a whole lot of good, it anchored me. \r\nI felt so very disconnected with my body!\r\n\r\nWhen I took public transport it was as if I felt other peoples emotions X 1000 !\r\nIt was unliveable.\r\nI began to understand that we all have a kind of shell that can prevent us from listening to others but that also protects us and enables us to function in society. I had the impression that the liana had exploded my cover (and therefore all my protections).\r\n\r\nBut I still had these strange physical sensations (I cant describe them more precisely)in my head. Also strange states of mind, and the notion of time was altered in particular, time passed very slowly (due no doubt to being plunged in the present moment).\r\nThe months went by, in between walking meditation (I often went to a Buddhist community, their master is Thich Nhat Hanh), gardening, drum ceremonies and prayers.\r\nAfter around a year, a friend I made at the Buddhist community, suggested I see an acupuncturist. She had herself been through a very disturbing time after a 10-day Vipassana retreat, at the end of which she felt like a hole in her stomach.\r\nAfter many weeks and many medical tests (nothing found) she had been to this acupuncturist (on recommendation) and within a few sessions the hole had completely disappeared!\r\n\r\nSo along I went to see this acupuncturist (also a doctor) and bided my time patiently (I had been warned I would have to wait a long time in the waiting room!). I told her my story and she took my Chinese pulse. She was very severe towards those who were the cause of the troubles to my energy system (Chinese medicine is more than 3000 years old and is based on the chart of acupuncture meridians, unknown to occidentals).\r\nShe said it would take some time but that she thought she could help me.\r\nFrom the very first session, I really felt an improvement (for the first time after all the other methods I had tried). At certain points (where the needles were) it was as if something was being filled and that invisible wounds were closing up. It was most encouraging so I went to see her regularly once every 3 weeks (I completely stopped the shamanic ceremonies).\r\n\r\nAfter about 6 months, I felt a lot better and I started to work again, a few hours per week, thanks to a self-help organisation (nothing to do with my former job but it was already plenty for me).\r\n\r\nWell, it wasnt all perfect but I felt I was gradually coming back to life.\r\nIn the meanwhile, I tried to understand what had really happened, but to this day I can only speculate\r\nI have a few clues, looking to India there is the phenomenon of the opening of the Kundalini : many symptoms of a violent opening could correspond to what I went through (here are some interesting links: \r\nfrom Biology of Kundalini by Jana Dixon http://biologyofkundalini.com/article.php?story=Die-off and \r\nhttp://biologyofkundalini.com/article.php?story=ExhaustionPhase \r\nand Jack Kornfield also talks of it in his book A Path with Heart, chapter 9: the spiritual roller coaster, Kundalini and other side effects.\r\n\r\nWhat more can I say except that I thank Life to have enabled me to return to the land of the living.\r\nI know that others havent had my luck (psychiatric hospital, suicide, etc.) and its also for them that Ive decided to write my account.\r\nEven after all these years it hasnt been easy but Ive mustered up all my courage.\r\nI would like this to make people think twice before attempting the experience, to think if its worth the risk (even if this doesnt happen to all who try it, luckily) and to see if theyre ready. Personally, if I had another chance (and knowing what was in store) I wouldnt do it for anything in the world. But at the time, there was a kind of buzz around this liana and some claimed it to be the ultimate cure (without too much mention of the potential dark side).\r\n\r\nSome would say that Im an exception, but over the years Ive met others whove been greatly shocked by their taste of ayahuasca most of them dont have the strength, or dont want to talk of their trauma, preferring to continue their lives and try to forget (which is logical).\r\n\r\nThis isnt a full account of what I went through but it gives a glimpse. Of course, this experience has taught me a lot about myself, about the world and about life, undeniably. But the price to pay is much too high.\r\n\r\nI wish to thank my family and my friends, for the love and patience that they showed me and without whom I wouldnt have been able to stick it outI particularly thank my partner. I thank God to have let me come through this test!\r\n\r\nThanks to all of you whove read this right through to the end (respect) and take good care of yourselves!\n\n\n\n\n\nExp Year: 2009ExpID: 104149\nGender: Male \nAge at time of experience: 31 \nPublished: Aug 6, 2015Views: 2,955\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}