{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t 500 g\n\t\t oral\n\t\t Tabernanthe iboga\n\t\t (rootbark)\n\t\t\n\t\t\n\t\t   T+ 0:45\n\t\t 500 g\n\t\t oral\n\t\t Tabernanthe iboga\n\t\t (rootbark)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   75 kg\n         \n\t\n\n\n\n\nIn July 2014, a close friend and myself took a week off from the world and holed ourselves up in a remote cottage in the Scottish highlands to experience iboga. We took it in turns, with my friend (hereafter called M) going first and me acting as sitter, then two days later switching roles. Neither had taken iboga before. What follows is mostly an account of my own experience but some details from my friend's experience are also included.\r\n\r\nOur dose was 1000 mg each of total purified alkaloids (TPA). The TPA was reported to contain 95 % pure iboga rootbark alkaloids, of which 70 % was ibogaine. So 1000 mg TPA contained 665 mg ibogaine. We both weigh roughly 75 kg, give or take a few kilos, meaning a dose of about 8.9 mg/kg ibogaine. Our purpose for taking iboga was personal development rather than treating addiction so the dosage seemed more than adequate: one source that seemed fairly reliable recommended 5  8 mg/kg ibogaine.\r\n\r\nBackground\r\nBefore going into the details of the journey, some background information is necessary. Both M and I are dedicated practitioners of meditation, primarily within a Theravadan Buddhist tradition, and have about 15 years of a regular (usually daily) practice behind us, as well as a number of intensive meditation retreats, both shorter and longer. I feel it important to mention this as I believe our meditation practice  or rather, the changes in ourselves as a result of the practice  impacted significantly on the kind of iboga experience we had. Meditation (as we practice it) successively cleans up your inner world. In psychological terms, issues, complexes, fears, repressed emotions, mental dramas, destructive habits, are, over time, revealed and subsequently released. Meditation is also a path of living without regret, meaning behaving and acting in ways that are skilfull, leading to outcomes that you can be satisfied with. For me and M, although I am in no way implying that we are free from all suffering  we are both still learning, life today is easier than what it was. Much of the psychological garbage and emotional baggage, such as issues with parents, depressions, antagonism toward others etc., are, on the whole, gone. \r\n\r\nSo, being in a good place mentally and having the support of a reliable practice, what was the need for iboga? What were we hoping to gain? Our motivation was largely one of curiosity as well as a desire for deeper spiritual insight; to see if iboga could unlock doors not yet unlocked, unearth something still buried. Interestingly, a few months before taking iboga, I consulted the I Ching to see what it thought about me doing it. The reply I got was that there is peace here and now, and it should be appreciated and allowed to grow, rather than going after bigger and better experiences elsewhere. It continued: It is part of the maturity of the personal self when the activity of its growth is no longer the only thing that matters (Nigel Richmond, The I Ching Oracle). My interpretation of this is that it was probably unnecessary for me to take iboga, and doing so may even, in my case, be a sign of spiritual immaturity (that of the insatiable seeker always seeking new highs). This did not alter my decision however, but did make me aware that the desire to try iboga might just have been a play of the ego. In some ways, it brought my expectations down to a more realistic level, and my feeling was that it would be an interesting experiment, if nothing else.\r\n\r\nAs a side note, anyone familiar with Buddhist practice will be aware that taking iboga is likely a transgression of the fifth precept (rule of training) that most serious practitioners adhere to  that of refraining from taking intoxicants. I say likely since there's always the argument that iboga is not strictly an intoxicant: the purpose of taking it is not to flee from yourself as with many other drugs, but rather to face yourself full on. Personally though, I'm more inclined to classify it is a transgression, and I was conscious of this in my decision to take iboga. I should also mention that although neither of us had taken iboga before, we have both previous experience of other drugs such as cannabis, psilocybin, LSD and ecstasy.\r\n\r\nFirst phase\r\nNow on with the journey itself. At about 11.30 a.m. I took half of the dose mixed with honey and would take the second half 45 minutes later (to prevent the risk of vomiting too early) and sat down cross-legged on the floor to meditate, focusing mainly on the breath but at the same time staying aware of the wider field of awareness as a whole. It only took about 15 minutes before I started feeling the effects  a strong feeling of coming up, or rather, what I would describe as charging up. The whole first phase was akin to a battery charging: a building up of energy before the release of activity of the following phases. I could almost hear the buzzing in my ears of a finely tuned engine revving up, gradually increasing in frequency. I had strong sensations at the top of my head as though a large hand was holding onto it, and the phrase came to me, Sit very, very still. I remained with my meditation, which despite all the activity going on (light headedness, tingling bodily sensations, movement in the stomach, mental activity) was surprisingly still. Repeatedly, the breath slowed down and became subtler and subtler, and my concentration deepened along with it, only to be interrupted each time by a heaving in-breath as the body, having a more rapid heartbeat than normal at rest, required more oxygen. \r\n\r\nI think it was around about this stage that I heard some more words: You need to open your heart, which I understood as a meditation instruction. That is, in order to deepen concentration (something I have been working more on the last few years), the heart needs to open: allowing fully the pleasantness in the body that follows deep concentration to manifest and grow. This means having a soft, compassionate attitude towards yourself that 'I am also worthy of experiencing bliss and happiness'. I had not acknowledged the importance of this emotional component before, instead emphasizing mainly a uninterrupted focus on the breath for as long as possible (which also needs to be there of course). Upon hearing those words, I took my attention again to the strong sensations at the top of my head and then to my heart region, at which point I felt a channel opening up through my core from top to bottom. This was also seen as a mental image of white light passing through my body. Quite a clichéd image admittedly, and in retrospect it is difficult to say what was 'real' and what was contrived, but in any case, this was my experience. I am reluctant to call it a kundalini awakening or anything of that nature, or give it significance beyond what it was since ultimately it was also a transient experience, but I could happily define it, albeit diffusely, as an 'opening'.\r\n\r\nI returned to the breath and shortly thereafter felt an intense wave of bliss starting from my feet expanding upwards, through my legs and trunk to my navel, at which point it all dissipated. The reason for this I think is that I started examining the bliss instead of maintaining my concentration on the breath, which led to the concentration waning, and the bliss (which is merely a consequence of solid concentration) dying along with it. This is actually a common instruction in concentration training: to not shift focus from the meditation object to the bliss. Having never previously experienced a wave of intense bliss before I was fascinated by it and made a beginner's mistake. \r\n\r\nI was unable to return to the same deep concentration and was now battling with increasing nausea and acute need to shift my bowels. I told M this and he led me to the toilet. I walked, taking baby steps with my hand on his shoulder, eyes closed to not invoke more dizziness and nausea. One and a half hours had passed since the first half dose and 45 minutes since the second. Content that the iboga was working, I let myself be sick. Here it is noteworthy that I was able to move around, which was also M's experience. Ataxia, we both agreed, seems an incorrect description of iboga's side effect of physical difficulties in moving; never did either of us feel that we lost conscious control over our body. Rather, it was the dizziness and nausea that commanded you to be still. However, I understand that others taking stronger doses may experience a loss of voluntary use of their body.\r\n\r\nSecond phase\r\nI returned to the room I had sat in but felt I now needed to lie down. It was clear the charging up phase had ended and a new phase begun. Going by reports of others, it was now I expected to meet my demons, to see clear imagery of past incidents and relive them from other's perspective. However, this phase was the most unclear of all phases. Things were happening in my mind, there was a lot of activity, but no clear images, not even very clear concepts or trains of thought. It was all a jumble. I was no longer trying to maintain concentration of the breath but rather an awareness of awareness itself, or put another way, awareness of mind itself (as opposed to the contents of mind). This is a space inside our minds which is quite easily accessed through different means, for example, by just instructing oneself not to think for a second. In the space where there was no thought, what was there? It was not nothing, but rather a space, a stillness, bare awareness. It is a part of our being not connected with personality, thoughts, emotions, dreams, troubles, intellect, capacities and everything else we normally call self. It is the space in which all these things play out. This awareness, this space, can be developed with a little practice so that you can be and rest there instead of being in your thoughts. This does not necessarily mean being thought-free. Thoughts may be present but are experienced as from a distance, as movements of the mind, rather than something to identify with. [Other access points into this state: become very aware of the present moment but not necessarily with a specific focus; listen to silence; ask, who am I? and silently await a response; gaze unfocused as though in a daydream at a point a few feet in front of you, and then close your eyes maintaining the relaxed gaze and become aware of the space there.] \r\n\r\nI write all this just to give a better reference point since this state was a consistent element in the rest of my iboga journey and is the ground to insights later revealed. Interestingly, iboga facilitated being in this state. M talked about a cool, benevolent energy at this point in his journey, which I also felt, though I am unable to differentiate this and the subtle, healing energy felt when in a state of bare awareness. It seems that even if they are not the same energies, then they are at least compatible, as maintaining this bare awareness for the remaining day and a half of the journey was relatively easy.\r\n\r\nFor M, the lack of content of this phase was surprising. He relived some incidents from the past few months which had been quite turbulent, but nothing from before then, which led him to wonder if the iboga we had bought was not strong enough, or the dose too little. For my part, I did not experience any concrete memories or particular issues of concern, but since the first phase had been so potent I was convinced that there was nothing wrong with the quality of the iboga. I think the reason we weren't being slapped around by the iboga, and shown some honest, hard truths, as others generally report, was because we had already been slapped around and seen those truths repeatedly on long meditation retreats. When I realised this, I concluded that the I Ching had been right: it hadn't been necessary to try iboga. Since the journey no longer seemed to hold anything of interest, I started to feel some boredom and just wished it to be over, but in any case, there was nothing to do except just continue to lie there and ride it out. \r\n\r\nLuckily, things did get interesting again. As phase two was slowing down and thoughts were becoming more coherent, I was trying to understand how the iboga was working (again, still from the vantage point of a still awareness). I came to think about Freudian psychology with the id, ego and super-ego, and saw how it fitted in appropriately with the effect of iboga. (For those not familiar with these terms: the id is the part of us that houses all our desires, wants and wishes; the super-ego is our moral compass, built on what we've learnt is right and wrong, how we think people should behave, and perhaps even an innate sense of morals; and the ego mediates between the other two, trying to achieve some kind of agreement before allowing oneself to go ahead and act.) Many people write with regard to iboga that you come in contact with your higher self, while sometimes it's referred to as the iboga spirit. It is also sometimes recommended to take questions that you are looking for answers to, and pose them to the higher self or iboga spirit. My friend had some specific questions that he posed (concerning advice on future career plans and a neurological issue) but he received no answers, and did not sense any kind of entity that could provide answers to those kinds of questions. For my part, I had thought about asking questions, but in the end opted for having none, deciding it better to entering into it with a spirit of acceptance for whatever insights might make themselves known. However, I also did not sense any kind of intelligence outside of myself that could provide information had I had questions. But if there's no one there  who's the one showing difficult truths? My assumption is, returning to Freud again, that it's the super-ego iboga brings us in contact with. \r\n\r\nMost people usually have some kind of self-denial going on, behaving at times in ways in which they don't really feel is right but do it anyway. It may be stealing pens from work, spreading gossip, holding feelings of hate and anger, or maybe jealousy, towards others, spending too much time in front of the TV or computer though they know and feel they could be doing something much better with their life, or being negligent toward their loved ones. For an addict (which I mention since a large percentage of people who take iboga, do it to free themselves of addiction), there is the denial of repeatedly taking the drug which at some point they may feel they no longer want to do but cannot stop the inner drive to do it. Addiction may be pushing some to behave in worse ways than they otherwise would behave, stealing money to finance the addiction, selling themselves etc. To behave in these ways requires for most people a suppression of the super-ego. On some level they know it's not an ideal way to live, but the short-term kick, the voice of the id, pushes them forward to do it. The ego has to work hard to silence the super-ego, allowing the id more precedence. Iboga brings the journeyer back in contact with the super-ego, allowing it to be heard fully, and depending on how the person's been living, it's going to be more or less unpleasant. \r\n\r\nMy impression is that iboga is not going to tell you something you don't already know at some level, it's just that it's going to force you to listen to a voice you've been repressing and give you space to reflect on its words. That said, the super-ego may just be one aspect of the 'higher self' that iboga brings into conscious awareness; other possible aspects could also be e.g. a deeper sense of intuition, or indeed, bare awareness itself, but these are not necessarily going to give all the answers to life's problems either.\r\n \r\nThird phase\r\nM described the progression of the journey as sine waves that, in the beginning have high amplitude and high frequency, and slowly flatten and broaden out. The intensity of each iboga wave lessens and gets further apart. As a result, the third phase was very pleasant: long, slow waves swept over me, soothing and relaxing. The cool energy previously mentioned was more tangible now and constantly present. This phase was also the most interesting and insightful: as the intensity of the iboga wore off and normal consciousness and thinking re-entered, there was more space for reflection and digestion of information. In comparison with other drugs' come-downs, it was far from a negative experience.\r\n\r\nThe third phase started in the evening and continued the whole night during which I did not sleep at all. It was here I got a clearer sense of iboga's reset function - that is, of it cleaning the slate and rewinding the tape. For me, this manifested as experiencing consciousness as a baby again - though thankfully, a happy baby. As I lay awake in the dark, everything seemed new and quite amazing. Aspects of myself  selves which I identify with, talents, interests, faculties, memories  were not directly present but somewhere off in the distance. I was looking out from bare awareness, free of a concrete identity, similar to how I imagine a baby sees the world. If I chose to, I could bring these different aspects of myself to mind and recognise them, but if I let them be then they were somewhere else for the time being. Seeing my different selves disaggregated from the whole, moving into and out of my awareness, was fascinating. As was everything. I felt so much wonder, again, like a baby encountering its new world. Whether I was just observing movements of mind, or if I focused my thoughts on something, it all struck me as wonderful that it worked the way it did. Wonder, it seems, is a basic emotion which we probably learn to forget fairly quickly as things become familiar and we stop looking at things as though for the first time. While feeling this wonder, I felt grateful, and from gratefulness, love and compassion were not far away. It was a positive emotional spiral.\r\n\r\nAnd that's how I spent most of the night: awake and alert, bathed in basic positive emotion. I also took some time to think and reflect. Since I had not had personal issues to contend with in the second phase, there was no reflection on these kinds of things, that is, about seeing wrongdoings and looking to change behaviour. The thoughts which came and which I found interesting enough to go into were connected more with subject matter M and I had discussed the previous days. One of these topics was about limiting beliefs, how we interpret and shape our world due to our beliefs and also place limits on ourselves about what's possible in the process. Iboga does seem to take you to a place where you can reassess your beliefs: whether they're helpful or not and whether you want to keep them or take a different path. Obviously with addiction, iboga removes the belief that, 'I can't get out of addiction', but similarly with any psychological issue there may be a belief that, 'that's just the way I am, I can't help it'. With iboga such a belief can be examined and dropped; there are other options, there are other ways to act, we don't need to be tied into a harmful mode of operation just because we don't see how we could be otherwise. In my case, the instruction I'd heard in the first phase to open my heart is related to this: a limitation placed on myself due to suspicion (belief that something isn't to be trusted) of finer states / blissful emotions. \r\n\r\nAfter contemplating beliefs and the influence they have, I started to wonder just what potential we as humans really have, if we didn't limit ourselves in our beliefs. This led to thoughts about Schrödinger's cat and multiple universes  in effect, creating the universe we want to live in through choosing to believe in as yet unknowns having a particular outcome. I won't go in to this more, so if it doesn't make sense, it doesn't matter, it was just a hypothesis.\r\n\r\nThe night after\r\nEventually morning came, but sleep didn't, so I got up and had breakfast. I thought I'd go to bed sometime during the day but strangely enough, as the day went on, the more awake I became. That night I went to bed and fell into a deep sleep. After a couple of hours or so, I was moving out of deep, unconscious sleep into a dream state. The dream was forming: mostly it was still just darkness, but in the centre, some abstract image was being created, though it couldn't really form properly. I understood, as part of the dream, that I had a task to do something (perhaps to create the dream) but I wasn't capable of doing it. I tried, but knew I didn't have the capacity to do it. As the unpleasantness and anxiety of the dream increased and it felt more like a nightmare, I managed to wake myself up. Awake, I felt lost and also a certain amount of fear. I turned on the light and recognised the room I was in, and I knew that I'd taken iboga the day before last, but to be honest, I didn't recognise myself. I didn't know who I was. The sentence popped into my head, 'There's no one here in which to reflect', or something to that nature. The central awareness, the bare awareness, was present and awake, and obviously some other faculties since I could have a dialogue with myself and put on the light and so on, but most other selves  the things I identify with - were not there, not even in the distance as before. \r\n\r\nAt that point I understood how important all these different aspects of self are in order to function normally as a human. Without them the bare awareness, the space in which they all play out, has nothing to see itself in, to reflect off of. There was a definite feeling of not being whole. I started to worry that I may have been playing with fire in using iboga to disassemble my mind. Worrying that these selves might have dissolved for good, I didn't feel like having to relearn everything from scratch, and have to create new selves again  much as a child does in growing up. And I didn't want to end up in some kind of mental institution. After the heady heights of the last 40 or so hours I longed for grounding, something reliable to relate to, even something boring, mundane and grey. I got up, went to the toilet, and tried to reassert contact with the body. Standing, I felt the weight of the body and its sensations. It felt solid and recognisable. I went back to bed and lay down but still otherwise feeling quite lost. Then, after some time, as I stared into the room and relaxed, I felt how other selves started to reappear: the self connected with my relationship and all the feelings associated with that, my interest in my studies, knowledge of a foreign language - in general, a sense of identity, the sense of who 'I' (the relative I) recognise myself to be. As these parts fell into place, I felt enormous relief, though still quite shaken up by it all. Looking back now, what I think happened was simply that I was so tired after being awake for 40 hours that the selves I couldn't access were still sleeping. Parts of the mind and parts of the brain were still asleep. Normally, they'd wake up along with everything else but now they hadn't.\r\n\r\nPost iboga\r\nOver a month has passed since taking iboga and it's mostly been a smooth ride though I have encountered some difficulties in returning to normal life again. It's almost like I'm having to relearn ways of living skillfully and dealing with problems. Previously, I had strategies and ways of dealing with things, based on a learned understanding of what generally works and doesn't. Now, as things come up, I almost have to remember how I did before, or I act without reflection, make a mistake and then have to consider how I used to do to not make that kind of mistake. It seems that this is again just the reset effect of iboga: bringing me back to a place prior to habitual patterning. Even though the patterning was often related to skillful action, such as being mindful or being tolerant, iboga doesn't necessarily seem to differentiate. If you're reset, you're reset  all options are open.\n\n\n\n\n\nExp Year: 2014ExpID: 104336\nGender: Male \nAge at time of experience: 37 \nPublished: Jul 24, 2015Views: 992\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}