{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t 20 mg\n\t\t insufflated\n\t\t DPT\n\t\t (powder / crystals)\n\t\t\n\t\t\n\t\t   T+ 1:30\n\t\t 50 mg\n\t\t insufflated\n\t\t DPT\n\t\t (powder / crystals)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   180 lb\n         \n\t\n\n\n\n\nI'm writing this report because I felt that there were important aspects of my trip that weren't covered by the other reports I read before trying the substance. Some of these often elicit discomfort and/or disbelief in those I've told about them, and I probably wouldn't have believed there was a drug capable of them myself before experiencing it. Overall I would say that this is a useful substance, particularly for male authors or even psychologists/philosophers attempting to take the female perspective on things, or understand gender dysphoria. However, for me it was also a challenging experience involving many hours of uncomfortable muscle twitching (many call them 'vibrations') and being kept awake for more than 24 hours afterward. Residual effects were felt in the form of a pleasant 'stimulation' for at least a week. The psychedelic experience indeed lasts only 2 or 3 hours, but powerful effects were felt for much longer than that. \r\n\r\nI tried this substance with a sitter (a close friend, male) and in a controlled environment (the sitter's bedroom). \r\nI started with a \n\r\nAt T+30 minutes I insufflated 20mg. After a few minutes, letters were seen to jiggle slightly on my iPhone screen, LSD style. This effect began to subside before the second dose. \r\n\r\nAt T+1 hour 30 minutes I insufflated 50mg. Subtle LSD style visuals were seen in wood grain after 10 minutes, and body load ('vibrations') began after 15 or 20 minutes to the point that I needed to lie down on the bed. \r\n\r\nFor me, the similarities to LSD were superficial. There were geometric outlines on things, letters jiggled, etc. There wasn't much distortion of depth, however, and there were a lot of trails and duplicates of things, which I did not experience on LSD. Also, there was almost no distortion of time, in the sense of time loops or time appearing to stand still. I also remained very lucid throughout, carrying on logical conversation with my sitter, and didn't find a strong free association of ideas to occur, nor did I feel that interacting with sober people was too difficult, except for the highly distracting orgasms, and the radical character shift that I describe below which would have been obvious to anyone who knows me, and still quite out of place to anyone who didn't. \r\n\r\nThe main effects were in the body. It's hard to overstate the intensity of the body load: waves of orgasm (literally hundreds of orgasms in the space of 2-3 hours) accompanied by muscle twitches that resemble closely those experienced leading up to orgasm. These twitches occurred without orgasm on the come-up and come-down, the latter being extended over hours to days, and could be quite uncomfortable. I found a great deal of relief in the nervous system depressing effects of alcohol for the 72 hours following this experience, and alcohol's effects seemed to be greatly blunted during this time. Overall, DPT felt deeply 'stimulating' to the nervous system, in a way that felt uncomfortable and over the top for 5-10 hours after dosing. I was unable to sleep for more than 24 hours after dosing, though I never felt tired, and was generally in a very good mood (hundreds of orgasms will do that). I drank heavily during this period and even did lines of cocaine, none of which came close to putting me to sleep even for a nap. I slept well on the second night and awoke refreshed, however, so there didn't appear to be a crash. \r\n\r\nFinally, I'll expound on the more unique, and for some uncomfortable and difficult to believe, aspects. I am a tall and quite masculine guy. It wouldn't be a stretch to call me insensitive and macho by nature, to the point that I self-medicate with small doses of MDMA from time to time to help me be more sensitive with my significant other. All that said, I felt that this drug put me in a thoroughly female mindset for several hours, pretty much the whole time the orgasms were occurring. I felt that the orgasms themselves had a distinctly female character to them, coming in 'waves' that just moved through my body and varied in intensity, but never fully disappeared. The motions and sounds I made reminded me of those women make during sex, and the feelings reminded me of descriptions girlfriends have given me of their orgasmic experiences. For example, my breathing had a distinctive staccato pattern, I was compelled to yell out, and stifling this compulsion somewhat dulled the experience. \r\n\r\nAside from the character of the orgasms, I found myself acting female in various other ways. When I would think about a story, it would always be from the perspective of a female character. This occurred to the point that when I described the plot of a movie to my trip sitter, it was from the perspective of a minor female character, even though the main character was male, and I had described the movie from his perspective in the past. My motions also became 'flowy' and feminine, and I danced with my hips in a way I can't even reproduce after the fact. Looking down at my own hips as I danced, I immediately recognized the movement as female, having seen countless women move that way to music. I didn't explore these effects much, though, since I didn't want to make my trip sitter more uncomfortable than necessary, given that this whole aspect of the trip was unanticipated. \r\n\r\nAll of these 'feminine' movements are impossible for me to reproduce without the drug. Just as impossible as it is for a woman to convincingly move in a male way. I resumed male movements after the normal duration of a few hours. All I can produce now is an obvious parody. Likewise, while on DPT, I could not move in a convincingly male way, and could only produce a parody of my usual movement patterns. It felt as though some switches were flipped in my nervous system, presumably the same ones that sex hormones normally switch. \r\n\r\nFinally, I'm happy to report that despite all the orgasms, temporary femininity, and sleep deprivation, I was able to have sex with a woman normally and orgasm in a male way before finally going to sleep the next night (T+30 hours or more). So I have not felt any lasting effects, but nonetheless, I would say that this is a substance to be treated with great respect.\n\n\n\n\n\nExp Year: 2014ExpID: 104622\nGender: Male \nAge at time of experience: 25 \nPublished: Oct 14, 2015Views: 1,050\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}