{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t 40 mg\n\t\t oral\n\t\t 5-MAPB\n\t\t (powder / crystals)\n\t\t\n\t\t\n\t\t   T+ 1:00\n\t\t 3.5 g\n\t\t oral\n\t\t Kratom\n\t\t (plant material)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   125 lb\n         \n\t\n\n\n\n\nTo start, I have no experience with any psychedelic amphetamines, not MDMA, not methylone. I have only a year and a half of 4-FA use and extensive psychedelic use. So with that in mind I weighed out ~40 mg, swirled it in water and swallowed. The stuff has a very strong indole-like smell and almost a sweet taste, with a light brown or tan color to it. I had used some 4-FA a few days earlier.\r\n\r\nImmediately after swallowing I felt a pressure in my stomach and I got really anxious. Within 30 minutes I was definitely coming up. A wave of energy came over me while at the same time I felt very incapacitated and I quickly realized just how psychedelic this would be. By about an hour I was feeling an electrified body buzz, so much energy I did not know what to do. Meanwhile my room started to assume various hues and tactile sensations started becoming very apparent. I felt warm except for my hands so I placed my hands on the back of my neck. My skin felt so good. I put some music on to focus myself and I decided it would be best to go lie down on my bed. I looked in the mirror and my pupils were quite dilated.\r\n\r\nAround this time (1 hour) the stimulation was all becoming a bit much. The euphoria was present but a little hard to feel with all this happening around me and so I reached for my kratom. I took about 3.5 grams of Red Vein Riau, a moderate to strong variety that I have a lot of experience with.\r\n\r\nMy thoughts were very scattered at this point, kind of uncontrollable, very unlike the calm, crystal clear pleasantries of 4-FA that I am used to. Anyway, after the kratom I began to relax. I lie back down on my bed and began to enjoy some of the visuals. I could make out extremely colorful, static, geometric patterns on my ceiling. The music I had playing seemed to last an eternity full of bliss. For the next hour or two I had a hard time deciding what to do. My mind could not even begin to focus on a show I was trying to watch.\r\n\r\nAbout 2.5 hours after ingestion I could sense I was beginning to return to baseline. It's possible I killed the high with kratom. It's also possible I lacked some of the euphoria due to 4-FA use in the week leading up to this. Overall though, it was quite a powerful experience that I would like to continue to research with. Nothing about the substance felt particularly alarming on my body even though it probably was a bit rough.\r\n\r\nThe day after I felt a bit out of it, but nothing too terrible. I was getting some minor residual visuals in the form of little balls of light that would catch my eye every now and then. No brain zaps that I was aware of.\r\n\r\nI feel this substance has a wealth of potential, but I am not sure how comfortable I would be increasing the dose. Sure, I am a lightweight, but something felt a bit concerning to me the way the stimulation combines with the psychedelic overtones. I did not particularly enjoy the feeling of being mentally incapacitated with uncontrollable thoughts despite the positive feelings. \r\n\r\nIn the right set and setting, with the right company, I see a lot of potential here. While I cannot draw comparison between this and other psychedelic amphetamines, I see no reason not to give it a go. It's a very worthy substance.\n\n\n\n\n\nExp Year: 2014ExpID: 104643\nGender: Male \nAge at time of experience: 25 \nPublished: Oct 16, 2014Views: 11,619\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}