{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t   \n\t\t  \n\t\t Vitamins / Supplements\n\t\t (daily)\n\t\t\n\t\t\n\t\t  \n\t\t 10 mg\n\t\t vaporized\n\t\t 5-MeO-DMT\n\t\t (powder / crystals)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   140 lb\n         \n\t\n\n\n\n\nThe Sacred Rite: Initiation into the Temple\r\n\r\nWhen I was initially invited into this experience by my best friend I knew I was not ready. Because of a long history (28 years) as a serious crack and heroin addict, I knew I had to be very careful of my motivations. However, I am not in any way a white-knuckle, by-the-book recovering addict. I still smoke marijuana occasionally and I do enjoy a good glass of wine at dinner or before bed. But going into an experience as intense and potentially alluring as this warranted some serious consideration. When I finally did decide the time was right I was careful to set very clear and very specific intention around my journey. \r\n\r\nMy background as a practitioner of ceremonial magick in my early years and now as a practitioner of Tantra Yoga, specifically Sri Vidya Tantra which is a mantra-based, highly ritualized form of yoga magical practices, had all prepared me very well to fully embrace everything that Sophia (our facilitator's name for the batch of 5-MeO-DMT that we were partaking of) would bring to me. I also have developed a very dedicated, devoted yoga asana and pranayama practice, which I feel also served me well.\r\n\r\nI had been told that relatively few people purge with this substance, but, just to be on the safe side, I only had a protein shake that morning and just a light, vegetarian meal the night before - I had become vegetarian some six months before. The only herbal supplements I take regularly are Dong Quai and Osha. All in all my system is fairly clean and incredibly strong and resilient. \r\n\r\nI was very impressed with the diligence and intention that was given to make sure that I was as prepared as possible to undergo what, for me at least, would prove to be the biggest shift in consciousness of my entire life. The Temple of Awakening Divinity was the agent of my introduction to 5-MeO-DMT. They called and did a medical background and mental health screening; the weekend before my circle was to dive an orientation was offered which was incredibly informative and yet in no way didactic, allowing each individual to step into the space as we chose.\r\n\r\nWhen I arrived on the morning of my circle I was full of a calm anticipation, for I had a sense that everything that had happened to me in my life had been leading up to exactly this (and of course, every) moment, that I had been waiting for this all along. I helped to prepare the food that would be offered between dives to help ground each individual after they emerged from the field. Then we all went in to be seated at a beautiful altar, in a room with vaulted ceilings, sumptuously appointed and with a huge cushion in the center covered with plush purple comforter and an Eye of Horus pillow where we would lay our heads as we went in. Our facilitator used the symbol-sets of ceremonial magick to sanctify the space and cast a circle of energetic protection, which made me feel even safer and well taken care of. Directions were called, wards were set in place and we were each censed and asperged. Then we were asked in turn to offer our intention and (this really struck my heart in a good way) to offer a shadow. I offered my intention, which is stated below and the shadow of needing recognition and acknowledgement and my issues of abandonment and rejection. Then came the big question, which was no question at all for me. Our facilitator asked Whos going first? My hand shot up immediately, I am, I said with certainty and conviction. I was ready. Our facilitator asked Whos going first? My hand shot up immediately, I am, I said with certainty and conviction. I was ready.\r\n\r\nOur facilitator asked me my history with psychedelics and entheogens; the latter I had never tried, the former only in my late 20s, actual LSD-25 on sugar cubes saved in someones refrigerator from the 60s or 70s and some mushrooms about ten years ago. He asked about my drug tolerance and I explained that although I had been a severe addict, I was always a lightweight with a low tolerance. From that information he determined my dosage to be 9-11mg and explained that he used to use a scale but had done this so many times that he had gotten fairly exact at eyeballing it. I decided to trust him. I trusted the people who had connected me to him and knew that there were literally thousands of people who had experienced this through him. My intuition told me it was okay, and I have learned to trust that as well. I watched as he filled the chamber of a vaporizer with Argon gas, an inert suspension to carry the vapor into the lungs. He placed the prescribed dosage of white, crystalline powder in it and I watched as it filled with thick, white smoke. I will let the account that I wrote in the week following the encounter speak from here:\r\n\r\nIntention\r\nI present my intention to undertake these sacred rites, offering myself fully to the will of the Divine as an instrument of She who is Mahaa Saraswati, called Brahmaani:\r\nThat I find effortless connection to Her flow of creative power;\r\nThat my words, music, voice and art be herald to the continuing emergence of Satya Yuga.\r\n\r\nOpening\r\nThe circle was cast, the space held sacred. I lay in the center, arms wide in an attitude of willing surrender. I was asked to sit up for a moment and our facilitator came beside me. In perfect Love and Trust I offer you this Lamp of Light. Journey well. I took in a deep breath of air and let it all out then took the Lamp to my lips and inhaled deeply. The taste was strange yet somehow vaguely familiar. After all the vapor had been inhaled I kept breathing in until my lungs were full. Keeping my eyes open as instructed I lay back on the soft cushions. \r\n\r\nI really had had no idea what to expect when I heeded the call of Spirit and the invitation to participate in this rite. What I found exceeded anything I might have even remotely conceived. As I felt my body let go of the retained breath my entire field of vision was wrapped around with the thousand eyes of Indra in perfect, beautiful, sacred geometrical forms. The Eyes crystallized and dissolved away into nothingness and I found myself floating free. I will preface the next sections by saying that first, there was not a first or second or third of these things that occurred, but rather that all were juxtaposed and occurring relatively in time and space, or outside of it. And that these opening experiences were like layers of being that I was visiting with my awareness; experiential, yes, yet not in any way an effect of my mind, rather a construct of consciousness itself.\r\n\r\nThe Waiting Room\r\nI found myself floating free and as I became aware of the environment it seemed as if everything were made of a mercurial substance, all silvery and pastels, gossamer and mist. The beautiful music that had begun to play just as I went in had turned to a tinny, elevator-style musak.  There were others there, or perhaps they were mirrors or fragments of my ego and there was one that was more substantial than the rest. I recognized this as my predominant ego, although I am female this was a male, all dressed in white, like some eager festival goer in search of the elusive ultimate experience. He was bouncing up and down, wringing his hands and shaking his head in anticipation. Alright, lets do this! Yeah! Spiritual experience, oh boy, Im ready! It would have been hilarious had I not been so crushingly disappointed in finding my awareness here, of all places, for I was wholly intimate with this place of mist and mirrors. I had visited it many, many times before and knew it to be the realm of maya, of emptiness and illusion. I also had a knowing that I would be permitted to remain here in awareness, in a comfort-zone of sorts, but that I would get from this experience what I chose and though it was dreamy and sweet, here was only a superficial and nebulous light show.\r\n\r\nThen as if from across a vast distance I heard our facilitators voice say Remember. I realized that to go any further this part of me, this ego-self would have to stay here, I would have to drop all pretenses, dive deep and embrace what was waiting without reservation.\r\n\r\nEruption\r\nWith the word remember came another call, voiceless yet resonating from the core of my being. My most ancient, knowing Atman, my Highest Self, beckoning me to step into Her once again. I remembered the ancient rites that I had participated in through lives untold. I felt the anchoring energy signatures of those holding space around me and those holding space for me from afar. I felt utter trust and knew that I was safe and so began to go within. The Self that I now was knew what was required. Ground me I said aloud to those in circle around me. Though I had no physical sensation of it I am told that hands were immediately on my body. Hold me! I said to those who guarded my physical space. I went deeper yet and the power began to build. Hold me! I cried to those I had asked to hold space for my journey, but who were not in immediate presence. I felt myself drawing further down, a gathering of force so pure and sacred that words cannot describe. Hold Me! I cried to all holders of all sacred ritual and circle throughout time. I continued to ground and build and the power was terrible in its beauty and magnitude as I reached in and joined with the hoary Soul of Gaia Herself. HOLD ME! I screamed to the Mother of Universes as I knew the feeling Hanuman himself must have felt as he gathered his unbounded strength to leap across the ocean of Samsara.\r\n\r\nI heard the word Yes whispered by my guardians. \r\nTell me Yes! I pleaded. \r\nThey said Yes again. \r\nLouder! I begged needing to hear their reassurance, to know they were strong enough to hold the field for what was coming and they answered Yes! \r\nLOUDER!! I screamed and they fed back all of my passion, all of my fury YES!\r\nAnd I felt the coming implosion and I knew that if the field were too strong at the moment of release I would shatter. I knew exactly what was needed and when and at just that moment I said Soften.\r\nThe field I was held in relaxed just enough that the edges were allowed to curl gently in, the linear-crystalline planes of force becoming pulsating waves of geometrical particulate. I felt what every flower bud feels as it bursts into bloom, what every volcano feels as it erupts from the earths crust and what every supernova feels as it implodes in massive nuclear annihilation.\r\n\r\nFrom beyond the center of my being issued forth two distinct and inseparable projections. With the fury and potency of all of the pain and all of the ecstasy of creation, came a scream that shook the very foundations of matter itself. From beyond the portals of time and space issued an orgasm that was the birth of stars, galaxies and Universes. With it came an effluent, projectile emission that was the healing, furious waters of Ma Ganga, pouring from the center of heavens gate to wash away all of the sins of the ancestors of humanity, to purge all of the holiest places and to asperge every sacred rite performed throughout time. And in this I was born into Being. Born into the birthright of every child, into pure bliss riding the waves of Divine Consciousness, the joy of innocence that cannot be lost because it is inherently what we ARE, reclaiming the lila of the Goddess for every misplaced child of creation, transported through laughter, through tears and through songs sung in words that have been buried long ago in the sands of time, obliterated in the dust of stars. She welcomed me into Her Manifest Fullness. All that was, was the knowing: ShivaaHam- Divine, Sacred Feminine, I Am That.\r\n\r\nI remember soft waves of silvery light with all colors of creation and then some carrying me in an ecstatic, dancing flow. I was once again what I have always been, an innocent, beautiful Divine child of the Universe and I was healed of all limitation and constraint. I cannot begin to express how utterly sacred and held I felt and still feel residually. I cannot begin to express how utterly sacred and held I felt and still feel residually. (There is much more to my journey, but this has been compartmentalized by Grace in my mind until I am ready to receive and process it.)\r\n\r\nWhen I emerged from the field of Being my words and every atom of my essence said, I am Held. I could still feel the waves of energy around me, palpable enough to play with and I felt absolutely delighted in the engagement with it. I re-cognized those around me, still holding space, still saying yes, and some I felt called to share with, a message just for them. My holder of Earth energy I told that I, too, felt the pain of the Earth just as he did. I saw him hiding a feminine power within and I told him to let her out, for she was beautiful. The healer in the circle was to be told that she was fully present and that her body was beautiful and perfect. I found out later that these words carried significant meaning for the both of them. The analytical one I admonished not to overthink it and to surrender and he would see and know it all and yet know no thing. I collapsed into saying thank you, thank you, thank you over and over with tears of gratitude pouring from my eyes and laughter pouring from my Soul.\r\n\r\nNow that a span of days has passed it is interesting to observe my ego being very attached to the experience itself. In all of the workings I have engaged in before I have come to understand never to expect any experience to be recreated, this only leads to disappointment. And yet how the ego is attached! I now know, with the true understanding of first-hand experience, my person to simply be the island that I repose upon in this ocean of Consciousness, my deepest Self resting in Santosha, content in the knowledge that I am truly held, truly supported, purely loved and trusted to know and to find my way Home.\r\nI Am Held.\r\nHari Om Tat Sat, Namaste\r\n\r\nUpdate\r\nNow that over a month has passed I am happy to say that the gifts of the intention I set keep flowing in. My creativity has been reawakened and has been steadily blossoming. I have been writing, recording and creating opportunities to share the music that is moving through me. I feel much more alive and I see the Light in all those around me more clearly and consistently. My practices feel more potent and powerful and I feel I am a much more open conduit for the inherent Divinity within to shine through. It has been revealed to me that my path with 5-MeO-DMT is not yet over, however I am content to receive the fullness of this experience and not be in a rush to get to the next one. I am content to receive the fullness of this experience and not be in a rush to get to the next one. \r\n\r\nAn integration circle was offered at the end of the week of deep dive circles that was crucial to my own process. I was able to acknowledge the addict mind that just wanted to do it again, and hearing the singular and intimately personal ways in which each person described their experience reminded me that this was a moment in time that would remain forever unique unto itself, for me and me alone. Writing this account has also been a part of my process and I can only hope that the sharing of it will in some way serve.\r\nIn the field of Collective Consciousness,\r\nX.\n\n\n\n\n\nExp Year: 2014ExpID: 104695\nGender: Female \nAge at time of experience: 50 \nPublished: Dec 2, 2015Views: 713\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n",
  "doses": [
    "Vitamins / Supplements (daily)",
    "10 mg vaporized 5-MeO-DMT (powder / crystals)"
  ]
}