{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t 1.33 seeds\n\t\t insufflated\n\t\t Anadenanthera peregrina\n\t\t (ground / crushed)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   140 lb\n         \n\t\n\n\n\n\nAfter an incredibly extensive amount of research into the anadenanthera peregrina, aka Yopo seeds and their effects, I made the decision to try to prepare the snuff myself with the intention of reaching a spiritual connection and experience. I have a great deal of experience with all manners of drugs, especially psychedelics. However, after much time away from such substances, I have come to value the plant teachers, as I now believe that there is a spirit in all these different plants and this spirit is what allows me (and others) to have lasting positive effects. \r\n\r\nI began by putting five of the flat seeds in a pan on the stove on hi until each one popped in succession. I then took them out of the pan and de-shelled them, as I'd read about in other reports. The smell was very pleasant, much like peanut butter and made me feel very welcome to the experience. Once I had removed the dark outside shell, I was left with the light brown inside, which I pulverized on a plate (if you have a mortar and pestle, this would be the best kinda thing). Then I added a small amount of baking soda, I'd say in a 1:3 ratio, baking soda to seeds and mixed it all up. Next, I added just enough water to wet all the powder to a paste like consistency and then placed the plate on a boiling pot to dry out the powder. It was important to spread the paste out to have maximum surface area to dry efficiently. In about 15 minutes, the paste was all dry and was crusted onto the plate. I used a card (like a credit card) to scrape the crust off the plate and into a pile (a razor might be more efficient here). I then re-crushed it all to make an extra-fine powder. And so, my Yopo had been made.\r\n\r\nI sat down at my desk with the Yopo cut up into four large lines. I wondered how much it would burn, what it might feel like, and so on. I reminded myself that this was not just some drug, but a plant spirit I was about to commune with, so I took a moment to set my intentions and thank the plant for offering this experience to my consciousness. I moved my awareness into the deepest part of myself in that moment, being sure that I was not merely doing this for fun or pleasure-seeking, but rather for a truly honest look into myself with the aid of this powerful plant ally. I gathered a deep breath, exhaled all my love into the universe, and bent down to insufflate my first line. \r\n\r\nI got halfway through the line when my nostril felt completely stuffed and I felt some of the snuff starting to go down my throat, so I paused. Then began a burn which was quite painful, but not as bad as snorting 2c-e or DMT sulphate. Even so, it kept me from snorting more. I also heard movement upstairs and figured it would be unwise to do more if I was to engage in any kind of conversation or interaction. I put the plate away for the time being and went upstairs, thinking that I hadn't had enough for an active dose. I greeted my elderly friend and began conversing about the day, feeling quite in control. Within the next five minutes or so, I began to hear a loud buzzing sound, which I thought was coming from the lights, but I later realized was the DMT carrier wave. It grew to a point (all this while I was carrying on a conversation) where the buzz began to vibrate my entire body. It was as if I was pulsating or emanating a strong energy. I felt very much in control still, though I knew if the effects grew more I'd have to go back into my room. We continued talking and I felt the characteristic awareness of my teeth and ease of movement of my body. Gradually, I felt the effects begin creeping into my vision, as the Yopo had finished filling my body. Looking at my elderly friend, I felt I could direct my visual energy towards him and I could see into him, almost like an X-Ray. I understood now how shamans use these medicines to see maladies. At this point, our conversation had reached an acceptable close and I excused myself to take a nap. \r\n\r\nI got into my bed and lay down with my eyes closed, the effects still gradually building. There was a very great pressure on my head and I kept trying to ask the Yopo spirit questions, but it had no answers. I figured that I hadn't taken enough to earn the right to have questions answered and it seemed the Yopo had it's own agenda to fulfill. The pressure mounted as some interesting weblike patterns appeared behind my eyelids. And suddenly, after what felt like half an hour and when the pressure on my head became too much to bear, it all stopped. I wondered if it was over. I opened my eyes and saw the energy in the walls, permeating the room. It was very beautiful and peaceful. I felt blessed to be given this opportunity. I opened my heart. As I did so, I began to hear Indian chants and I knew these were the icaros. I began to sing what I heard and as I sang/chanted, the visuals changed quality. After I finished singing one, another one was sung into my mind. I could tell that this was the plant spirit. I had never heard these songs before, and I had never, in all my experience with psychedelics, had these types of songs shown to me. I felt truly blessed and thanked the Yopo spirit once again. I then was very gently taken down into a very visionary, almost dreamlike state, where I was shown many things. I can see why it requires practice to master the understanding of this visionary phase, as some things seem like future, others seem like potential parallel realities, and others seem like 'false' visions. I am interested in exploring this further and possibly in higher doses at the appropriate times. As I very gently came down, I felt some minor nausea which was fine. I know that in higher doses there will be a purge and I will be okay with that. This is truly a healing spirit, and I consider myself honored and blessed to be able to encounter it in this lifetime.\r\n\r\nIf you plan on journeying with these sacred seeds, be sure to explore your intentions, give respect, and open your heart to whatever comes. It will treat you with as much love as you give to it.\r\n\r\nMay all beings find light and love in their true selves.\r\n\r\nNamaste.\n\n\n\n\n\nExp Year: 2014ExpID: 104784\nGender: Male \nAge at time of experience: 23 \nPublished: Dec 2, 2014Views: 4,348\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}