{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t   repeated\n\t\t smoked\n\t\t Cannabinoid Receptor Agonists\n\t\t (plant material)\n\t\t\n\t\t\n\t\t  \n\t\t   \n\t\t smoked\n\t\t Damiana\n\t\t  \n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   200 lb\n         \n\t\n\n\n\n\nSo, a friend handed me a packet of this stuff and asks me what it is. I looked at the ingredients on the front and googled the chemical names - 'It's a synethetic cannabis made up of Damiana, a mild stimulant from South America and a new chemical called STS 135'. There seems to be very few trip reports on the internet and the ones that report back don't give consistent experiences. I tell my friend this. She asked if I want to try it. So, I went to a party in London, rolled it and me and a couple of friends smoked a little. It smells like burnt plastic and has a very chemical taste. I put a very, very fine amount of this stuff in, if it was weed it would basically have given you a very mild buzz. I couldn't tell you the dose but we're talking low mg. But about ten minutes in, we all tripped out massively. We had to go and sit in the kitchen breathing deeply for forty minutes before we could think again.\r\n\r\nAnd I suppose at that point, I should never have taken it again, but, as far as I was concerned, I'd taken a legal high that claimed to be cannabis that actually worked. I've mostly stuck to the traditional illegal drugs and my previous experiences with legal highs had pretty much all been negative and/or disappointing. It seemed to me that what had gone wrong was that we'd taken too much. I immediately resolved to do it again to establish a safe dose.\r\n\r\nThe next week, I got drunk with a different bunch of friends, who were somewhat tougher drug users, and offered them this new 'weird weed', as we were calling it. They asked me if I could recommend it. I said 'No, it's at your own risk'. We were drunk and did it anyway. I rolled an ordinary sized paper with literally a tiny, tiny pinch, I'm guessing there were like 15 specks in the whole thing. At that dosage, it was quite pleasant, we noticed that it was very similar to cannabis but it was like there was a layer missing, like cannabis gives you a slight feeling on pressure on the whole of your head, but with STS 135, it only did that to the top. But it went well. Bearing in mind that we weren't sure whether this was the effect of the damiana or a particular property of STS-135, but we did notice that it had a hallucinatory effect at every dosage level (whereas you have to be truly gone on cannabis to achieve a similar experience).\r\n\r\nFast forward four days later, I wanted to get high, and I figured I may as well continue testing the new drug, especially as we'd established that it was possible to get high and enjoy it. But I'd recently given up tobacco and didn't have any in the house.  At that point, I made the second stupidest decision I have ever made in the history of my seven year drug-taking hobby, and decided to smoke a blunt of this stuff. Just a single toke, I figured, would give me a very strong high, but if I did trip out it wouldn't be unexpected and would be quite manageable. You know, establish the upper limits of what was a good dose. I rolled it up and lit it, but it side-burned, which always really pisses me off. So, I made the stupidest decision that I've ever made, ever, and toked it again to make it even. Then I ashed it, shut my window and went to sit down at my computer.\r\n\r\nSome context here: My family generally die of heart attacks, and I have a mild sinus arrythmia, so I tend to worry about the state of my heart. So, when I take a new drug, I generally check the time, watch my heart rate and keep measuring it. That's how I know within 15 minutes of taking this stuff, I was too high to be able to concentrate on anything for more than a nanosecond. There was a warm gushing, flowering sensation in my chest that made me feel like all the blood in my heart was pouring out in my chest cavity. I started trying to breathe deeply and regularly but the experience kept intensifying until I basically disassociated from my own body.  At that point, I simply watched myself get up and go to the bed, check my heart rate according to my watch, get back up again, put on my shoes, leave my room, lock my door and walk down to the A+E that thankfully, is extremely close to my house. I continued to check my heart rate while I was heading over there, which read at 80bpm. I'm not convinced I did it right because a) I could barely think and b) the doctor subsequently told me that my heart rate was over 137bpm on admission. I realised that I had a dry mouth and my extremities were cold, symptoms of STS-135, but also inconveniently the signs of a heart attack, which increased my agitation further. I kept touching my chest and neck to try and see if I could work out what was going on inside.\r\n\r\nWhen I got there, I had to tell the staff that I had overdosed on a legal high and that I was hallucinating that I was having a heart attack, and I needed to check that I wasn't in fact having one. They told me to go sit down, and you know how normally you have to wait quite a while? In ten minutes I was triaged, put in the arm cuff, and immediately admitted to A+E proper. The nurse hooked me up to what I guess whas an ECG machine, given I had all the little stickers and wires on my chest, which freaked me out because I was still tripping madly and was convinced that this warm flowery sensation in my chest was a heart attack and at any moment she was going to hit the red button and I was going to have CPR right there and then. I asked her, (which was like talking through an echoey fog), and she said everything was going to be ok, tucked me under the covers and told me to wait for the doctor.\r\n\r\nAgain, I kept checking the time, which is how I know that the experience reached its peak 45 minutes in. At that point, I was glad that I was in a hospital hooked up to an ECG machine, because I was literally petrified that I was dying and only watching my heart readings (120bpm by the time I was in the hospital bed) stopped me from freaking out any further. I was paranoid and because I was tripping out so badly, I couldn't sustain any thought other than that I might be having a heart attack. The only thing I could do was watch the ECG machine and reflect that, if I was about to go into cardiac arrest, there was no better place to do it than here. I'm the sort of person who finds this information mildly reassuring.\r\n\r\nThe doctor came by after a while and I explained what had happened. She took down notes, and I apologised profusely for having taken up an A+E bed for something so stupid. She then went away and looked up STS-135 on the NHS database, while the nurse came back and injected me with fluid to lower my heart rate.\r\n\r\n90 minutes after smoking the blunt, I came back down to a normal high. The chemical top-of-the-head, everything-seems-brighter-than-usual high. I managed to get my phone out and ask a friend to come out to see me, which she did. At that point my heart had gone to 110, and continued to sink. The doctor came back and started telling me about what I'd taken, and I peppered her with enough questions that she just went and got me a print-out of this entry on the NHS poisons database. I'm going to copy and paste the Features of a STS-135 because what was on this sheet was obviously what I should have found instantly on the internet and didn't:\r\n\r\nCentral Nervous System: agitation, tremor, anxiety, confusion, somnolence, syncope, hallucinations, changes in perception, acute psychosis, hystagmus, convulsions and coma.\r\n\r\nCardiac: tachycardiac, hypertension, chest pain, palpitations, ECG changes.\r\n\r\nRenal: Acute kidney injury.\r\n\r\nMuscular: hypertonia, myoclonus, muscle jerking and myalgia. \r\n\r\nOther: cold extremities, dry mouth, dyspnoea, mydrasis, vomiting and hypokalaemia.\r\n\r\nIt turns out that STS-135 is a 'full cannabinoid agonist receptor'. Cannabis is a 'partial cannabinoid agonist receptor'. What this means is that you have two types of receptors in your brain, CB-1 and CB -2, that receive chemicals and turn them into messages that say, among other things, 'get high'. As a partial agonist, cannabis gently strokes these receptors. STS-135 punches them in the face.\r\n\r\nSTS 135, in addition to the tripping out, also messes up the normal beat of your heart (potential QRS prolongation and QT prolongation due to sodium and potassium channel blockades, for the geeks among us), so I actually wasn't just paranoid - at a higher dose, it really might have caused my heart to fail. I found out later through a friend, as the main ingredient in a legal high mix called Clockwork Orange, it has killed at least five people. And it's so new, only 13 people have been treated by the NHS for it, so even if you turn up with your symptoms, it's not certain your doctor will have any idea what to do.\r\n\r\nI stayed in hospital until my heart rate went down to 80 and then decided I probably wasn't going to die that day. I discharged myself and, despite my friend's misgivings, went to work the next day, made especially difficult by my repeated hallucination while typing that my hands had detached at the wrists from my arms. \r\n\r\nI wish that was the end of the story, but the reality is that I accidentally took STS-135 again the next week, when I used the same grinder to smoke an ordinary joint with a friend. I have two and thought I'd chosen the right one, and only realised I hadn't when the same chemical high started to descend and my heart rate started to elevate more than I would normally expect from a joint. I became incredibly paranoid and made us destroy the joint (we'd only gotten through half of it) 'in case we got caught'. I gather from my friend's comments about possibly having rolled too strong that she was also having the STS experience but wasn't unduly worried about it. I didn't want to alarm her and make her trip out, so I sat in my chair for about an hour and a half pretending to watch television and trying not to freak out so much I'd have to go to hospital again. We're talking about a quarter of the dust left after shaking out a grinder (because we'd both smoked it and thrown away the second half) but even then it was still sufficiently strong that I was so totally incapacitated I had to ask a friend who was in the building to leave immediately without seeing me. The next day I destroyed the plastic grinder I used and boiled the metal one for an hour (and I haven't used it since).\r\n\r\nAfter everything I described happened, I went searching even harder than usual for information on the web and eventually tracked down some psychonaut message boards where people are literally going where no drug user has been before that had some stuff on STS-135. It belongs to a class of drugs that basically have such a fine line between a relatively pleasant high and what these guys called 'The Fear' that it's not worth doing.\r\n\r\nThere are obvious ways in which this could have been safer. STS-135 is a white powder that is sold in headshops soaked onto some kind of leaf, in this damiana, which is a drug in its own right. That made extremely accurate dosage difficult. Additionally, I was alone for the time I went to hospital, and perhaps this created a negative feedback cycle that could potentially have been avoided if I'd had a friend present. However, I'm not sure of that, because while I was alone in my room, there were other people around in the building, and if I had simply wanted reassurance, I could have sought it. A heart rate of 137 is not life-threatening (you'd work up a bigger sweat in the gym) but what STS was specifically doing to my heart (messing up the electrical pulses that cause it to beat) potentially is. I think I would have gone even if I'd done it with a friend. But my point it, if you are thinking of STS-135, buy the powder online (it's £6 a gram at the time of writing, so you've no excuse), measure it, and be careful.\r\n\r\nI'm not going to go so far as to say that you should never use legal highs, I am a big fan of methiopropamine. In fact I won't even say you shouldn't use STS-135, you're (presumably) an adult and can and should make your own choices about what to put into your own body.  But I wouldn't recommend it. I took STS-135 four times and three of those times were unpleasant, of which one was positively dangerous. I am an experienced drug user who did my homework and even using testing protocols still tripped out massively, and potentially threatened my life. I still have occasional flashbacks (particularly the hallucination of my hands detaching at the wrists from my arms) and I think that whatever that stuff did to my brain, it has permanently affected my ability to use skunk because of the similar high. I am never, ever going to use STS-135 again and I think you are a fool if you try.\n\n\n\n\n\nExp Year: 2014ExpID: 104745\nGender: Female \nAge at time of experience: 25 \nPublished: May 18, 2015Views: 3,541\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}