{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t 25 g\n\t\t oral\n\t\t Kratom\n\t\t (daily)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   170 lb\n         \n\t\n\n\n\n\nFirst, some background: I've been an everyday Kratom user for a little over two years now, beginning while I was on Active Duty in the United States Army as an Infantryman. My service spanned 3 years, the last two with Kratom, and I have received an Honorable Discharge and am beginning the next chapter of my life. Before the Army, I was an opiate addict averaging 200-300mg of Roxicodone and eventually a gram of Heroin a day. I came to a point in my life where I knew it was time for a change, and I decided that spending a few years putting my own comfort and safety aside in order to preserve those of others would develop a part of me that I had neglected. \r\n\r\nThe first time I heard of Kratom, I was in my barracks room browsing message boards on the internet reading about Post-Acute Withdrawal from past Heroin use. I had been in the Army for a year and clean of opiates the entire time. I knew I was still recovering from my past mistakes and I won't pretend that it didn't affect me every day at that point. I had endured what is considered by many to be the hardest Basic Training/Individual Training program in the military, and I had been with my unit for about 8 months. Every second if it was miserable.\r\n\r\nI arrived at Ft Benning for my initial training in full-blown withdrawal. I didn't sleep the first four nights, at first because they made us stay awake to in process, and the rest because I was in withdrawal. I came close to defecating myself several times, and was very weak. By the time I got to my training Company, I had made it through 10 days of withdrawal while in Reception. I still felt like hell, but I had my bowel movements under control and I was constantly moving fast, sweating, doing push-ups, running, and yelling. It was intense, and the misery of my training distracted me from the misery of being newly clean, in a way. About 4 months later, I walked across the parade field a newly minted United States Infantryman. Not only had I accomplished something noteworthy, I was 4 months clean of all drugs. I felt good about it. I had succeeded, I decided to raise my right hand and become something better and I had succeeded. It took a while for me to get over that. Even still, I could feel the tug of a relapse, constantly nagging my subconscious.\r\n\r\nBack to the first time I heard of Kratom. I ordered 3 ounces and had it sent to my girlfriends mailbox. Now, heres the strange part, I didnt feel anything significant my first time taking it. Or my second or third time. It was only on my fourth try that I achieved the feeling that I have grown to appreciate. It was like tension was released from the very bottom of my soul. I felt a very light opiate-like warmth, but by no means was there a rush. The very peak of this feeling, to me, felt like the late come-down feeling of a normal opiate. I was relaxed and slightly euphoric, but most importantly: I felt as though the hole within me that was the result of my past drug use was filled. I felt like me, a pretty relaxed and chilled-out me, but more like me than Ive felt since before all my mistakes. As time went on, it became clearer and clearer to me that this meant I had found my remedy to PAWS and cravings. To this day, I have had no issues with the former. As for cravings, I still think about going back to my old ways. Ive even gone as far as to look at pictures of the pills I once devoured, imagining them in front of me so I could take total control of myself and the situation and walk away from them. Shortly after running this little mental exercise, the craving is gone.\r\n\r\nKratom had helped me defeat my own personal issues that were a result of opiate addiction. Thats not all it was good for in my life. My job involved copious amounts of hard physical labor, long periods of boredom and monotony, and general terrible living situations and quality of life. During training, Kratom gave me more focus. It gave me more drive, endurance, and motivation. When we were all bored, it wasnt as much of an issue to me because Kratom helped numb that feeling. When I was in the field or out training in the cold weather, heat, rain, or snow, it helped to numb that feeling of misery. All those hours spent standing by werent as bad. All the boring, monotonous days in garrison spent doing menial busywork became a little more interesting. Sometimes even fun. It helped me open up more to the other guys in my unit. I made friends with just about everyone and developed some very strong relationships during our shared hardships that nothing in my life will ever match again. \r\n\r\nI went from just doing what I needed to do to get by and finish my contract, to pushing myself to be better and better. My leadership noticed, and they approved. With the help of my immediate leadership, I was able to develop myself as a Soldier beyond what I ever thought was possible for me. I believe this was possible for me because Kratom allowed me to move past the afflictions drug abuse had left me with. It brought color to a gray, mundane existence and gave me something to hold onto. One of my squad leaders, before he left the Army, shook my hand and told me I did it. I had changed for the better. His eyes told me that this was a very emotional moment for him, one special to him, and that he hadnt expected me to come through the way I did. To this day, I wonder if he knew about my problems, if one of my friends I had confided in had told him of my choices in life and he watched me push through it and overcome it. Or, maybe he took great pride in playing a part in someones general improvement. I still dont know, but this man was the last person on Earth I had expected to shake hands with. This was the guy who was once constantly in my face, yelling obscenities at the top of his lungs and belittling me in front of my peers. The one making me do corrective physical training every single day, mocking me and telling me to die right now so he wouldnt have to deal with it later. At the very end, I had earned his respect.\r\n\r\nAs is always the case, my surroundings changed. Old leaders left, new leaders came. I myself came to the fork in the road where I needed to decide whether or not to stay in the Army and decided it was time for me to move on. I had married my girlfriend and began forming ideas of moving away, buying a house, getting a degree and a generous income and having children. My major, I decided, would be Computer Science and I enrolled in school. I bought a house in my home town and moved my new life there. I had achieved the end result I had in mind the moment I decided to get clean from drugs. I completed my service to my COUNTRY and its citizens, not my government. Now it was time to choose my own battles. Kratom aided me in getting my life back. It had provided a guide rail leading me to the real me and allowed me to grow more as a person, through the dark times of the aftermath of opiate addiction. \r\n\r\nNow that Im where I set out to be, I must decide if its time to leave Kratom behind, or if I intend to take it for the rest of my life. Though I havent gotten there yet, I feel more and more like its the former. Kratom was an invaluable tool, an asset to my life and who I am right now. I believe there is absolutely nothing wrong with it, aside from the mild addiction potential which, when compared with much stronger addictive substances Ive used, is very benign. Im in great shape and excellent health after taking it every day for two years. It hasnt had a single negative effect on my health and wellbeing. It has done nothing but great things for me, and I recommend it to absolutely everyone who has ever fought a battle with opiate addiction. Its a winnable battle, and Kratom is the best weapon you can use in your struggle. With that, I bid farewell with the hopes that someone, somewhere who is trapped in a hole, will find their way to this experience report and gain hope from my own experiences and results.\n\n\n\n\n\nExp Year: 2014ExpID: 104876\nGender: Male \nAge at time of experience: 23 \nPublished: Oct 15, 2015Views: 1,818\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}