{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t 130 mg\n\t\t oral\n\t\t Methallylescaline\n\t\t (powder / crystals)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   170 lb\n         \n\t\n\n\n\n\n[Erowid Note: \nThe doses described in this report are very high, beyond erowid's 'heavy' range, and could pose serious health risks or result in unwanted, extreme effects. Sometimes extremely high doses reported are errors rather than actual doses used.]\r\n\r\nSo I have plenty of experience with tripping and drugs in general. My history is extensive as I have been using drugs for over 10 years. I have tried a drug out of every major class. As far as psychedelics go, I have tried LSD, LSA, shrooms, 4-AcO-DMT, 4-HO-DET, 4-HO-MiPT, 4-HO-MET, allylescaline and methallylescaline. I had tried the methallylescaline one previous time at a dose of 70mg and got a mild trip. This was only 3 days after having previously tripped, which was my first mistake. The trip was very mild, so I thought I would be ok to up the dose. On this occasion, I did 130mg with much lower tolerance, having not used psychedelics in approximately a week and a half. Im aware that psychedelic doses do not scale linearly, I am also aware that there is very, very little information available about mescaline analogues, which is why I decided to submit this report. It is a cautionary tale. Learn from my stupidity so that you do not have to repeat my mistake.\r\n\r\nI had used a few drugs the week before the fateful night. I did low doses of dxm about twice the week before and had drank on Christmas and New Years. Hadnt smoked weed or done any other drugs in over a week before this.\r\nI got home from work on a Friday night and decided to dig into my stash of methallylescaline. \r\n\r\nI dosed 130mg, thinking I would be fine because 70mg was so mild. I began to do the dishes and noticed that things were getting wavy and I was getting nauseous after about 15 minutes. I knew I had done way too much, because it took almost 2 and a half hours for the methallylescaline to kick in the last time. Whatever, I thought, I had done heroic doses before of all of the 4-xx-tryptamine drugs, meaning doses in excess of 100mg and had been fine. I wasnt worried about my ability to keep myself together. \r\n\r\nAfter about 45 minutes of sitting on the couch trying to fight the nausea I had to throw up. There was very little in my stomach and the drug was dosed volumetrically dissolved in water, so it was rapidly absorbed. Despite puking, I continued to come up. I decided it would be a good idea to retreat to my bed because I was tripping extremely hard. Methallylescaline was not very visual the first time I took it, but at this dose I could barely see. Everything was awash with colors and shifting, sliding patterns. I have never done mescaline, but I cant imagine it being as intense as this was, I was tripping very hard.\r\n\r\nI could barely think straight, I was overwhelmed. I just settled down into my bed under some blankets and began watching the Simpsons. A nice, relaxing cartoon to help keep me calm. After 3 or 4 episodes, maybe 2 hours into the trip, I could not keep my eyes open. I closed them and instantly was transported to an inner world of colors and beings. I couldnt really see the beings, but I could sense them all around me. They were trying to show me that nothing really ends, that life is eternal and all things are reborn indefinitely. I am a chemist and a hardcore atheist and do not believe in life after death, but during the trip I was convinced that I was being shown the truth of the universe. I have never tripped this hard before. I would occasionally open my eyes and look around my room. It was very difficult to see through the visuals and I had to remind myself that I was just tripping, that none of it was real and that it would all be over eventually. Methallylescaline has a duration of ~18 hours though, so I knew I was in for a long ride.\r\n\r\nI dont know how long I was tripping for, but at some point I got up to pee and realized I couldnt. I figured I was just dehydrated, so I pounded down 32 oz (950 ml) of water and went back to bed. An hour or so later, I still didnt have to go, so I drank 32 oz (950 ml) more. After another 2 hours, I still didnt have to pee at all, and my bladder did not feel full, like I was in urinary retention. I began getting delusional and couldnt think straight. This was a different feeling than the effects of the methallylescaline. I could not keep a coherent train of thought, constantly forgot what I was doing and noticed that my face was extremely flushed. I began to get worried that there was something wrong with my kidneys. I pounded down another 32 oz (950 ml) of water and waited one more hour. When I still didnt have to go, I began to get really scared. I begged and pleaded to pee, prayed to a god I dont believe in to forgive me for my stupidity and to not let my kidneys fail. After another half hour, I resigned myself to my fate, that my kidneys were in trouble and that I would have to go to the hospital. The hospital in my town is about a 10 minute walk from my apartment, so I grabbed the bottle of the methallylescaline and began walking to the emergency room being in absolutely no condition to drive.\r\n\r\nUpon arriving at the hospital, I could not find the emergency room entrance, despite asking several nurses. Finally, a very nice Russian orderly led me in through a different entrance and took me to the emergency room. I showed the guy there what I had taken and explained what was going on. I was extremely scared, praying that my kidneys would be ok. As I was waiting, an Asian man came up and asked to see his mother. He said she was sick and his house had just burned down and he was homeless. He showed me pictures of the fire and began crying. I felt so bad for him that I gave him all of the money in my wallet, about $25 and told him that I was sorry for what happened to him. I figured maybe I could make the best out of a bad situation. He thanked me profusely and tried to get me to talk to his family, but I couldnt.\r\n\r\nI was admitted to the hospital, still tripping hard. As I lied on the bed the nurses started an IV and took some blood. They scanned my bladder and found out that it was empty. I was incredibly distraught, no urine in my bladder after all the water I drank meant my kidneys had produced no urine. Anuria was one of the worst signs of kidney failure. The nurses left me with the IV running and I lied on the bed, watching the wood grains dance on the door and the floral patterns on my hospital gown dance. My heart rate was over 120bpm and my blood pressure was 160/80. To my great relief, about 45 minutes after the IV, I could feel urine in my bladder. I called the nurse and told her I had to pee. She said that was a good sign and gave me a cup to pee into. I did and asked for water to drink. I pounded down several glasses of water and cranberry juice. The nurse started another IV and gave me a shot of Ativan to try to calm me down. The Ativan didnt really make me that tired due to the stimulating effects of the methallylescaline, but it did make me feel calm and pretty relaxed. It was also the only time in my life I had ever taken a benzo, so I guess I can scratch that off my list.\r\n\r\nI laid in bed for a while until the doctor called poison control and found out more about what to do. Poison control said that they had no instances of anyone taking this drug and that my case study would be the only recorded one on record. I guess its nice to contribute to medical science. The doctor wanted to wait for my heart rate to go down to normal. While I waited, they drew blood, gave me an EKG and let me sit there, bored out of my mind. About 10 hours after being admitted, the doctor finally saw me and asked me questions about why I had taken it and if I used other drugs or was an IV drug user. I told her the truth, that I had taken it and drugs like it before and that I smoked weed. I didnt tell her about anything else. All of the doctors and nurses were exceptionally kind and none of them seemed to be upset with me or acted judgementally towards me despite me being admitted to the hospital for drugs. The doctor eventually told me that all of my lab work came back fine. That I had normal chemistries, kidney, liver and heart function and that they were going to let me go. My heart rate was still at about 107 and I was still kinda chilled from the Ativan. I got my things, walked back to my apartment and went to bed, so, so grateful to be alive and to not have suffered any permanent damage. The doctor believed that the drug triggered an acute anticholinergic response that caused the delirium and stopped my kidneys from producing urine.\r\n\r\nWhen I got home, I threw away my allylescaline and methallylescaline. I kept the 500mg or so of 4-HO-DET I still had, because I have used it many times and know that it is safe. I do not intend to do any further experimentation with RC drugs for at least another 6 months and I have decided that I am only going to smoke weed and occasionally take Adderall and phenibut. I decided to submit this report so that nobody else will have to go through what I did. Believe me, lying in a hospital bed tripping your nuts off while wondering how youre going to explain to your family, friends, coworkers and boss why your kidneys dont work is an unimaginable nightmare. If I hadnt had so much experience keeping my cool while on drugs, I would have undoubtedly lost it. Do not try this at home kids.\n\n\n\n\n\nExp Year: 2014ExpID: 105249\nGender: Male \nAge at time of experience: 25 \nPublished: Jan 4, 2015Views: 4,567\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}