{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t 45 mg\n\t\t oral\n\t\t Methallylescaline\n\t\t (powder / crystals)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   170 lb\n         \n\t\n\n\n\n\nI first head of Methallylescaline, or MAL, and similar Mescaline analogues online and how relatively rare and unpopular they were. I further read a few experiences and was interested in giving the substance a try. I had prior experience with a few other psychedelics and entheogens such as LSD, MDMA, Psilocybin, and one research chemical, 2C-I. I used these very infrequently (about 4-5 times a year at most) so there was no tolerance or strong familiarity with tripping or rolling.\r\n\r\nI began with setting my whole day aside, as I heard the duration averages around 12-16 hours at the 40-60 mg range. I had breakfast and then had sudden unexpected company until the afternoon. At this point, I decided to have a soup, so that my stomach wouldnt be entirely empty. I was planning on spending the day at home with my S.O. , G, just relaxing and enjoying my day off work. Plus, if something went downhill, she would be there for me. I usually feel safe and calm in her presence.\r\n\r\nI dosed at 3:30 pm and began a log of the events that took place, partially on my computer and on my phone. However, Im going to just explain everything directly while including an occasional timestamp.\r\n\r\nT (- 0:00) 15:30 \r\nI took 45mg of MAL powder orally in a small clear capsule, drank some ginger lemon tea to help against nausea which I had read about. I was mainly just sitting inside my room with G as it was way too hot outside for a walk or ride on the longboard (typical Summer weather in Texas).\r\n\r\nT (+ 0:32) 16:02 \r\nI began to feel the first effects, beginning with a very slight stimulation. It may have been placebo, but it just came suddenly.\r\n\r\nT (+ 0:54) 16:24 \r\nI was just talking to G about something when she mentioned going to the soccer field at our school to play soccer with her friend A. I got excited about the idea and suddenly felt a body high sneaking along. This I can say for sure was the first effect I felt. It was strange, as it was just a very light feeling. It reminded me a little of the coming up uplifting feeling on an entactogen like MDMA, but still a bit distant as it didnt come with the emotional change. I also felt an unease in my stomach at the same time.\r\n\r\nT (+ 1:09) 16:39 \r\nI noticed a slight change in vision. Its very bright outside and the light shining inside my house seems to look a bit more intense than usual. Moments of slight nausea occur periodically, but they dont bother me as I just feel great with the light body high that has settle in by now.\r\n\r\nT (+ 2:11) 17:41 \r\nI went downstairs to get water from the kitchen and my S.O. dropped a plate on the counter and I jumped back in shock, it seemed excessively loud to me, although she said it wasnt particularly loud. She laughed as she knew I had begun tripping. \r\n\r\nAt this point, she wanted to pick up her friend so they could ride their bikes to our school and play soccer on the field, we only had my moms car available and she never had driven it before. I felt a bit uneasy about letting her drive, but eventually agreed as she was a good driver. I got my sunglasses to cover my now significantly dilated pupils in case we would come across her friends parents.\r\n\t\r\nT (+ 3:01) 18:31 \r\nDuring the entire drive, I was making sure everything was going alright and that G was driving well, as I felt we were going to fast sometimes (which was silly, she was driving perfectly). It was nevertheless a very intense drive. As we got closer to her friends house, I calmed down and looked outside at the sky and the surroundings. A huge storm cell was developing in the distance and the afternoon sun illuminated the entire cloud from behind. Shades of bright yellow transitioned into the deep shades of blue within the clouds, with all the colors in between. Simply put, it looked just purely amazing. \r\n\r\nWe got to As house and she came outside with her bike. I was about to come lift it up and put it into the trunk when her dad came outside and wanted to help. I became a bit nervous but just greeted him friendly and told him I already managed to somehow wedge it inside the small trunk.\r\n\r\nWe got home, and I felt I was still coming up (slowly but surely). I rode my bike with them for a bit but eventually said I wanted to stay home for a bit as riding by the busy road on the way would make me nervous. I got home and laid down outside in my back yard. \r\n\r\nT (+ 4:13) 19:43 \r\nNow lying motionless outside in the grass, I felt myself sink into my trip as I paid more close attention to what was around me. My house is situated near the water and I can see decently far from the backyard. The storm cell had progressed forward and the sun was barely reaching out its final beams past the wake of the clouds. It was very windy up there as the clouds zoomed over me but it remained silent down where I was laying. I felt amazing, being able to witness this dynamic and powerful force of nature right in front of me. The stimulating body high I still felt seemed to make me even more engulfed in the whole moment. It was beautiful.\r\n\r\nT (+ 4:50) 20:20 \r\nMy friend K called and wanted to pick me up to go to friend Ps house. I felt I had reached a plateau in my trip and decided to hang out with them. I asked A & G if they wanted to meet us there (we all were friends).\r\nOnce K arrived, I waited to see how long I could last without him noticing I was tripping. It didnt come up once in conversation until I asked him, to which he said he knew immediately because of the slight grin I had on my face the whole time (didnt even know I was grinning).\r\n\r\nT (+ 5:00) 20:30? \r\nWe arrived at Ps house and wondered why there was a single unidentified car in the driveway. We were about to walk inside (as P told us he was home and wasnt answering the door, he usually asks us to come inside) until we realized they were selling their house and they currently had people touring the house. We quickly went back into Ks car knowing that two strangers, one with huge pupils and acting strangely, would have just walked in on potential buyers of our friends house. \r\n\r\nAnyways, we waited for P to actually get home and told him of the story and laughed it off. I had to severely use the restroom at this point (I had been using the restroom frequently since I first dosed) and decided to look in the mirror on my way out. Similar to LSD, my face began to age and change expressions. However, after a while, my face stopped changed and permanently had become a sort of different version of me. Once I shifted my eyes, it returned back to its normal appearance until I again started to focus only on one point, where it would again age and change expression. I spent a good 15 minutes in the restroom until K & P became worried that something bad happened. I came back out and assured them that I was just having fun staring at my face.\r\n\r\nWe then went to his park to smoke a few Js with his lady friend C. I didnt want to smoke as I just wanted to experience purely the MAL. The storm cell was still present in the distance, giving a clear view of all the lightning that struck every few seconds. The moon shone behind the clouds and gave a similar illumination as the sun had earlier that day. Another great coincidence that just matched perfectly with my state of non-sobriety. \r\n\r\nT (+ 7:30) 23:00 \r\nK gave me a ride home, I was happy to see G who was almost asleep from riding her bike to As house and back. I still felt comfortably stimulated and just laid next to her for a bit before she fell asleep. \r\n\r\nT (+ 10:10) 1:40 \r\nThe visual distortions had subsided, but the light feeling still remained. I could have gone to sleep but I wanted to listen to some music shortly before I did. It fit well at the moment, as it was a sort of conclusion to my day.\r\n\r\nT (+ 10:30) 2:00\r\nI decided to go to sleep. The stimulation was almost gone at this point and I just felt relaxed and calm. I fell asleep immediately and woke up well rested. No hangover or after effects, just a sort of good feeling from having such a nice day yesterday.\r\n\r\n\r\nOverall, I had a very good impression from MAL. It was very mellow in terms of stimulation and not nearly as intense of the mindfuck headspace that LSD gives. This made the duration enjoyable as well, as going through 12 hours of tripping would normally be very exhausting. However, I still felt that my attention was directed towards the experience as the more I focused on my surroundings, the more prominent the effects became. \r\n\r\nI will likely try it again at a higher dose and at a time where I can explore the outdoors more. I think its a great substance, especially if they whole day is unoccupied and free of responsibilities.\n\n\n\n\n\nExp Year: 2014ExpID: 105275\nGender: Male \nAge at time of experience: 19 \nPublished: May 2, 2015Views: 1,685\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n",
  "doses": [
    "45 mg oral Methallylescaline (powder / crystals)"
  ]
}