{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t 1 hit\n\t\t oral\n\t\t DOPR\n\t\t (blotter / tab)\n\t\t\n\t\t\n\t\t   T+ 3:30\n\t\t 1 hit\n\t\t oral\n\t\t DOPR\n\t\t (blotter / tab)\n\t\t\n\t\t\n\t\t   T+ 6:00\n\t\t 2 hits\n\t\t inhaled\n\t\t Inhalants - Nitrites\n\t\t  \n\t\t\n\t\t\n\t\t   T+ 7:30\n\t\t   \n\t\t smoked\n\t\t Cannabis\n\t\t  \n\t\t\n\t\t\n\t\t   T+ 11:30\n\t\t 1 \n\t\t smoked\n\t\t Tobacco - Cigarettes\n\t\t  \n\t\t\n\t\t\n\t\t   T+ 15:00\n\t\t   \n\t\t oral\n\t\t Vitamins / Supplements\n\t\t  \n\t\t\n\t\t\n\t\t   T+ 17:00\n\t\t   \n\t\t oral\n\t\t Alcohol - Beer/Wine\n\t\t  \n\t\t\n\t\t\n\t\t   T+ 17:15\n\t\t 2.5 mg\n\t\t oral\n\t\t Pharms - Alprazolam\n\t\t  \n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   55 kg\n         \n\t\n\n\n\n\nFirst sorry for my poor English because it's not my primary language. So I received 5 blotters of DOPr, it's a very rare and novel psychedelic with a long duration. My psychedelic experiences includes LSD, DOM, MDMA, 2C-E, 2C-B, 2C-D, 2C-C, 4-Ho-MET, AL-LAD and 4-ACO-DMT.\r\n\r\nThe DOPr is active at 2mg up to 5mg for a very strong trip. I decide to go deep and I took 1 blotter of DOPr at 06 PM. I'm alone at home and waiting for a friend before going to a Tekno/Psy-trance party.\r\n\r\nNotes: The DOPr's taste is very bitter almost sour like a candy and taste like old medicine.\r\nMethod of ingestion: Swallowed\r\nSubject: 24 years old female - Smoker (not heavily) good health - Anxiety disorder (prone to panic attacks)\r\n\r\n06:00 PM: Swallowed the blotter, bitter/sour taste noted.\r\n\r\n+ 00:30: Nothing - Listening to music, I'm anxiously waiting for the effects.\r\n\r\n+ 01:00: It's been an hour now, still nothing, maybe feeling a bit more alert, could be placebo. Feeling nothing at all.\r\n\r\n+ 01:30: My friend just arrived at my home. I told him I took a blotter of DOPr, he's curious about it. Friends decided to take half a blotter.\r\n\r\n+ 02:00: I'm going to my bathroom to change my clothes for the party. Now there is a slight increase of body temperature and some butterflies in the stomach (maybe nervousness?).\r\n\r\n+ 02:15: I'm back in the living room, I now feel more alert, a slight +1 on the Shulgin scale. Onset is very slow and act like a creeper. I can feel I'm not baseline now. Friend report nothing.\r\n\r\n+ 02:30: I feel a amphetamine-like effect, I'm now more alert and joyful, the setting begin to feel 'funny', although I don't have any precise visuals. The room just feel 'weird' by now.\r\n\r\n+ 03:00: We leave home and we're walking to the party. This is a weird yet fascinating chemical, It feel like I have some retrograde amnesia, I don't know how to explain but it feels like I'm sleeping and sometimes wide-awake at the same time, never feel this sensation before. This chemical make me awake in a very weird manner, remind of Methoxetamine for some reasons. \r\nMy friend start to feel the blotter as well and report relentless. I'm on + (and half) on the Shulgin scale. The environment feel very funny by now, the visuals remind me of mushrooms or some indole compounds although DOPr is a phenethylamine.\r\n\r\n+ 03:30: We are now at the party's entrance. I don't know why but I have a good feeling about it and I took another blotter (+2.5mg), now I have 5 mg of a very powerful psychedelic in my brain. My friend start to feel anxious and he ask me how long it will last. I replied: I don't know Matt, I don't know... Extreme bitter tast again, unpleasant !\r\n\r\n+ 03:15: We managed to enter the party and we're heading to the bar. I ordered 2 Coca-Cola for me and my friend. This chemical have a great ability to uplift your mood, I feel plain happy and content to live this moment, on a side note, the visuals are somewhat stronger (++). The ceiling is swirling and the colors were mainly pink and purple.\r\n\r\n+ 03:30: We're heading back to the music with my friends, I can feel a definite euphoria which make me smile, looking at others people smiling and feeling great, music appreciation is better.\r\n\r\n+ 05:00: Dancing for like 2 hours straight, sweating a lot - Trip much stronger than before, feel like my body is floating for some obvious reasons. A feeling of being awake and sleepy at the same time is felt again. Really euphoric and trippy for the moment. Looking at the subwoofer make me see the 'bass' pulsating from the music, impressive stuff ! Friend report nervousness and anxiety, aggressive visuals for him. I gave him Xanax 2mg.\r\n\r\n+ 06:00: Some friends come to the party as well, one of them offers me Poppers. I inhale from each nostrils. Within second, visuals are WAY stronger, almost overwhelming. I had some overwhelming euphoria as well, teeth are somewhat grinding unlike MDMA, much more like pure amphetamines.\r\n\r\n+ 06:10: Music feel really GOOD for some reasons, I can see and feel every details of the sound. My vision is also very clear, like crystal full HD 1080P. Strong visuals, watching the ceiling doing fireworks. I see like tracers on the ceiling moving very fast and at the same beat with the music BPM. Friend feel more relaxed and he's enjoying himself dancing to the music.\r\n\r\n+ 07:00: Still dancing to some Psychedelic music, I feel one consciousness with the people in the room, like everyone are connected on the same vibe. The trip is also now more 'speedier', slight increase in heart-rate, no anxiety. Vasoconstriction is also minimal. I inhale some Poppers again... Immediate effects felt, euphoria is increasing a lot and leave me in a very joyful state. Visuals are getting stronger again, to the point I had to sit on a chair and drink some water.\r\n\r\n+ 07:30: We smoke a joint outside, some minutes after smoking it I can hear a 'buzzing' noise in my ears, a bit unpleasant but the feeling stopped after 10 - 15 minutes. The weed only increase the bodyload. Nice synergy.\r\n\r\n+ 08:00: Friends took the remaining half of the blotter, he feel confident and told me the visuals are incredible and lovely.\r\n\r\n+ 09:00: Still dancing to Bitkit a psytrance artist. It feel orgasmic, I'm seeing very strong tracers when people dance! Huge smile on my face, the 'speedy' buzz is also very nice and make me dance like crazy, enjoying myself a lot. \r\n\r\n+ 11:00: The party come to an end, I'm still on a +++ on the Shulgin scale, we decided going home because the effects are now to strong to handle in the club. My body feel like floating above the ground. While heading back at my home, I see some kind of snakes and fractals on the ground which follows me during the entire path. My friend hurry up to go home because it says it become a bit overwhelming for him.\r\n\r\n+ 11:20: We're now at home, I put some minimal music and we both agree to lie down in bed. Closing my eyes give strong CEV, floating bubbles and multitude swirling of colors and shape. For some reason I feel nostalgic and I have vivid dreams of me and my mother walking our dog in the park. I feel very emotional and content about my actual life!\r\n\r\n+ 11:30: I want to smoke a cigarette, while lighting up my cigarette, the fire from my lighter is fluorescent and seems to evaporate in the air. I feel confused. This is an heavy psychedelic, not for the beginner. My room is warping and change in shape. Look like some dissociative now, very weird.\r\n\r\n+ 11:40: I had to lie down again, visuals are insanely overwhelming. I see Aztec symbol on the ground. There is also some eyes and mouthes popping on the ground, I feel like being in the 70's. My friend still have visuals and report how beautiful they are.\r\n\r\n+ 12:00: We ate some sandwiches with cheese. It taste a LOT, I enjoy eating it. Smell is increased as well! I'm loving each single moment eating this sandwich.\r\n\r\n+ 12:15: I'm lying in my bed again, my thoughts are racing so fast. I feel like my body is floating! I'm seeing myself floating above my corpse. I lost track of time.. I have vivid memories of me when I was young, the trip want me to see my life from the beginning. I feel emotional again. Friends want to go outside to smoke a cigarette, he's content and joyful.\r\n\r\n+ 13:00: For obvious reasons I woke up confused. I still feel like I'm sleeping in my bed while fully awake, some kind of amnesic effects are felt again! This is the first drug which gave me this sensation. It's fascinating and yet terrifying at the same time. I open my laptop and we both agree to watch American Dad (a cartoon).\r\n\r\n+ 14:00: It's been an hour since we're watching the cartoon. Visuals are very intriguing, they are now 'metallic' and fake. The colors of my room have changed with some pink hues. My walls are breathing and melting, extremely beautiful to look at !\r\n\r\n+ 14:30: Now the trip start to be less intense, I'm on a ++ on the Shulgin scale. The body buzz decrease a bit, visuals are still presents. I have a lot of imagination, I'm doing some painting and starring at my paper make me see fractals and Aztec-like visuals aka Mushrooms visuals.\r\n\r\n+ 15:00: Stopped painting, I feel a exhausted. We consumed 500mg Magnesium and some Vitamin C. Water is drank again! Euphoria still strong, we are hugging, it make me cry of joy. Very emotional compound! I like it \r\n\r\n+ 15:00: Friend suggest to watch a movie. We watched Las Vegas Parano\r\n\r\n+ 15:20: The movie make both of us uncomfortable, feeling are amplified. We stopped watching it.\r\n\r\n+ 16:00: Craving for a cigarette again, now it feel disgusting at some point. Effects start to tie down.\r\n\r\n+ 16:15: I'm outside watching the sky, very bright and vivid colors, stars in the sky are glowing strongly.\r\n\r\n+ 16:40: Looking at the sky for like an eternity it seems, I'm now back at home but I still feel like I'm outside watching the sky, 'amnesia' like effects felt again.\r\n\r\n+ 17:00: Feeling tired, visuals are now on a +/1.5. I drank a strong beer with my friend, doesn't seems to synergyse.\r\n\r\n+ 17:15: Ate 2.5mg of Alprazolam. Going to bed, I fall asleep with vivid dreams and slight CEV by now. - Sleeping -\r\n\r\n+ 22:00: Woke up feeling fine, although a bit cloudy. No side effects noted! I still feel euphoric. No more visuals effects, seems to be baseline. A cup of coffee is drank. Friend still sleeping.\r\n\r\nConclusion: A very intriguing substance, super joyful but long lasting. Be sure to have time ahead before taking it. The onset is very slow, so don't re-drop fast. I would feel that more than 5mg will be pretty much impossible to handle. Wouldn't go above 5mg myself. It was already too much for me at that level. I should have take only 1 blotter instead.\r\n\r\nThis is probably the BEST psychedelic I have tried, they are no vasoconstriction or alarming heart beat like the other DOx compound. Feel very benign (just a personal opinion ofc), although I won't suggest this substance for the beginner. I could easily see someone have a bad time on it.\r\n\r\nI'm very happy that I tried this compound, it was a glowing experience and I'm eager to try it again in the future.\n\n\n\n\n\nExp Year: 2014ExpID: 105317\nGender: Female \nAge at time of experience: 24 \nPublished: Jul 22, 2015Views: 550\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}