{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t 8 g\n\t\t oral\n\t\t Tabernanthe iboga\n\t\t (rootbark)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   86 kg\n         \n\t\n\n\n\n\nAfter some experiences with LSD and MDMA I was interested in trying out a different psychedelic. Besides, my alcohol consumption sometimes goes out of hand and Iboga has a reputation for un-learning addictions. Self-exploration and resolving personal issues were also a goal of the trip. I had a mild LSD experience a month before the session and I am not sure if that had any influence on the effects.\r\n\r\nThe session took place at a provider's house with 10 participants in total. I've been told in an email that I should not eat anything on the day of the ceremony but I didn't remember that while traveling to the place. This might have dampened the experience additionally. We were given a test dose of Iboga root bark powder in a ceremonial setting around 9 pm, I had the impression that I am chewing on very bitter dry and sandy soil. Everybody was lying down on their own small bed with eyeshades. After not having any adverse reactions after 30 minutes another dose of powder was given. My body was rebelling a bit but I forced it down. Three more servings were supplied as capsules throughout the night. The total dose might have been around 8 grams of root bark powder but there is no way to tell.\r\n\r\nThe first effects were slight dizziness and a certain calmness. I became slightly impatient and noticed that I questioned myself when the trip was about to start. Then I noticed that this wasn't a usual inner monologue but a voice that could be me talking to another voice in my mind. Shortly after that realization LSD-like visuals formed but with more black in the background. The visuals changed into more concrete images of flying mushrooms (like hot air balloons) and surreal landscapes. That phase ended after a while and made room for a time of blackness with many questions forming in my mind and distorted voices offered to take care of my mind and return it in an improved form. This had absolutely no frightening component (like everything before) so why should I object? \r\n\r\nAnother key phase was a constant, photorealistic stream of things that I have seen and experienced throughout my life. First completely harmless to mildly irritating to (in a non-trip-state) painful early memories. But again, nothing was really frightening. However, I shied away from some things before seeing them clearly, Iboga really dictates a speed that is not overwhelming. Things changed a bit and I wandered through a dark and lorn landscape with growling beneath some areas of the ground. I wanted to investigate the threat but I was told (by the voice of iboga) that I am not ready to see those daemons. So be it, this is obviously better than being overwhelmed. \r\n\r\nIn general phases of blackness, abstract psychedelic patterns, streams of memories and surrreal explorations alternated at least three or four times. In the exploration phases I dived through painful memories and imaginations just to notice that I am unable to experience psychological pain in this state and thus maybe come to peace with them. \r\n\r\nObviously the phases became shorter and weaker over time. I do not remember sleeping, just being in a state of absolute calmness in a space of absolute blackness. \r\n\r\nThroughout the entire experience I never felt frightened or overwhelmed and subjectively found it to be a mild drug in the experience and was even disappointed at some points. Obviously this changed when I reviewed the experience from a sober reality.  Everything just happens with eyes closed, once they are open I was back in reality, just a bit dizzy. \r\n\r\nThe next day was grueling, I had no interest in food and just drank tiny amounts of water. Still being in that state of calm blackness most of the time I passed the day in bed. Some sleep came the next night but in general my ability to sleep for extended periods was impaired for two more days. \r\n\r\nAppetite and sleep came back with time and I have the feeling that the processing of memories is still active on an unconscious level. Alcohol and weed still are of no interest almost a week after the experience. Sometimes I have the feeling of being much closer to reality for a few moments than I have been before and the chattering mind is not as active as before. This seems to be a good starting point to deepen my meditation practice. I have read that the metabolites of Ibogaine stay in your system for some months so I guess that the effects will be with me for a while. \r\n\r\nConclusion: The body load is huge and the effects were subjectively not as impressive as LSD but the healing potential seems to be reasonable. Due to its mild pace a trip sitter is not really necessary IMO but nice to have due to the weakness of the body for bringing fresh water and helping on the way to the toilet. Having a bucket handy definitely is a good idea.\n\n\n\n\n\nExp Year: 2015ExpID: 105308\nGender: Male \nAge at time of experience: 33 \nPublished: Nov 13, 2015Views: 834\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}