{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t 60 mg\n\t\t oral\n\t\t 5-MAPB\n\t\t (powder / crystals)\n\t\t\n\t\t\n\t\t   T+ 0:30\n\t\t 20 mg\n\t\t oral\n\t\t 5-MAPB\n\t\t (powder / crystals)\n\t\t\n\t\t\n\t\t   T+ 4:00\n\t\t 1 mg\n\t\t oral\n\t\t Etizolam\n\t\t (pill / tablet)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   115 lb\n         \n\t\n\n\n\n\nThis was my first experience with 5-MAPB, and I am overall very pleased. I've had 3 experiences with MDMA prior, so much of this report will be drawing comparisons between the two (as well as a few other substances). I have found with MDMA that I get the most out of my experience by re-dosing early into the roll, so I will report my experience with re-dosing on 5-MAPB as well. I'll also be including some information about my boyfriend, T, and how our experiences compared based on the differences in timing, additional substances, dosage, and other factors.\r\n\r\n(Note: As this report focuses on my experience with 5-MAPB, [T +0:00] will mark my consuming of the bulk of the substance. Other substances and doses taken beforehand will be labeled as [T -].)\r\n\r\n[T -34.00] The Test: The day before our scheduled roll (I call it a roll because it is similar enough to rolling on MDMA and I don't know of a better term), T and I each take 10mg of powdered 5-MAPB orally at around 12:00pm. This is our first experience with 5-MAPB. The taste is awful and bitter, probably the worst substance I've tasted and I'm someone who is generally not bothered by weird tastes. We both agree that our tongues feel slightly strange, almost numb. As we wait for any notable effects, we weigh out 4 doses of 80mg each into 4 gel capsules for the next night, as we had expected two friends to join us. After about 30 minutes I have a noticeable change in perception and a sort of nervous energy. I'm prone to anxiety, and while the feeling isn't unbearable, it's enough to make me uncomfortable. Luckily I have Etizolam saved for the real occasion. This anxiousness lasts for about 90 minutes before I'm suddenly hit with a wave of calm. It's nothing akin to MDMA, but I didn't expect it to be at such a low dose. I found it to be similar to a very subtle opiate high, but with a clearer mind. (However, I would not suggest trying to use 5-MAPB as a substitute for opiates.) I feel happy and free of my usual worries. This feeling of serenity lasts for around 4 hours before gently fading. I don't have any trouble falling asleep that night.\r\n\r\nThe Experience (The Following Day)\r\n\r\n[T -3:00] T and I eat before driving to the home of some friends who live nearby. It's 7:30 pm when we arrive and I take .5mg of Etizolam in pill form before we go inside. Our friends have decided not to join us in taking the 5-MAPB, so T and I make plans to return to my house early so we can begin our night. I chose to take the Etizolam a few hours prior to the 5-MAPB because I wasn't sure how it would impact the roll (more on this in The Conclusion with T).\r\n\r\n[T +0:00] We arrive at my house at 10:30pm and immediately get to work. It's now been three hours since my dose of Etizolam. Out of my capsule of 80mg powdered 5-MAPB I pour and measure out 60mg, which I then take orally. I place the remaining 20mg back into the gel capsule to save for later. I've found that I tend to get the longest and best experiences out of rolling by re-dosing with a small amount during or at the end of my come up phase. T removes all 80mg from his capsule and takes it orally. He settles in as I clean up (I like to make my room as comfortable as possible for experiences like this).\r\n\r\n[T +0:30] At this time I take the remaining 20mg orally before swallowing the empty capsule (just a tradition of mine). I struggle not to vomit because of the awful taste, but it fades quickly. I'm surprised to find myself well into my come up after such a short period of time, but it may be related to how active I've been in cleaning my room. The anxiety I felt from my test dose is absent thanks to the Etizolam. I'm experiencing a notable shift in perception and the beginnings of the visuals one has on an average dose of MDMA. There's a sort of brightened appearance to everything, like everything is shimmering with an inner light, and I feel imbued with energy and excitement.\r\n\r\n[T +1:00] Suddenly the mounting excitement bursts into waves of pleasure. Similar to MDMA, the transition between the come up and the peak is very sudden. I'm overwhelmed by how good I feel. I'm eager to talk about anything and everything that comes to mind. My mood and self-confidence are lifted significantly. I'm feeling slight touches all over my body, almost tingles but not quite that palpable. It's definitely a welcome sensation. My appreciation of music is slightly heightened, but not nearly to the same extent that I find with MDMA. I also have no desire to jump up and move around or dance. I'm content to lie in bed and enjoy the sensation. I'm experiencing some bruxism, but it's no where near the tension that comes with MDMA or LSD. This is surprising as I tend to clench my jaw even when sober. T and I are speaking to one another non-stop about our interests, ideas, opinions, everything. We both have opened up emotionally and feel a special connection beyond what we already have.\r\n\r\n[T +1:30] I begin to feel a bit of anxiousness, perhaps due to the 20mg re-dose kicking in. I don't say anything to T, but I become noticeably quiet as my anxiety mounts. Thankfully it fades within ~5 minutes and suddenly I'm thrust into an almost overwhelming amount of mental stimulation. It becomes a struggle to focus- I forget what I'm talking about mid-sentence and I can't focus my eyes on any one thing which quickly turns into nystagmus. I recognize it to be similar to an experience of taking 2.5 mg [sic] of MDMA and that I probably have gone a bit overboard in terms of my dose. I don't feel any negativity at all, and the fantastic mood and bodily sensations continue, but I wouldn't want to be like this in any place where I need to have my wits about me. The fun conversation continues, and playing with my cat is extremely entertaining for the both of us.\r\n\r\n[T +2:30] By now I've backed off a bit from the intense peak of my roll and have floated back down to a very comfortable pleasure of the body and mind. T and I engage in intimate relations. It's especially gentle and passionate and we feel very close to one another. T enjoys himself and doesn't experience any of the impotence that I've heard is an issue with some substances such as this. Despite this, he doesn't feel as though he's approaching climax. Unfortunately the sensation becomes too overwhelmingly stimulating for me after a while and we stop.\r\n\r\n[T +3:00] The warm, pleasant buzz that was filling my brain is suddenly silenced and I realize that I'm coming down. I'm a little bit saddened by this, but it doesn't feel like a result of low-serotonin blues that I've experienced with MDMA- I'm simply sad to see such a great night come to an end. T reports that he's feeling extremely tired and has come down significantly. He's noticeably less talkative and seems a bit down.\r\n\r\n[T+4:00] A bit of the anxiety returns as the 5-MAPB fades away, so I decide to take a 1mg pill of Etizolam to hopefully ease myself through the come down and into sleep. It's now 2am and T has fallen asleep. The etizolam kicks in after ~15 minutes and comforts me, but not enough to make me tired. For some reason at this point I had a huge burst of creativity and found myself longing to paint. I play World of Warcraft while I wait for sleep to take me. I find the colours and scenery pleasant, but I'm having trouble focusing my eyes on my character in the center of the screen because the nystagmus has returned stronger than ever. At this point I had to pee every 15 minutes or so, but I had consumed a decent amount of water throughout the night.\r\n\r\n[T+8:00] At 6am I finally feel tired enough to put my laptop away and get into bed. I toss and turn for a bit before very suddenly falling into a dreamless sleep.\r\n\r\n[T+2:00] The Morning After: T and I wake up at noon. I feel groggy and definitely can still sense the chemicals in my system, but I'm surprisingly alert and in a rather positive mood. I still feel some residual empathy and happiness. This fuzzy-headedness lasts throughout the day, with only a slight decrease in mood. It's not as severe as the low-serotonin sadness I experience with MDMA hangovers, but later in the night I feel a bit emotionless and have an overwhelming desire to take more.\r\n\r\nConclusion: Overall, I'm extremely impressed. 5-MAPB is, in my opinion, comparable if not preferable to MDMA. I definitely will be using it for fun nights in, and perhaps combine it with 4-FA for experiences at music festivals or concerts where I want to have more energy. I feel as though 80mg was a bit excessive for someone of my size and with my lack of experience, and that I would have been comfortable with a 70mg or even 60mg dose. I'm also a bit disappointed that the duration of my experience was so short. I hope to play around with dosages more and find a way to have a comfortable, long-lasting roll. I may try taking one full dose instead of my usual re-dosing, just to compare the two. I'm incredibly eager to dive into it again.\r\nT reports that 80mg was not enough to get him where he'd like to be. There are several factors that could contribute to this, so take my speculation with a grain of salt. Firstly, T is much larger than I am, although I don't know if body weight has any impact. T also consumed food and his .5mg of Etizolam within 30 minutes prior to our dosing, the latter of which I believe may have inhibited his experience somewhat. He will be upping his dose in the future.\n\n\n\n\n\nExp Year: 2015ExpID: 105404\nGender: Female \nAge at time of experience: 20 \nPublished: Mar 31, 2015Views: 4,367\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n",
  "doses": [
    "T+ 0:00 60 mg oral 5-MAPB (powder / crystals)",
    "T+ 0:30 20 mg oral 5-MAPB (powder / crystals)",
    "T+ 4:00 1 mg oral Etizolam (pill / tablet)"
  ]
}