{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t 5 mg\n\t\t oral\n\t\t 3F-Phenmetrazine\n\t\t (powder / crystals)\n\t\t\n\t\t\n\t\t   T+ 0:00\n\t\t 25 mg\n\t\t oral\n\t\t 3F-Phenmetrazine\n\t\t (capsule)\n\t\t\n\t\t\n\t\t   T+ 1:45\n\t\t 47 mg\n\t\t oral\n\t\t 3F-Phenmetrazine\n\t\t (capsule)\n\t\t\n\t\t\n\t\t   T+ 2:30\n\t\t   \n\t\t smoked\n\t\t Tobacco\n\t\t  \n\t\t\n\t\t\n\t\t   T+ 3:30\n\t\t 50 mg\n\t\t oral\n\t\t 3F-Phenmetrazine\n\t\t  \n\t\t\n\t\t\n\t\t   T+ 7:37\n\t\t 1 mg\n\t\t oral\n\t\t Etizolam\n\t\t  \n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   57 kg\n         \n\t\n\n\n\n\nToday I received a 1 gram sample of 3-Fluorophenmetrazine (3-FPM), and I have been pleasantly surprised by its clean, stimulating effects, and euphoria noticed with a high dose. The onset is very fast compared to other stimulants (approx 20 minutes orally). The stimulant is highly functional, with moderate effects being noticed with doses as low as 25mg.\r\n\r\nAppearance is of fine white crystals, quite similar to that of Ketamine, but finer.\r\n\r\nI have a slight tolerance to stimulants, having used substances such as MDMA quite regularly in the months leading up to the experiences. After reading about strong stinging from insufflating, I decided to take the oral route. Anticipating potential jaw clenching I take a 500mg magnesium tablet the morning before the experience.\r\n\r\nI weighed out 5mg as an allergy test which I placed on my tongue.\r\n4 hours passed with no bad reactions noticed.\r\n\r\n21:45 - I swallow 25mg in a gel capsule. At this point I am in my kitchen enjoying conversation with my house mate.\r\n\r\n22:05 - First effects noticed. Feeling very alert and awake. Very clean stimulation, with no euphoria or cloudiness as of yet. Slight rush as coming up.\r\n\r\n22:14 - Confidence is noticeably increased and I have become much more talkative. Heart rate seems normal, and no changes to pupils.\r\n\r\n22:47 - First signs of coming down. Very smooth, and still feeling an increased mood. Very different to other stimulants that can have frustrating comedowns. No strong desire to re-dose as of yet.\r\n\r\n23:20 - Noticeable effects have now decreased significantly, but not unpleasantly so. Still more alert than normal.\r\n\r\n23:30 - I swallow 47mg in a gel capsule. Just leaving for a local club now.\r\n\r\n23:51 - Now in the club. Starting to kick in powerfully but pleasantly. Increased energy and large mood lift similar to that of the lower dosage but more pronounced.\r\n\r\n00:13 - Euphoria is now present at this dosage. Not overwhelming but gives a very enjoyable edge. Feeling very alert and strong desire to dance, even though the dance floor is quite sparse. My normal anxiety has now all but vanished.\r\n\r\n00:49 - Lights seem brighter and my eyes are drawn to them. Moderate euphoria at this stage. The club is now a lot busier, and somehow managed to get friendly with the DJ so choosing a lot of the music.\r\n\r\n01:12 - Out for a smoke and my extremities seem particularly cold. The nicotine adds another pleasant dimension to the feelings experiences. Dehydration is noticed, although could be a result of dancing.\r\n\r\n02:05 - Still feeling the mood lift, but my body feels sapped of energy. I take a break and sit down for 5-10 minutes.\r\n\r\n02:15 - I re-dose orally with 50mg. Without an extra kick I'd probably struggle to dance and enjoy myself at this stage from lack of energy.\r\n\r\n02:30 - Back in the zone. Feeling great with another huge kick of energy. Very slight jaw clenching noticed which may have been stronger if I hadn't have prepared with a magnesium tablet the morning before the roll.\r\n\r\n03:45 - My house-mate and I are among the last few left in the nightclub, still enjoying ourselves. I have opted for chewing gum because of the jaw clenching. Euphoria and alertness still present.\r\n\r\n04:00 - I get a taxi home. No desire yet to sleep. I have a conversation with my house-mate (now that we're away from loud music) and notice empathy not dissimilar from MDMA but slightly weaker.\r\n\r\n05:22 - Finally decide to go to bed. My house-mate is tired, and my body feels exhausted but my mind isn't really ready to sleep. At this point I take 1mg of Etizolam to help myself sleep.\r\n\r\n06:05 - Sleep seems impossible, and noticing some uncomfortable vasoconstriction, signature of amphetamines.\r\n\r\n09:00 - Unable to sleep at all, even after Etizolam. This stimulant seems to have long lasting residual effects. May be wise to dose lower, or earlier on in the night.\r\n\r\nSummary:\r\nClean and functional in lower doses. In higher doses, very pleasant euphoria.\r\nMost prominent effect last almost 2 hours with residual effects lasting up to 8 hours which has the potential to greatly disrupt sleeping.\n\n\n\n\n\nExp Year: 2015ExpID: 105479\nGender: Male \nAge at time of experience: 19 \nPublished: Sep 26, 2015Views: 2,419\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n",
  "doses": [
    "T+ 0:00 5 mg oral 3F-Phenmetrazine (powder / crystals)",
    "T+ 0:00 25 mg oral 3F-Phenmetrazine (capsule)",
    "T+ 1:45 47 mg oral 3F-Phenmetrazine (capsule)",
    "T+ 2:30 smoked Tobacco",
    "T+ 3:30 50 mg oral 3F-Phenmetrazine",
    "T+ 7:37 1 mg oral Etizolam"
  ]
}