{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t 1 tablet\n\t\t oral\n\t\t 5-MeO-DALT\n\t\t \n\t\t\n\t\t\n\t\t   T+ 0:40\n\t\t .5 tablets\n\t\t oral\n\t\t 5-MeO-DALT\n\t\t \n\t\t\n\t\t\n\t\t   T+ 0:00\n\t\t   repeated\n\t\t smoked\n\t\t Cannabis - Hash\n\t\t \n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   115 lb\n         \n\t\n\n\n\n\nYesterday I had the opportunity to try 5-MeO-DALT. I am not generally fond of being a guinea pig for uncommon research chemicals. I only trip a few times a year at most, and have a preference for classic tryptamines. But the fact that 5-MeO-DALT was in the tryptamine family, and that my reliable friend could vouch for its purity and had also tried the same batch before with a good experience, ultimately led me to give it a try.\r\n\r\nUnfortunately I do not have a good idea as to what my exact dosage was, because it was in the form of a pressed tablet. The source only told my friend they were a 'standard dose', so I'm guessing perhaps 15-20mg? They were small and dark purple pills. I started with one pill at 5:25pm. I had only eaten a small breakfast in the morning, plus an afternoon snack a few hours prior. I read that I should be feeling something within 15-20 minutes, yet all I felt at that point was a slight anxious buzz and increase in vividness of color. So I boosted it with another half pill around the 40 minute mark. Within the next 10 minutes I felt the signature psychedelic tingle. I hadn't tripped in almost a year, but it was comforting to feel some sense of familiarity even though this was an unfamiliar chemical. I found the come-up experience very reminiscent to the come-up on psilocybin mushrooms: nervousness, shaky energy/stimulation in my muscles, a rise in body temperature, slight dizziness and nausea, but without the wall-breathing visuals. \r\n\r\nThe sun had almost set and it had just stopped raining. I went out to sit on my upstairs balcony, to get fresh air and observe my surroundings. The effects quickly started to get stronger. Once I felt like I had reached my peak point, I made a comparison of the other substances it reminded me of. Physically it produced a milder version of the psilocybin body high; very warm, fuzzy, melty, and 'groovy' in the sense that I enjoyed swaying my head and body around while remaining seated. My muscles felt a bit heavy and soft. Everything was pleasantly tactile. Most notably, it had the empathic communication potential and mental clarity of MDMA, but without the pushy love feelings or contrived/artificial positive emotions. The visuals were consistently subtle and mild, nothing was moving or being altered. Colors were accentuated and lights were twinkling. \r\n\r\nMy roommate F who was on the same 1.5-pill dose came out to join me on the balcony and asked how I was doing. I suddenly began to feel mentally overwhelmed. In the past week I had been dealing with a lot of emotional and psychological issues. (I got into a car accident that left me with PTSD flashbacks, I had been experiencing relationship issues as well as some financial stress, and had been trying to support my grieving roommate mourn the death of his father, among other things.)  I began to question why I would somewhat spontaneously take a new psychedelic drug in this particular state, but F assured me it was good timing and could be a good opportunity for reflecting and healing. \r\n\r\nHe was right. We ended up sitting there talking for nearly the whole extent of the trip, which lasted a little over three hours. I often have a hard time with verbal language while on psychedelics, but in this experience communication was flowing with ease. It was the most talking I had ever done under psychedelic influence. I could process and retrieve the words I needed to express my thoughts, and felt like I was asking myself all the right questions to facilitate a healing process and better understanding of my recent troubles. F was also great at reciprocating and communicating. We held hands and made eye contact for much of the conversation. The whole experience greatly deepened our relationship. I gave him a long hug at one point which felt super connected and powerful. \r\n\r\nI also got my signature 'tryptamine smile' throughout the night. It is a sensation/emotion that I consistently and exclusively experience on tryptamine-based substances. My face gets flushed and warm, and my smile beams with an uncontrollable silly smirk followed by euphoric giggles. In one way or another, tryptamines always show me the 'cosmic joke', reminding me to laugh as much as possible and not to take life so seriously. 5-MeO-DALT was no different, and I loved how I could distinctly sense the tryptamine presence.\r\n\r\nI was not back to a completely sober baseline until at least 5 hours from the initial dosing, so around 11pm. I imagine this was probably because I took a few hits from a strong hash/herbal-blend cigarette sporadically throughout the evening which made it hard to differentiate when the 5-MeO-DALT actually tapered off. There were no side effects and no hangover. I felt mentally drained and had trouble falling asleep, but I attribute that more to the fact that I had so much on my mind and had just spend the last few hours doing an exhausting amount of self-analyzing.\r\n\r\nOverall, I thoroughly enjoyed this experience and would certainly try it again. I realized I actually preferred the lack of visuals, as it allowed me to fully focus on my emotions and psychological/mental processing. Oftentimes I feel distracted with visuals on low doses of other psychedelics, when I ultimately just want to utilize their cognitive benefits without cluttering the experience with unnecessary trailing and patterns and such. I prefer to reserve high-dose tripping for the rarer moments that I desire more visual stimulation. I found 5-MeO-DALT to be perfectly balanced for what I needed in that moment, and have nothing negative to report.\n\n\n\n\n\nExp Year: 2015ExpID: 105518\nGender: Female \nAge at time of experience: 24 \nPublished: May 7, 2015Views: 1,769\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n",
  "doses": [
    "T+ 0:00 1 tablet oral 5-MeO-DALT",
    "T+ 0:40 .5 tablets oral 5-MeO-DALT",
    "T+ 0:00 repeated smoked Cannabis - Hash"
  ]
}