{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t 200 ug\n\t\t buccal\n\t\t 1P-LSD\n\t\t (blotter / tab)\n\t\t\n\t\t\n\t\t   T+ 0:10\n\t\t 200 mg\n\t\t oral\n\t\t Theanine\n\t\t  \n\t\t\n\t\t\n\t\t   T+ 0:10\n\t\t 2500 mg\n\t\t oral\n\t\t Piracetam\n\t\t  \n\t\t\n\t\t\n\t\t   T+ 2:00\n\t\t 1 \n\t\t smoked\n\t\t Tobacco - Cigarettes\n\t\t  \n\t\t\n\t\t\n\t\t   T+ 3:15\n\t\t 3 mg\n\t\t oral\n\t\t 4-HO-MET\n\t\t  \n\t\t\n\t\t\n\t\t   T+ 7:10\n\t\t 1 hit\n\t\t vaporized\n\t\t Cannabis\n\t\t  \n\t\t\n\t\t\n\t\t   T+ 11:00\n\t\t 2 mg\n\t\t  \n\t\t Etizolam\n\t\t  \n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   185 lb\n         \n\t\n\n\n\n\nThis was written mostly during trip, Ive added in some things I realized in retrospect or did not originally write down but thought. \r\n\r\n2:50p (+0)  Dosed 1P-LSD, two tabs to account for tolerance as I had been micro-dosing them in the days leading up this trip. I might add that doing that was a really eye-opening experience into the power of LSD. 15mic in the morning is a great mix of mood enhancer and stimulant and lasts most of the day. Tabs under top gums for 30 minutes, then swallowed. No taste to really speak of.\r\n\r\n3:00 (+0:10)  First signaling starting. Feel slight electric feel in teeth. Dosed 200mg of L-Theanine to mitigate come-up anxiety and 2.5 Grams of Piracetam to potentiate.\r\n3:17 (+0:27) Slight anxiety, but pretty mild and manageable.\r\n3:44 (+0:54)  Mild bodyload, felt headspace shift around 3:40, Slight warm buzz enveloping entire body. Still mostly normal. Colors slightly more vibrant, no visual distortion except for slight breathing of ceiling.\r\n4:10 (+1:20)  Visuals stronger, friend came over for a bit, talking is not that hard. Wonder if tolerance or if drug takes longer to really come on than LSD. ++\r\n4:37 (+1:47)  Slight gastrointestinal issues, can ignore. Visuals have ramped up further. I think it is the maximum, everything is twirling and breathing, colors very vibrant.\r\n4:50 (+2:00)  Went outside with friend and dog to smoke. The outside felt amazing, very open; everything was colorful. Came back inside and was regretting cigarette. \r\n\r\nSuddenly at 4:50 there was distinct shift in headspace accompanied by the body load being killed. Visuals have ramped up considerably, not fractals, but the twirling, breathing, and blooming. Ego still mostly intact. Slight fracturing, but I dont feel full exposed to the world. Pleasant warmth all over body, reminiscent of opiate but not quite. Feel that familiar clear headedness that LSD brings. Teeth pain has stopped. Friend left and I got ready for a bike ride.\r\n4:55 (+2:05)  Put Dog up, grab headphones put on Dark Side. I would eventually just let the shuffle gods lead me. Its Saturday of spring break, campus is empty. I am excited.\r\n5:50 (+3:00) - Got back from ride was amazing! At a +++ the whole time, had free reign of campus. It was the first time the sun had felt warm in weeks. The bike was my roommates racing bike and it was like butter on the road. The gyroscopic nature of it was fun to play with;n I could go really fast with controlled side-to-side movement. I was weaving through walkways and taking shortcuts in-between buildings. All my music sounded amazing. I was grinning ear-to-ear like a maniac. Legs were on fire when I got home (hadnt noticed it during), I dont think I stopped but maybe 3 times. Trip got kicked up to ++++ for about 15 minutes from the change in blood pressure and temperature from coming inside and cooling down. Laid on the couch and buried my head in a pillow and pet Dog, watching some mild CEVs. It is extremely pleasant, but I cannot move. Body reached stasis and I came back down to +++.\r\n\r\n6:00 (+3:10) Dont care about anything and care about everything. Everything is tingly. Dog looks really cool. I already know this trip is gonna be full of more awesomeness. I have accepted this consciousness and when its done I will be sad. Going to take 4-Ho and see how it goes!\r\n\r\nAfter this point I stopped writing things down, feels like the natural progression of tripping. You end getting lost in the experience. I will give a brief recap of what happened:\r\n\r\nShortly after 6p I dosed 3mg of 4-HO-MET. I watched Upstream Color, pretty good movie to trip too. 4-Ho-MET kicked in while watching it made everything look super colorful and beautiful. \r\n\r\nAt around 7:20 the climax was coming, but I wanted to watch the sunset. I paused it and took Dog to the top of a parking garage nearby. Smoked a cig and stared at the city. The sun was blood red and falling behind some clouds. I watched as cars drove by and peopled walked around. Light of the football stadium turned on for night renovations, the sky was turning a dark blue. I was in awe of the beauty of everything around me. A strong sense of peace and wonderment washed over me, accompanied by a wave of euphoria. Dog was getting upset just standing up there, so we left. I tried to snap a few pictures in my mind of that the view for later. Attempted a longboard trip with him to campus, but he was too tired. This is one of the few times my energy outlasted his. Went home and sat on the front steps of my apartment, watching cars pass by on my busy road. Twilight gave to night and chill music was playing in my ears giving a nice feel to everything. A train passed by next to the road, it was a cool moment. It slowly rumbled by taking over the music and giving a sense of a changing of the setting from daytime to nightime. I went inside and danced a bit, singing at my dog and eating fruit cups. Was at a ++++ for euphoria, though the trippyness had leveled off. Sat down and finished the movie.\r\n\r\n9:35 (+6:45) - Coming down. Feeling a little loopy, but it's ok, I am at peace and have etizolam for when I want to stop, friend coming over with some bud. \r\n10:00 (+7:10)  Friend is over, took a small dab and that instantly brought my mind back to nice state. It hit me in slow waves, which was really nice. I honestly do not like it that much anymore, makes me paranoid and anti-social but this is nice. \r\n\r\n12:30 (+9:40) Friend left. I got a little too high, but I managed to keep it together mostly. Signing for the pizza was quit the challenge. What was interesting is how the visuals came back when I smoked weed. The only thing was that they werent tryptamine or LSD visuals, but strong marijuana visuals. The best way I can describe them is being much more vivid and with an almost Yu-Gi-Oh (anime) like shininess and dark but vibrant colors. \r\nEnd: Took two 2mg doses of etizolam over next few hours and passed out watching the Simpsons around 2am.\r\n\r\nClosing Comments:\r\nI honestly could not find any difference between this and LSD. Had the same: visuals, headspace, euphoria, thought process, and depth. The 4-Ho-MET was a great combo with the 1P-LSD, made the visuals 10x better.\n\n\n\n\n\nExp Year: 2015ExpID: 105796\nGender: Male \nAge at time of experience: 20 \nPublished: May 2, 2015Views: 4,005\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n",
  "doses": [
    "T+ 0:00 200 ug buccal 1P-LSD (blotter / tab)",
    "T+ 0:10 200 mg oral Theanine",
    "T+ 0:10 2500 mg oral Piracetam",
    "T+ 2:00 1 smoked Tobacco - Cigarettes",
    "T+ 3:15 3 mg oral 4-HO-MET",
    "T+ 7:10 1 hit vaporized Cannabis",
    "T+ 11:00 2 mg Etizolam"
  ]
}