{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t   \n\t\t oral\n\t\t Alcohol - Beer/Wine\n\t\t  \n\t\t\n\t\t\n\t\t   T+ 0:00\n\t\t 20 mg\n\t\t oral\n\t\t 4-AcO-DMT\n\t\t (capsule)\n\t\t\n\t\t\n\t\t   T+ 0:20\n\t\t   \n\t\t smoked\n\t\t Cannabis\n\t\t  \n\t\t\n\t\t\n\t\t   T+ 5:15\n\t\t   \n\t\t oral\n\t\t Alcohol - Beer/Wine\n\t\t  \n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   54 kg\n         \n\t\n\n\n\n\nSubstances:\r\n\r\nTime\t\t Dosage\t\t\t ROA\t\t Substance\r\nT-02:00\t (repeated)\t\t\t oral\t\t Alcohol\r\nT 00:00\t 20mg\t\t\t oral\t\t 4-AcO-DMT\r\n??\t\t (repeated)\t\t\t smoked\t Cannabis\r\n\r\n\r\nParticipants: MrHH [1988 +/- 54kg], D [1985 +/- 58kg], P [1985 +/- 58kg]\r\nDate: 19/oct/2014\r\nPlace: P's house\r\nWritten by: MrHH\r\n\r\nAntecedents/Additional notes:\r\n\t+ Substance has been analyzed through EC using GC/MS and TLC.\r\n\t+ All experimenters have a wide experience using different psychedelic substances, including 4-AcO-DMT.\r\n\t+ MrHH and P are daily consumers of smoked Cannabis.\r\n\t+ MrHH had an experience of 15mg of 2C-B + Ketamine on previous day (18-24 hours previous to this experience).\r\n\t+ D had an experience of 15mg of 4-HO-DiPT on previous day (18-24 hours previous to this experience).\r\n\t+ MrHH and D did not notice any crossed tolerance in this experience, since effects and power were as expected from the beginning for the ingested dosage.\r\n\r\nT -02:00 (2:15am)\r\n\r\nWe finished a rather copious dinner, enjoying also a couple of glasses of wine [alcohol].\r\n\r\nT 00:00 (4:15am)\r\n\r\nThree participants take 20mg of 4-AcO-DMT (Fumarate) orally, within gel caps, with the help of alcohol or water.  D lies on one of the sofas and begins to remember that the previous day, he consumed a psychedelic and identified no effect, so he was showing quite skeptical about whether this time he would notice something.\r\n\r\nI told him to calm down and not over-worry because he will surely enjoy the experience as it is a 'Common-Strong' dose. P leaves to take a last drink before the experiment, and comes back again shortly, we started talking about the trip of last night, it was pretty magical.\r\n\r\nP starts organizing the music for the experience: it was a pretty good choice for the occasion, we were all night listening to 'Caribou'.\r\n\r\nT 00:10 (4:25am)\r\n\r\nD closes his eyes and he covered himself with the blanket, and then I think that he is going to fall asleep, because we are a little tired from the night before. I told him to stay awake a little more, that it would take some more time to be noticed, probably because the huge dinner we just finished moments before.\r\n\r\nT 00:13 (4:28am)\r\n\t\r\nI noticed the first alerts. There is definitely a quite pronounced +. I get the feeling it's going to be a big, intense trip. D still feels skeptical about feeling something because he was not feeling anything yet. P was the same at this time. Maybe it was normal since I tend to have a very quick onset on other drugs. Nevertheless, it's really special to see how the times of action of this substance differ -even more- compared to other psychedelics.\r\n\r\nI have some anxiety, this substance always gives it to me for the first hour. I guess it's part of the 'warning' that told me that the incoming trip was going to be quite strong. I did not pay too much attention because it is completely normal in the psychedelics, and really, it almost always happens in the early stages, of most psychedelics, unless I am really drunk or I take some MDMA. I see it as something normal in the process of abandoning the 'normal consciousness' to enter the altered state of consciousness. I interpret it as something like the psyche is trying to resist against the experience, we cling to what surrounds us, our habitual way of thinking, what we are used to feel, or what we have been taught to feel normal.\r\n\r\nT 00:20 (4:35am)\r\n\r\nThe + is quite stable, begining to become sleepy, very sleepy. That's another characteristic I typically find when I consume 4-AcO-DMT. When I close my eyes I see as if in a Halloween party, I see masks and other fun and dark shapes with bright colors. I love re-experiencing the feeling of being between dreaming and awake. Right now I can easily move from one state to another, and there is nothing confusing. Anxiety is still there, but starting to disappear, because the effects are becoming clearer, progressively.\r\n\r\nP was starting to notice -in a rather attenuated way- the effects of the substance. I guess he was in a +++ pronounced, because of his descriptions Again, it surprises me, how distinct are times with this substance, probably due to individual changes like metabolism. He commented that the lamp of the room was bending and moving. Then P and I were observing how the lights of the candles and the screensaver started moving to the beat of the music creating a unique and lovely atmosphere, beautifully strut circles.\r\n\r\nD still lying on the sofa, I imagine he was thinking something like 'wow, again I will not feel it :-)'. I really looked at him and I really could not notice any effect on him.\r\n\r\nAt the time, I remember my trip the day / hours earlier, and I think P will have a much bigger experience than ours, due to he not having the tolerance we had from yesterday. That is why we decided to roll a joint of cannabis, to enhance the effects of the substance.\r\n\r\nD begins to have stomach problems, has enough pain, and no effect. We attribute all this to the dinner at the Mexican restaurant the day before, when both had dinner with some friends in a new restaurant- since we had been somehow bad from it. I worry a little bit, because I think that besides not having effects, he will be with a stomachache, I was worried about this.\r\n\r\nT 00:40 (4:55am)\r\n\r\nThe effects of cannabis are increasingly evident, enhance the substance to take me to a sustained ++. The anxiety has disappeared leaving an extreme sense of calm, there are no worries, only calm, wellness, laughs and love.\r\n\r\nT 01:00 (5:15am)\r\n\r\nD still bad, he said to me that he was feeling really tired, and his stomach hurt a lot. I say that to feel a little bit tired is a good sign, I started to feel exactly that on my onset. About his stomach, I told him that surely will be the digestive process, we have dined pretty hard, I told him to relax and wait until these negative effects are over.\r\n\r\nT 01:15 (5:30am)\r\n\r\nI get along with D to ask more details about his stomachache, because I have the the feeling that he is still feeling bad, and also, not noticing any effects from the substance. P interrupted telling us a joke about it, and the three of us were laughing from it in an incredible way. I fall down to the floor and I could not get up, I have to ask for help because the table was right next to me and I could not get up to the sofa\r\n\r\nD realizes immediately that he is under the effects of the substance, and his stomachache becomes a 'river' of self-powered laughs from the rest of the experimenters laughs. Also he was noticing a slight ringing in the ear that was lasting about 20 minutes, this is very characteristic of some tryptamines, I really did not notice it, but I told him it's pretty common.\r\n\r\nT 01:25 (5:40am)\r\n\r\nActually from here we begin to enjoy the experience of an intense way. We have quickly risen to a +++, it is definitively impossible to ignore the effects of the substance. Also I already forgot the worry of having D sick, I felt really good by that time.\r\n\r\nSomething that turned us curious was to not being able to know if we were cold or hot, or the seemingly great and real feeling of being in a dream.\r\n\r\nI remember we were running around on the floor and sofas, did not care about the positions, closed our eyes to focus on the HD visuals, all of dark and sinister theme (I remember calling it 'the passage of terror') but extremely funny, very similar (but not identical) to a mushrooms trip. Fractals, geometrically perfect shapes, animal faces surrounded by a lot of changing colors and dimensions.\r\n\r\nT 01:30 (5:45am)\r\n\r\nNow things start to calm down a little bit. I've just noticed another feature of the psylocybin mushrooms, I am feeling that the psychedelic effects are going up and down like in 'waves'. By moments you can have the feeling that you are able to have -a more or less normal- conversation, other times the effects fill you in such way that you can just lie and enjoy the wide range of sensations, colors, sounds, thoughts.\r\n\r\nD starts a conversation about empathy. He questions himself how it is possible that in the world we live in, full of needy and troubled, there is not more empathy. We even found the conclusion that fewer people even know the meaning of this word.\r\n\r\nD starts talking about how people -in their eagerness to blame the weakest since the profound ignorance- blame illegal immigrants for the poor quality of public services such as health or education on our country. I told him that obviously the fault is from the government mismanagement Politics deceive people to generate hatred and attempt to justify corrupt actions constantly performed. It is cruel and vile. These people have nothing from which they come, here they hope to have a minimum of human dignity in their lives. They deserve as much as we all deserve on developed countries. We all deserve a minimum: a life without gratuitous suffering and without arbitrary yields. We can not continue treating them as if we assume that geographic luck is a whim of fate. We have established a worldwide hierarchy which literally sucks, automatically the society teach us to assume -through stimuli in the media and education- that those born in a developing country have to take all the weight and negative side of the development of capitalism. It's so unfortunate, there are people living great (great = better than in Africa) thanks to people who only lives to satisfy -little justified- cravings coming from the needs created by capitalism.\r\n\r\nD also says that there should not be any borders as, at the end of the day, we are trying to avoid what is inevitable. I've never thought these kind of things in a such 'radical' way, because I guess that's just certain social burdens that I have self-learned in the process of my development/education as a person, but now I understand it perfectly, and I absolutely share his opinion. Why there are borders and people can't cross from one country to the other? Are they going to do something bad? The simple response is NO.\r\n\r\nFor a moment I closed my eyes and felt all the pain an illegal immigrant may feel in different situations throughout his life, from his birth, his aspiration to migrate (by jumping these terrible walls on the borders) to a European country to have better life, and worse, trying to pass through the border while it is guarded and they are beaten, abused and completely misunderstood. The pain came to my heart, is what has most hurt me in my life, while I cried a few tears to experience such unpleasant feeling.\r\n\r\nThe three of us shared a question: how humans can be so cruel? Curiously enough, we were previously speaking about empathy, and we just experienced empathy at its best.\r\n\r\nFinally we concluded that the problem source is politics, and ultimately responsible is, of course, the damn money. We must remember that Hitler came in response to a major economic repression. They are -unfortunately- non-stop-cycles repeated in human history. I hope it is not going to be repeated again.\r\n\r\nWe are highly shocked, I have never felt more emotion. This material is highly emotional, sentimental and empathetic.\r\n\r\nI also admire with extreme tenderness love the feeling I have at this moment for the planet and for humanity, for animals... in summary, for what is really important in life. The rest is not important, the rest is completely superfluous, we surround ourselves of objects devoid of meaning, and we give them too much value.\r\n\r\nWe feel very fortunate at this point, noting that luckily, we have the basic necessities for a decent life more than covered, unlike many of these illegal immigrants.\r\n\r\nT 01:40 (5:55 am)\r\n\r\nAfter the conversation (which were several minutes of relative 'Psychedelic calm': although the effects were noticed we could deepen interesting and relatively complex conversations) the effects returned to dim again dramatically, we begin again to laugh uncontrollably, having visions with both open and closed eyes that filled the experience of color.\r\n\r\nD began to wonder if the colors in the room came exclusively from the lights that we had, or otherwise coming from his own head: obviously most of the effects were the result of the experience.\r\n \r\nD saw -with his eyes closed- a pig with black and white colors, yellow eyes and its teeth were sharp, it was a very aggressive face: he was feeling some fear. At that time we said we were on a pig farm.\r\n\r\nP was at this time also having his personal trance with his eyes closed, started laughing so huge and D and me did not stop to ask what he saw, because it was intriguing to us. P could neither be explained and kept laughing with eyes closed: he said that there were too many things at the same time trying to explain, he tried to explain it still with eyes closed but, came more things into his mind and he got distracted and could not explain nor stop laughing. P said he saw a rat amongst other different personal things.\r\n\r\nT 01:50 (6:05 am)\r\n\r\nWe stayed several minutes in the same state, until we sat on the same sofa, the three of us, for the first time in the night. I started rolling a joint of Cannabis to further enhance the effects of the substance.\r\n\r\nNow I begin to feel that my mind is alone, I am alone with my own thoughts, that's the only one thing that I feel to be existing right now. My 'self' begins to dissolve. Time goes increasingly slower and slower. I have no choice to even finish to roll the joint of Cannabis: I had the feeling of being in an unlimited loop that continues to be repeated again and again to infinity. I put the pot on the table because I got the feeling that I was rolling again and again (infinitely!) the joint, so I decided better to wait to see how the trip progressed because I could not even roll it! I told D and P literally 'this is becoming a bit confusing, no?' I was caught in a loop. I think they told me that they did not feel that, but I do remember that we were repeating -again and again- the same phrases, but now I really think that I had the feeling that everything was repeating...\r\n\r\nMy consciousness seems to be infinite and unlimited. I feel that I'm just trapped energy outside the space-time continuum. The time does not exist. What in my normal state of consciousness I might call 'self' does not exist at all here. This is what is commonly called an ego death.\r\n\r\nAt this point I started to feel very confused for only a few minutes. I got to have a little scare because I felt very strange, but I instantly remembered a similar experience I had in 2008 the first time I went to Amsterdam with Copelandia cyanescens (Hawaiian mushrooms). It scared me a lot because it was my first ego death, had a lot of panic at that time, and I had no reference of feeling something like that by using psychedelics by then, it was my first experience with mushrooms at high doses. When I remembered that mushroom experience I calmed down and then I really enjoyed the experience. I loved to feel something 'big' with psychedelics after so long. The last time I reached this state was years ago, this momentous, ideal, unique, intra-personal, unlimited, unique, mystical, spiritual, trans-corporal level ...\r\n\r\nT 02:05 (6:20 am)\r\n\r\nA few minutes later we started to feel again relatively 'present' after the last psychedelic wave. I mentioned what had happened to me and how it reminded me of what I lived in Amsterdam, I told them that I have been a bit frightened, D told me that I should not to be afraid. I agreed with him and I said that these feelings are precisely what I'm looking for in these substances, highly transcendental experiences that change the way we perceive the environment and circumstances around us.\r\n\r\nT 02:15 (6:30 am)\r\n\r\nD goes to the bathroom. At that time I had another ego death, Time is completely stopped, again it was just my thought. I saw P and D but I had the feeling they were not the ones who were really there. My 'self' (J) was not there as well. I was again trapped outside the space-time continuum in a 'place' outside of what we know as reality. Both were part of my thought, that was all that existed at that time. I felt completely alone.\r\n\r\nI got the feeling that inactivity (for several seconds we did not talk among ourselves) was potentiating the chances of experiencing this unique and special feeling (ego death). Another possible interpretation I gave at that time was living in a dream. I've felt that everything went out from my thought: both P, like D (the other experimenters), as the place where we stood at that moment, everything around me was a projection of my own mind (or my thoughts better said?), and I even gave the feeling that what I perceived as my own body, was just another illusion. Here there is no panic, apparently I'm alone with my thoughts in a surrealistic dream. \r\n\r\nT 02:20 (6:35 am)\r\n\r\nI went to sit next to D, who was still in the bathroom looking at the floor, because I felt somewhat alone and I also had the feeling that it seemed an eternity since he went to the bathroom. I imagine that only took a few minutes, but then my perception of time was completely altered, for me it was ages. He was still there, looking at the marble floor, I sat next to him and hugged him. I remember that he could not stop watching the floor. Minutes later, I guess P also started to feel something in the main room, and then he came to the bathroom too.\r\n\r\nT 02:40 (6:55 am)\r\n\r\nImmediately after, we returned to the living room. I decide to finish to roll the joint of Cannabis, the one I had to leave a few minutes ago because I could not roll it. D sits 'upside down' on the sofa: with his legs on the wall. He invites us to do so, while reminding us  at the same time that is something that is usually done in childhood. I try it and it's great: you can see the ceiling, as if the ground, having the feeling of sitting on the roof! It reminded me so much of my childhood, surely I did it pretty much, but now I can't really remember when I did it. We appreciated again how nice it was the room with candles and colors, its light swaying to the rhythm of music.\r\n\r\nT 02:50 (7:05 am)\r\n\r\nI tell D that I think the position we have is not good, since our blood is going to rise to our heads. Actually at that time we had not the slightest idea if it was really dangerous or not to keep that position, I guess I was just afraid that something would happen to D. We rejoined on the sofa (on a normal position) and started to smoke the joint that I had rolled just minutes ago.\r\n\r\nWe keep being constantly amazed with the music P has chosen for this night, which also makes me remember how good we had dined as well. P made curry chicken and spaghetti bolognese, for dessert we had a cake I did not really enjoy especially (I will explain this later). I remembered that I was late, I told P how much we enjoyed the food that night, and I apologized for being late. I felt really bad at that time. Not so much as when I felt the pain of immigrants of course, it was more like a disappointment, as if I have let down a friend. Obviously now I see things more objectively than when I was considering this, and I see it as something common. I remember standing with eyes closed enjoying the beautiful visuals at that time. Because of this disappointment, I remembered aloud that my friend R was the one opening my eyes to show me that one of my personal problems is that I try to please everyone. At that moment I realized I had to organize my life, that was another problem, not having stable work/sleep/food hours, really supposes a problem both in social life and health of the individuals (for example, me). At the end is stress, one way or another, that kills you. I came to the conclusion that further organizing my schedules could be highly beneficial to my life. D told me not to think about it at the time, I agreed with him because I still had quite an effect and I tend to pay attention to people I appreciate when I'm in such state; but I really think it was a mistake to stop thinking about these things because I was about to understand the source of my problems, mainly anxiety about having too much to do, and want to keep track of everyone like family, friends, clients. I imagine (and hope) returning to this same issues in the next 4-AcO-DMT trip :-)\r\n\r\nT 03:20 (7:35 am)\r\n\r\nD wanted to look himself in the mirror, so he went to the bathroom. I remember the sun was rising and I was looking at the sky that was turning slightly into lighter colors.\r\n\r\nT 03:25 (7:40 am)\r\n\r\nWhen D returns, says 'fuck, I have looked myself in the mirror and is the worst thing I could do.' I've seen myself in 8,000 different ways. I thought that he meant he had some kind of visual distortion, so I did not pay much attention.\r\n\r\nD sits on the floor next to the table and lights a cigar, in front of the paper. He drew the turkey that can be seen in the notes of that night. In the meantime, I was talking to P about something I can not remember. Suddenly I look at D and I can see how his face shows an expression of anger or displeasure. Then I do not understand what happens, because I had really forgotten what he told me about the mirror, and I did not associated it with his strange expression in any way. I asked to him several times what's happening, and he refused to answer simply replying 'nothing's happening' and 'don't worry'. Surely, after knowing him during more than 5 years, I know what happens to him simply by looking at his face, or his movements, very easily After several unanswered questions I got a reply from him: 'I am really tripped out'.\r\n\r\nThen I thought that what happened was that he was angry about the fact that we were under the influence of substances so often by that time, because it was the only thing that I could really associate with his anger expression.\r\n\r\nI think that psychedelic substances do not always meet the standard definition of 'recreational drugs', I consider it a real -obvious- need of the human being, which has been repressed countless times through history with the sole purpose of controlling society and the thought of the people. In the same way we have endless entertainment options -publicized by governments-, for example, that don't make a change in the axis of thought instilled by the money, the big enterprises and the global authorities: All I want is to stop feeding this capitalism meaningless to most of the population, the cost of keeping humans in a semi-slavery regime -controlled by money-, and also, giving the appearance that we are free and that government takes care about us. They do not want the people to take psychedelics because they release our mind, psychedelics help us to get out of that movie that is taught from our childhood, so we can really perceive things objectively. Money should be a utility to represent the value, but should not be used as a method of human slavery.\r\n\r\nI got the feeling that D was closed and he did not wanted to speak to me.\r\n\r\nT 03:50 (8:05 am)\r\n\r\nD told me that he was rethinking everything, he did not give me many details so I asked what he meant: does he want to rethink our relationship? Does he want to rethink his response to different stimuli in his life? Does he want to rethink his entire life and go to Africa to work with an NGO? I had no idea, I guess the first thing I considered was because I was feeling guilty that he was feeling that way.\r\n\r\nThen he told me what happened, is that he has seen himself from the outside, realizing each of his defects. That's when I understand everything, and I tell him not to think more about it, the time to integrate the experience is when the psychedelic effects have ceased more. Now it's time to 'see' and 'feel', the 'thinking' can be later or tomorrow if it's about something negative or complex. He tells me it's complicated. I tell him that we should be more than happy that we have nothing negative in our lives, and that each person is able to change the way of feeling emotions. We can change our perspective. We are gods of our own thoughts, specially under the influence of a psychedelic substance, we are able to change the 'thought chains' very easily if you really believe that you can focus your mind in other things. The situation can become a problem just if you don't believe you are able to change your thinking, therefore entering on a circle of mental thought that is -very- unfavorable, this is a clear sign that we must always be assured that we can change our mood at will. We just have to believe ...\r\n\r\nD began to feel better and better in the next few minutes.\r\n\r\nT 04:45 (09:00am)\r\n\r\nD already told me he was not feeling psychedelic effects anymore, we must remember that he does not consume Cannabis. He started feeling again his stomachache like hours before. P makes a chamomile tea for D, D takes it and he goes to sleep.\r\n\r\nT 05:15  (09:30am)\r\n\r\nSeeing the beautiful sunrise views, and discussing how the night has been with P, I took a couple of glasses of wine. I was still feeling some residual effects by then, a slight +. I remember we discussed things like that golf is not bad in itself (we had a view of a golf course), what looks bad is the 'glamour-like' feeling behind, such as the hard prices for the needed equipment and games, the kind of people that typically play, etcetera. It would be interesting to invent something like 'amateur golf' with less classist requirements. It reminded me of a PS3 game that's about throwing a frisbee, because the dynamics of the game is quite similar. Also during this time we were trying to write down on paper a 'timeline' to make this trip report.\r\n\r\nT 06:45 (11:00am)\r\n\r\nWe retested the dessert pie as we wanted something sweet (I remember closing my eyes and seeing a local typical sweet ...): I found it delicious, we ate it almost fully with just the help of a spoon for everyone.\r\n\r\nWe slept smoothly, comfortably, and the next day was a slight physical fatigue and some more sleep than usual, probably because we did not sleep too much.\r\n\r\nMY PERSONAL CONCLUSION:\r\n\r\nThe fact that D was about to fall asleep at the beginning of the experience reminded me a couple of times that I've fallen asleep in full experience of a psychedelic substance, when waking up under those circumstances (continuing tripping) it is quite confusing; thanks to remembering this, I came immediately to the conclusion that the process of 'awakening' must be 'unbreakable', one must be well both physically and psychologically: then I think that the process of 'awakening' is an essential part and very important for some process that somehow reconfirms or reaffirms our identity and its position in life.\r\n\r\nMaybe this can be scientifically explained by theories that suggest that our dreams are generated thanks to DMT segregated by the pineal gland in small amounts, while we sleep. It is a physiological process rather unknown today, but it is known to play an important role in our brain: neuronal regeneration.\r\n\r\nSo when we dream, we are tripping. It could be logical, at least to me. I imagine that these experiences can not provide everything positive that can bring a state of 'full' consciousness (as one can get with the extreme meditation, psychedelic drugs, or any other known technique) because we have assumed that dreams form a normal part of our lives, personally I think that we do not pay enough attention to dreams. It really should be analyzed if dreams can have the same potential -in psychological effects- that the other mechanisms that are able to create an altered state of consciousness.\r\n\r\nWhen we wake up, we stop dreaming, we stop sleeping, and we begin again to appreciate the reality around us. I think that being under the influence of a psychedelic during this process may create invalid neural relationships (and therefore possibly harmful?) During those first seconds after waking up, where the first thing we do is look around us, 'feel ourselves', and then restore our position in the environment around us: our life, commonly know as reality.\r\n\r\nReturning to the trip conclusion, we repeatedly had the feeling of 'teleporting ourselves' from different times and places of the night, feeling a kaleidoscope that moves along the room or environment in which we were, which is something also very characteristic of psilocybin. In other words, our perception of the time was completely altered.\r\n\r\nWhat happened to D is a completely expected/normal high-dose psychedelic reaction, our ability to analyze and solve problems is increased to stratospheric levels. What you need to do is never run such a thought for oneself, nor analyze at the time of the experience if it's a negative feeling, because in an altered state of consciousness you need some objectivity to analyze an hypothetical hard situation, and that requires the intervention of at least one other person in the group, just if you want to explore it by the time of the experience.\r\n\r\nCertainly for me, the most remarkable parts of the experience were the two ego deaths and the deep conversations and conclusions we had. I had not felt something like that from years ago, and made me remember what I look for in the psychedelic substances. I loved the state in which you have the feeling that you died (or have reached the end of the time dimension / end of the world). It's amazing that it's possible to have that experience even with fully familiar people around me. I don't care about feeling scared until I acknowledged it. That sense of being completely 'out of control', that feeling of being dead, completely crazy, or is just that the temporal dimension (Time) arrived to an end? And everything seems completely irreversible at that time. In this state there is no boundaries between my 'self' and the environment.\r\n\r\nThis sense of ego death reminds me of the philosophical Solipsism, which is constantly debated and questioned throughout human history, especially in the later eras:\r\n\r\nSolipsism (from Latin solus, meaning 'alone', and ipse, meaning 'self')[1] is the philosophical idea that only one's own mind is sure to exist. As an epistemological position, solipsism holds that knowledge of anything outside one's own mind is unsure; the external world and other minds cannot be known and might not exist outside the mind. As a metaphysical position, solipsism goes further to the conclusion that the world and other minds do not exist. Solipsism (from Latin solus, meaning 'alone', and ipse, meaning 'self')[1] is the philosophical idea that only one's own mind is sure to exist. As an epistemological position, solipsism holds that knowledge of anything outside one's own mind is unsure; the external world and other minds cannot be known and might not exist outside the mind. As a metaphysical position, solipsism goes further to the conclusion that the world and other minds do not exist.\r\n\r\nBy activating these ego deaths, I asked myself several questions throughout the experience:\r\n\r\n- Is 'inactivity' the key to generating ego deaths? In other words: Is it easier to feel ego deaths when it is quiet and there is no interaction between the participants? At least to me it intensified every second that there was no interaction from other experimenters. Having the time so highly dilated, every split second (although there was music) gave the impression of being a real eternity. Is there a relationship between this frequent psychedelic 'time-dilation'/'time-stopping' feeling and ego deaths?\r\n\r\n- Can tripping in an unknown/new/unfamiliar place promote ego-death experiences? Can tripping alone promote ego-death experiences? Or really only certain substances in certain situations, regardless of the familiarity of the subject's environment, are able to activate this kind of experiences? Could I achieve this experience in a highly familiar environment like at my own home? At the time of writing this Trip Report I think yes, because the ego deaths from this experience were happening with an extremely familiar person to me (D), I was thinking that he was just existing in my head. Although it is possible that the fact that we were in a new place, increased the effects of the substance in any way, including creating those feelings of ego death.\r\n\r\nAbout this psychedelic, I can easily say I have a new favorite:\r\n\r\n-For its ability to increase the appreciation of feelings: it is as if all the feelings literally embrace you, both the good and the bad. You can feel them and see them with your eyes closed. It is fantastic.\r\n\r\n- For its ability to enhance the appreciation of music (and sounds in general) and flavors.\r\n\r\nThe only caveat I would say about 4-AcO-DMT would be to recommend not mixing it with alcohol because it gives some nausea and stomach discomfort; and this makes the experience somewhat uncomfortable. Also it's very curious that, having had the dinner in the same moment, the onset of the substance was very irregular and participant-dependent.\n\n\n\n\n\nExp Year: 2014ExpID: 105870\nGender: Male \nAge at time of experience: 26 \nPublished: Oct 17, 2015Views: 974\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n",
  "doses": [
    "T+ 0:00 oral Alcohol - Beer/Wine",
    "T+ 0:00 20 mg oral 4-AcO-DMT (capsule)",
    "T+ 0:20 smoked Cannabis",
    "T+ 5:15 oral Alcohol - Beer/Wine"
  ]
}