{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t 150 ug\n\t\t oral\n\t\t 1P-LSD\n\t\t (blotter / tab)\n\t\t\n\t\t\n\t\t   T+ 1:40\n\t\t 50 ug\n\t\t oral\n\t\t 1P-LSD\n\t\t (blotter / tab)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   160 lb\n         \n\t\n\n\n\n\nSubstance: 1P-LSD\r\nDose: 150mcg (100+50mcg; 1.5 tabs)\r\nSetting: Outside camping at a music festival\r\n\r\nPrior to this, I had consumed 1.5 grams of mushrooms the night before and tripped HARD. I wasn't sure if the serotonin in my body had properly replenished before this, so I am not sure if the effects were weaker. To my knowledge, I don't believe they were.\r\n\r\nPrior to the experience, I ate two pancakes and had some sausage to fill my stomach. I take 20mg amphetamine salts (extended release) daily, as well as 150mg bupropion. These did not alter the experience in any way to my knowledge.\r\n\r\n0:00 - I put the tab on my tongue. At first there was a mildly salty taste on my tongue. Not easily discernible.\r\n\r\n0:20 - The first effects become noticeable. Nothing in the head, but colors are just a touch brighter, but not by much. The effects are not immediately apparent, but something is there. +/-\r\n\r\n0:50 - This is when the effects began to become apparent to me. Some effects are beginning to become apparent. The aesthetics become naturally beautiful - everything feels natural. It does not feel artificial in any way (like some phenethylamines do). Blues and greens are becoming more accented and in-depth. ++\r\n\r\n1:10 - Colors become more intense and shift in smooth, clean, natural waves. I likened it to a tide rolling in - sometimes I'd feel more sober, and other times I would feel more like I was tripping. The body load is pleasant and light. ++\r\n\r\n1:30 - Time begins to dilate. Visuals creep in waves. Everything looks clean and defined. The patterns in the trees were much more apparent - the bark kinda had a wavy organic look to it.\r\n\r\n1:40 - I take another half tab (50ug)... I am at a ++ and still climbing. It felt weird because at this moment, it felt as though 20 or 30 minutes had passed, but still, it was only 10 minutes since I had last taken notes. Taking notes was a bit harder. \r\n\r\n2:00 - Come-up is slowing down a bit, but still climbing. There is a somewhat nice tingle in my body occasionally, but it feels okay. Nothing too much. I am obviously beginning to feel the effects a bit more - I cannot wipe the smile off my face. My girlfriend and I are laying down in our tent, and as I stare at her face, I can see every pore in her skin, and I could not help but think if I was seeing those because of the 1P-LSD or if there was dirt in there highlighting them.\r\n\r\n3:00 - Effects have developed into a solid +++. Colors are bright, there I can see the organic natural fractals in the trees. My eyes were continuously drawn to the trees. My girlfriend, who is also on the same dose as me, and I decide to walk around the festival. \r\n\r\nAround this time, her nephew arrives and we sit at a table for about an hour or two. Her nephew is about 2 years old, and he somehow picks up something was different about us. He noticed he was making us laugh and smile a lot more, and we were more excited to see him. I remember seeing his hair flow (he has long hair - it hasn't been cut since he was born) in the wind and it made him look like a composer from the 1700s, and so I nicknamed him in my head 'Little Amadeus.'\r\n\r\nI was beginning to feel hungry around this point, and decided to make a sandwich order. The sandwich was from a food vendor in the area, and I was confused as to what all went on it. I read what was on the board, but did not understand that it came with everything listed on the board - I thought I had to choose what went on it (which was not the case). So I ordered the sandwich, and when I finally got it, it was amazing. The cheddar, the avocado, the meat...it was well worth the money and it was made so well. I felt somewhat dehydrated around this time, and a headache coming on, so I decided to get some water.\r\n\r\nI saw flies and bugs go by, and when they did, there were LONG tracers. Tracers were very strong with this. Sometimes a bug would leave a tracer about 5 to 10 feet long. People would swing bats and spin poi and things of that nature, and it would form full circles.\r\n\r\n4:00 to 6:00 - We return to our campsite with friends and listen to people talk and shoot the shit. There were two guys in our group, best of friends from childhood, who looked like polar opposites in a lot of ways. One was scrawny, wearing a nice fedora (but could actually wear it and it matched his outfit), wearing a collared shirt, and his best friend was shirtless wearing jeans and had side-burns. It looked like a city-slicker, country-boy dynamic duo. Wherever they were, together it looked funny to me. The City-Slicker looking one was doing all sorts hick country impersonations, and no matter what he said, it would crack me up so much.\r\n\r\nThe trees in the hills surrounding us had adopted very distinct colors and shapes, and there was some breathing and morphing. The music in the distance could be heard echoing back from the hills, and it was very distinct and clear, even though we were probably 150 to 200 yards away from the main stage.\r\n\r\nThis clearly felt like around the very peak of the experience. +++\r\n\r\n6:00 - I felt the need to go to the river and dip my feet in the water. For some reason, for the past few minutes before this, I felt a weird tingle in my left arm, as though my fingers were falling asleep, and this had me somewhat worried. I didn't want to feel like I was going to experience vasoconstriction and lose my hand or fingers, but they did feel like they were swelling. This went away shortly, however, and I felt fine again. I think it might have been from dehydration, or it could have been the other tab kicking in. \r\n\r\nThe peak begins to wane and I return back to about a ++. The effects were not as strong as they had been earlier, and the booster was probably the only thing keeping it remotely close to a +++.\r\n\r\nThe visual effects were still there at this time.\r\n\r\n7:00 - As the sun sets over the hill and through the trees, the forest around me begins to look enchanted. The grass in the forest where the sun is shining adopts a golden-green hue, and the smoke becomes rays of light beaming into the underbrush. The effects were still there. ++\r\n\r\n8:00 to 12:00 - Around this point, most of the effects have faded and gone away, and for the next two hours, I came down to a gentle +, and past that back to baseline. Visual effects slowly waned.\r\n\r\n\r\n\r\nOverall summary and comments:\r\nThe things I had heard prior to this were that it was indistinguishable from LSD, and for the most part, I would have to agree. Maybe it might be slightly less visual, as I got slightly less color-shifting from it, but I could not honestly say if that was the case. There is a minor body load, but nothing too much - it's just tingly at one point, and that could have been from other factors. \r\n\r\nThe other distinguishing factor for me was that time dilation was stronger on this compound than LSD. Time dilation started sooner (at about 20 minutes in). It was hard to keep track of time, but easy to keep track of the sun. Often I would find myself thinking 20 or 30 minutes had gone by when only 10 had. \r\n\r\nIt felt natural in the same way LSD dose. It does the exact same things that LSD does. In every respect, it is LSD. Music enhancement, duration, visual effects, the way the body feels relaxed...it all was exactly like LSD. Had I been given this and told it was LSD, I would have believed the person, because how could I tell the difference other than that tingling sensation at one very specific point which may not even be totally attributed to this compound.\r\n\r\nI believe this compound to be completely safe. It was easily one of my favorite psychedelic experiences - but like LSD, it feels long in its duration. Not too long, but long enough for me to think 'okay, this is STILL going.' I didn't want it to end too soon, but I did want it to settle down and go away eventually, and it did, much in the same way that LSD does.\r\n\r\nThe physical effects were mild, and my mindset could only be described as short-sighted.\r\n\r\nDefinitely a worthwhile compound, and one of my favorites. It is almost completely identical to LSD.\n\n\n\n\n\nExp Year: 2015ExpID: 106122\nGender: Male \nAge at time of experience: 23 \nPublished: May 8, 2015Views: 21,733\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}