{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t 50 mg\n\t\t rectal\n\t\t 3-MeO-PCMo\n\t\t (liquid)\n\t\t\n\t\t\n\t\t   T+ 1:00\n\t\t 150 mg\n\t\t oral\n\t\t 3-MeO-PCMo\n\t\t (powder / crystals)\n\t\t\n\t\t\n\t\t   T+ 3:00\n\t\t 150 mg\n\t\t oral\n\t\t 3-MeO-PCMo\n\t\t (powder / crystals)\n\t\t\n\t\t\n\t\t   T+ 6:00\n\t\t 150 mg\n\t\t insufflated\n\t\t 3-MeO-PCMo\n\t\t (powder / crystals)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   360 lb\n         \n\t\n\n\n\n\nI plugged, I swallowed and snorted, 500 milligrams went down the hatch, of the latest UK legal Arylcyclohexylamine!\r\n\r\n3-MeO-PCMo HCl (RC name)\r\n\r\n4-[1-(3-methoxyphenyl)cyclohexyl]morpholine (IUPAC name)\r\n\r\nSubstance came as white, glassy crystalline lumps. Using a shotglass and teaspoon as mortar and pestle, they were easily ground to a fine powder. A slight solvent odor was apparent. Upon washing the cake in the shotglass it was hard to dissolve, lets hope it is soluble in the little water a rectal dose calls for.\r\n\r\nFirst experiment: 50mg rectal.\r\n\r\nThe amount did not dissolve in 5ml water, even with gentle heating, solubility less than 10mg/ml. I ended up with snowglobe crystals in my syringe, I rectally administered it, about 10mg stayed behind so taken dose is about ~40mg intraanal at 12:48.\r\n\r\n+00:40h There is some tiredness, a warmth, a feeling of 'being in the head' which is clearly dissociation but I would be hesitant to call this as being as strong as 10mg methoxetamine rectally. I do not feel there is a significant bioavailability effect to taking it rectally and making the solution was a pain, so I will resume the trial orally. Due to poor solubility this drug is useless for injection use. If I would guesstimate the solution I actually achieved, it would be 6mg/ml.\r\n\r\n+01:00h An additional 150mg orally is added. Taste is not very bitter and a bit foul, but not much of anything. Its a bit chalky, you can sense that it is poorly water soluble as a crystal on your tongue. Biting on a small chunk gave a squeezy sensation, as if biting on a tiny piece of styrofoam.\r\n\r\n+01:30h There is clear stimulation and euphoria its fairly strong already. Its a bit scary, to feel such energy so early on. Its reminiscent of 3-MeO-PCP and 4-MeO-PCP they too have this initial effect.\r\n\r\n+02:00h The effects are more pronounced. There is increased tactile sensitivity, sensitivity to cold etc all over the body. A tendency to delightful shivers. It doesnt sit too comfortably in my tummy but that may be the dopaminergic stimulation, which is always a problematic effect for me. It will pass as the initial stimulant side subsides and it becomes more anesthetic. Its reminiscent of the methoxyphencyclidines, 3 and 4, which isnt strange as 3-MeO-PCMo is essentially 3-MeO-PCP with a methylene bridge of the amine swapped for an ether.\r\n\r\n+02:45h The stimulation phase lasted about an hour after taking the 150mg, and at about 1:30 after that dose distinct dissociative headspace started to manifest itself and is now on the rise. I would say I'm somewhere in between 5-10mg 3-MeO-PCP in intensity and it is rising. It has become interesting and in itself it is probably enough, but at +03:00h I'm going to add an additional 150mg orally to see where that will lead. I have a feeling I will be strongly impressed. I'm starting to get impaired. First contact with the Spirit World has occurred. There is a tendency to sing songs from my childhood and relive memories.\r\n\r\n+03:00h as planned, an additional 150mg down the hatch. I have a feeling this might be my last dose for quite a while.\r\n\r\n+05:00h I'm sedated, in a dreamy mindset, my eyes half closed, thoughts meander through an otherwise empty, tranquil mind. There is a sense of complete relaxation, total peace and solemn Eternity. Enter the dream, let it carry you on its soft wings. I'm having inner dialogue a plenty, it is spiritual in nature. All is calm. I am truly blessed, and I am yet on the rise. This is it, the end of the line. I had the assumption that I would march on up to the cannon's mouth and do the gram over the course of the day but no. This is where God wanted me to be this day. I am fully satisfied. I'm on the verge of crying tears of joy. So peaceful and Holy, Holy, Holy. This is where I needed to be. All the unrest I had today (I woke way early 'knowing' the parcel would come today) discharged into a complete peace. Take me on your wings. I will dream the dream. Asante, afloat in the cosmos.\r\n\r\n+05:30h If I am to assess the qualitative effects I would say they are very close to those of 3-MeO-PCP and akin to 4-MeO-PCP, much more so than that they are similar to Methoxetamine. The 'dreamy summer's day' feeling prevails. Quantitatively, the substance is wanting. The substance is unsuitable for injection and rectal administration, and oral potency is low. Given my tolerance I would roughly equate the 300mg I took orally to 12mg 3-MeO-PCP, a 25x reduction in gram potency. Do NOT rely on this, all people are unique.\r\n\r\nMuch as I like the mindstate, I see no reason to go for 300mg oral 3-MeO-PCMo if 12mg 3-MeO-PCP is available because the experiences are substantially similar but the alkaloid load on the metabolic organs is 25 times higher. I feel no reason for concern physically, and 3-MeO-PCMo is a valid 3-MeO-PCP replacement, but I advise that if both are available, to stock up on the latter.\r\n\r\nExperientally I'm done. I had the experience I came for. I am fulfilled. But, First and foremost I am doing this test to blaze the trail for this drug for other explorers, because I know of only 2 experience reports and one dose suggestion in the public domain.\r\n\r\nI hate snorting drugs, but many dissociative users do so. This will be a CHORE for me, especially since its barely water soluble. Guys, I'm going to take one for the team and even though I had enough, that which started with a rectal dose, was taken to oral, shall be completed with a snorted dose of 150mg to test its bioavailability, bringing the grand total consumed on 500mg.\r\n\r\n06:00h 2x 75mg insufflated. Fortunately it is very easy on the nose, like bitter sugar, and doesnt seem to produce excessive fluids.\r\n\r\n+06:30h Theres a clear intoxication, a warmth to the face and dreaminess is on the increase. Will intranasal use be more bioavailable or lead to a more rewarding inebriation?\r\n\r\n+08:30h Whatever intoxication there will be, I assume it has arrived now. Nose feels clean, all has resorbed without drip. I had hoped that intranasal use would be superior in effects, instead I have the feeling that, though qualitatively a bit different, I got no more intensity out of snorting it than if I had eaten it. I have a feeling that subsequent doses led to instantaneous tolerance to many of the effects, I believe if I had taken 300mg orally in one dose I probably would have gotten further out than with this 500mg total amount.\r\n\r\nFirst and foremost, this is a good drug, I consider it ahead of Dextromethorphan and on par with 3-MeO-PCP. However, the potency is low and it tends to be subtle, I would peg the gram potency as 1/25 that of 3-MeO-PCP. If its whats available, 3-MeO-PCMo is a fine drug but, I'd be inclined to favor 3-MeO-PCP, 4-MeO-PCP or Methoxetamine over it because of greater potency. The effect is clearly most akin to 3-MeO-PCP and furthest removed from MXE of the three.\r\n\r\nGoing far out on this drug would require doses in the hundreds of milligrams, and since we know of PCP that it's not an overly kind molecule on the liver and kidneys, it might not be advisable with this drug.\r\n\r\nIts good, worthwhile, but the potency is too low, at least in my assay, and there isn't much reward in repeat dosing. I have consumed 500mg and have gotten nowhere near the Hole, while by contrast just 80mg MXE can knock me in there so deep I wouldn't know up from down. The effect came in waves and the waves weren't intense enough to my taste, I would call the current experiment lackluster, at no point during this experiment did I experience intensity beyond that of 50mg MXE, and that only for a short while.\r\n\r\nIt excelled as a feel good drug, really sweet for recreation, but the Entheogenic part, connecting with the Spirit World, was barely touched on. I did not go psychotic to a useful extent, nor did I experience drastic dissociation. It stayed firmly in the mild-to-moderate ballpark.\r\n\r\nFor my next experiment I'm going to let some time pass, then try 300mg oral in one go.\r\n\r\nBE WARNED: My body is not your body. My mind is not your mind. It has been suggested to start around the 100mg level and I want to emphasize to all to exercise due caution.\n\n\n\n\n\nExp Year: 2015ExpID: 106299\nGender: Male \nAge at time of experience: 42 \nPublished: Aug 28, 2015Views: 1,756\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}