{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t 85 mg\n\t\t oral\n\t\t 5-APB\n\t\t (powder / crystals)\n\t\t\n\t\t\n\t\t   T+ 1:30\n\t\t 1 cart.\n\t\t inhaled\n\t\t Nitrous Oxide\n\t\t (gas)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   150 lb\n         \n\t\n\n\n\n\nLast Saturday I purchased 250mg of 5-APB from an RC site in the US. It arrived this Thursday, and I used it for the first time last night. Here's a recap.\r\n\r\nAt exactly 9:00 I parachute ~85mg (give or take 5). Even through the paper that shit was super bitter, but what are you gonna do?\r\n\r\nNow I'm simply playing the waiting game. I watch some YouTube, chill with the small group of friends that I'm with, and eventually go for a walk around the apartment complex. By the time I go on the walk, its 10:15. I'm starting to get a little nervous that I got bunk product (even knowing about the long come up times this class of chemicals has), so I decide to try and kick the drug in myself with the help of some N2O. I do a whippet at 10:30.\r\n\r\nIt worked. Boy oh boy did it fucking work. I was immediately catapulted into the familiar nitrous state of wompy wompy bliss. I'm standing, but I can't feel my feet on the floor at all. I'm floating, with the stupidest fucking grin on my face, and I know for sure now that I didn't get bad product. I decide to take a seat on the floor for fear of falling over, and wait for the whippet to finish.\r\n\r\nIm on the verge of sweating, kind of clammy. I'm definitely feeling this stuff now. Touching my skin feels sublime. I run my hands through my hair constantly, as every time I get a very strong wave of pleasure. Nothing erotic, just good. While touch feels fantastic, I don't actually feel any type of body high as with MDMA. I physically feel completely normal, which is actually a positive for me. I find that while the MDMA euphoria is fucking amazing, it can be a little overbearing and distracting at points. There have been times where I didn't want to talk to anyone because I was simply so focused on myself feeling good. It's a double-edged sword in my eyes. With the 5-APB, that distraction isn't there. My skin feels nice, and music sounds better than normal, but I'm completely lucid. I also have no desire to move and/or dance. This isnt much of a shock since MDMA is also very stoning for me, but this shit is downright sedating. If one wanted to, they could easily just go to bed. I actually dozed off a couple of times, but Ill be damned if Im going to waste a roll!\r\n\r\nA couple people leave, so now its just myself and 4 friends. This is where I can feel the empathy. Earlier there had been quite a few people in the apartment, and I didnt really get the love for them all that you do on MDMA or methylone. Once some of them left however, the empathy shows up and Im starting to feel those deep seeded feelings of love and friendship. I text one of my friends my thoughts and feelings (dont want to say it aloud and make everyone feel awkward), and he reciprocates. The texts he sent back made my night. Just knowing someone feels the same way as you is always fulfilling, yknow? Anyways, as the night progresses I get more and more mushy, until the high reaches its peak around 11:45. Nothing super eventful happens for the rest of the night (although one of my friends ended up eating like 3 bags of popcorn all by himself, and another ate around a dozen cookies within an hour). We just talked and chilled for a while, my favorite thing to do on entactogens. I end up falling asleep around 3 AM.\r\n\r\nIt is currently the next morning, and I have absolutely no hangover. No afterglow either. I feel 100% normal, which is always welcome. I am also glad to say that this was one of those rare experiences that was just completely satisfying. Not that Im always looking for another chance to get high, but I feel no urge to do any drugs for a while. This is only the third time Ive felt this way (first being after my first LSD trip and the second after my first roll), and I like it. It gives me a chance to take a break from everything and just appreciate the experience.\r\n\r\nQuick summary (with numbers!):\r\n\r\nTactile sensations: 10/10. Everything feels orgasmic to touch. Running my hands through my hair is heavenly, and skin is glorious. Never had sex, but it would without a doubt be enthralling while under the influence of this stuff.\r\n\r\nEuphoria: 4/10. Im talking about the body high specifically here. There were a couple waves of pleasure throughout the night, but nothing consistent or mind-blowing. I did get the temporary nystagmus though, which is always awesome. I love when my eyes vibrate, it feels so funny.\r\n\r\nEmpathy: 10/10. Intensity wise exactly like MDMA, if not moreso. I found that I needed the group to be kind of small though. I think anything over 6 or so people would be too much. Anyways. Absolutely no barriers when communicating, Im 100% me.\r\n\r\nBodyload: 2/10. I got kind of sweaty on the come-up, but it went away after about an hour. No other negative feelings.\r\n\r\nA few comparisons:\r\n\r\nTo MDMA: Almost identical, just without the euphoria from the body high. Same lovey dovey feelings but more lucid. Sometimes with MDMA my thoughts get kind of disorganized and it gets hard to string sentences together without getting distracted. None of that with 5-APB. 5-APB also gave me a longer roll, and I think it would have kept going had I not fell asleep. It also feel more..mungsty I guess. Im aware that isn't a word, but thats the best way I can describe it.\r\n\r\nTo Methylone: Much better. I enjoy methylone (probably more than the average person), but it is a very fleeting high I find. Its come-up, peak, come down, with no real breaks in between. The 5-APB was come up (long too), peak, plateau for 5 or 6 hours (assuming you dont go to bed) and then a gentle come down over an hour or two. Methylone has me feeling 150% the next day though, so I guess its better in that regard.\r\n\r\nOverall, this drug is a 9/10 for me. Next time Im going to jump to 100mg, and I think that will put it into 10/10 territory. I didnt think I would be able to find something better than MDMA, but this is possibly it. Smoother, less distracting, no hangover, and its fucking legal. I 100% recommend it if you like MDMA.\r\n\r\nThanks for taking the time to read if you did!\n\n\n\n\n\nExp Year: 2015ExpID: 106213\nGender: Male \nAge at time of experience: 18 \nPublished: Oct 16, 2015Views: 696\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}