{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t 300 mg\n\t\t oral\n\t\t Tabernanthe iboga\n\t\t (capsule)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   110 kg\n         \n\t\n\n\n\n\nSome back ground :\r\n\r\nAt 34, I have been suffering anxiety/depression for nearly 20 years. As an adult it has had a negative effect on my emotional connection and response in relationships. Summarised by me basically ruining relationships by becoming untenable as a partner through shitty behaviour, lack of trust and showing sadness as anger. \r\n\r\nDue to some serious emotional trauma during a custody battle with my ex partner I started looking at alternatives to the norm after the doctor tried to offer me Zoloft, yet again. \r\n\r\nAnyway, 2.5 years later, I have experimented with DMT (Self sourced from local Acacia), Syrian Rue, Blue Lotus etc etc. \r\n\r\nI am not someone you would expect to be interested in hallucinogens, so please excuse my report if tedious or naïve. \r\n\r\nAnyway so after some reading I managed to source some Iboga TA powder and also a pack of 35 300mg Capsules. The idea being to micro-dose the capsules for a short while, then flood dose, with a short maintenance period afterwards. \r\n\r\nI finally got a day to myself last week, my girlfriend was at work and I did not have my son for two days. I was in a reasonably anxious mood, where I could feel that the slightest antagonism might kick off an argument with my partner, knowing full well it was my own head that would cause it. I literally stomped down to the kitchen, took a pill and chucked it back, saying a little prayer to myself that I might find some guidance. (I add at this point, I have done a LOT of reading and communicating with people who know what they are doing, I didnt unwittingly swallow this pill without expecting the side effects).\r\n\r\nAnyway, so I sat on my couch an hour, playing PS4, and realised the day was getting away, so went down to my garage gym to do my daily workout. I distinctly remember that about 90 minutes after the pill, I started feeling detached. I cant really explain it. You know when you stare at something and cant take your gaze away, but your brain is still 100% active/analytical, well thats what it felt like. \r\n\r\nIn the middle of some press ups, I noticed my visuals were  altered. I want to say sheer clarity but also the colour of the yoga mat became super bright. I felt myself sink to my stomach and just stare at the mat, my face inches from it, and getting some real enjoyment from shifting perspective from the mat, out to the open garage door about 10 yards away, which at this point was open and the sun was out, and it was like the outside was so bright I couldnt possibly walk out to the sun. \r\n\r\nI pushed through my exercise, still 100% aware of what I was doing, I felt safe, but the detachment grew. It was almost like I was observing myself, my movements, whilst still completely in control. \r\n\r\nI went about my day, in as best way as possible. When I am on Zoloft, I feel flat. With the Iboga, I did not feel flat, but removed from myself. When my girlfriend came home, we had some discussions that would normally have put me into an anxious mood, likely leading to an argument. I could acknowledge I didnt like the subject, and I could acknowledge which part of my body it came from (stomach) but it was like my heart (I know, sorry) was pulled away from it, and wouldnt react. I was over the moon. \r\n\r\nI decided to wait until the next day and take another, and whilst the initial feelings of anxiety were nowhere present, the feeling of detachment returned. I could still function but this time I almost felt lazy. Like I could move around, go to the shops etc but really would rather just sit and think, so thats what I did. Luckily my partner is very supportive of my journey so I went for a walk around the park. I sat watching kids play soccer for nearly two hours and I suddenly felt and overwhelming urge to see my son. I havent cried in years. I mean years, but I could feel it welling up in me, I all of a sudden felt so proud of my son even though he is just two. I continued to walk and said hello to people, sat to pet dogs etc etc. Nothing trippy in visuals at all, and really felt on top of the world. I still felt lazy but my interactions were giving me so much pleasure. \r\n\r\nThat second night my dreams were insane. I cant really repeat them because they were very personal, but lets just say I was speaking to dead people. Not neccesarily people I knew, just people that were obviously not of this world anymore and it was a really pleasant experience. \r\n\r\nSince then (because I am back at work) I have been taking half, so 150mg of the powder, every 3 to 4 days. I have certainly felt my own anxiety creeping but generally its gone. For the first time in 7 months, I havent argued with my girlfriend for weeks. Because I work away it adds strain on our relationship and this time, nothing. I am looking forward to getting back to do the flood dose when I can find 48 hours where no one needs me.\n\n\n\n\n\nExp Year: 2015ExpID: 106385\nGender: Male \nAge at time of experience: 24 \nPublished: Oct 11, 2015Views: 640\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n",
  "doses": [
    "300 mg oral Tabernanthe iboga (capsule)"
  ]
}