{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t 100 mg\n\t\t oral\n\t\t Ibogaine\n\t\t \n\t\t\n\t\t\n\t\t   T+ 1:00\n\t\t 1.4 g\n\t\t oral\n\t\t Ibogaine\n\t\t \n\t\t\n\t\t\n\t\t   T+ 1:00\n\t\t 1 g\n\t\t oral\n\t\t Tabernanthe iboga\n\t\t \n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   170 lb\n         \n\t\n\n\n\n\nI recently ordered 2 grams of the HCl, and 2 grams of the TA (total alkaloids). I took 1.4g of the HCl, and 1g of the TA. I have a great deal of experience taking psychedelic compounds. I have tried Datura a few times, mushrooms constantly, DMT smoked and ayahuasca, LSD lots, various RCs, mescaline, salvia. I have even mixed and matched 3.5g mushrooms with 6 hits of LSD, then smoked DMT, so I am no stranger to insanity.\r\n\r\nThat said, Iboga was an interesting experience. I don't know if it was worth the risk or the cost. I have seen the posts suggesting it is some kind of miraculous eye-opening experience that changes lives. I would say the only part of people's reports that I related to was the sound of being in a high voltage shed. \r\n\r\nI started by taking about 100mg test dose to ensure I was not violently allergic to the compounds I was about to use. After about 1 hour, I took the flood dose. I set some water and fruit by my bed, a puke bucket, and threw on some Bwiti music I had procured for the occasion. I laid on my back and meditated until all of a sudden, I felt a wave of energy pass through my entire body, and all of a sudden, a loud humming, like standing inside of a large electrical transformer. I felt a wave of energy pass through my entire body, and all of a sudden, a loud humming, like standing inside of a large electrical transformer. It was LOUD and persisted for about 12-14hours.\r\n\r\nI tripped balls for about 10-12 hours, and when I say tripped balls, I mean there were aliens in my room, and people dancing around in masks, and all kinds of weird shit overlaying reality, I was able to sort of clear it away when I needed to get up to use the bathroom (which was a challenge because walking was hard to do, more accurately balancing was hard to do), but otherwise it was really in my face, and seemed real at the time. Unlike other hallucinogens, it left me essentially stuck in bed, helpless, puking, feeling poisoned, and nothing made any sense as far the hallucinations I was having, just asshole aliens sticking their faces waaaay to close to mine, and my dogs became quite bizarre-looking cows with long necks which was startling.\r\n\r\nOnce the 12 hours of mayhem and chaos were through (ZERO TRIPS DOWN MEMORY LANE, AND ZERO COHERENCE WHATSOEVER) I spent the next 24 hours pretty well incapacitated. I felt like I had been poisoned, and I had no balance, to the point I could barely stand up without falling over. I didn't puke until around 15 hours in, but had managed to sip water and eat fruit during my experience, so the puking wasn't horrible. YOU MUST HAVE A SITTER, every other drug on the list above I feel somewhat comfortable doing alone. Not this one, just because of the potential dangers it's good to have someone check on you, and you are pretty useless for a while. It's nice to have someone who could help you if the need arises.\r\n\r\nI would say it is no more effective at solving any of the problems it has been said to solve than Psilocybin really. I was hoping to have the benefit of not craving opioids, but in reality, my break from painkillers lasted as long as the Iboga kept me in bed, at about 36-40hrs after taking Iboga, I took painkillers. Not only that, I found my tolerance remained the same. (I am in chronic pain, and have been taking pain killers for like 7 years, taking breaks instead of increasing dosages has kept me around the same tolerance level for 5 years.)\r\n\r\nPersonally I would recommend it to no one, I had no profound insights (I already practiced meditation for years, and had countless introspective experiences that I would consider profound, so maybe I was scraping the bottom of the barrel anyways). It was essentially just torture, the hallucinations were neutral, not pleasant at all, but not overly traumatic either. It took me about 5 days before I felt normal again, and could see straight, until then I was pretty fatigued while my body recovered. I have since done some micro-dosing, with little to say about that other than it was kinda pointless.\r\n\r\nIn my opinion, for mental health, 3-5g of mushrooms, no more than 3 months apart, so essentially 'every quarter, eat a half quarter' is what I stick with, it stabilizes my mood, and makes me feel pretty even. Iboga, in my opinion is over hyped, and not well understood/researched. \r\n\r\nI do understand the potential use of this drug for addicts, and people suffering from mental illnesses. But like any strategy for change, there has to be a plan in place that covers other areas of your life. This is not a miracle cure for anything, but like other hallucinogens it can bring issues to the surface if they have been buried. \r\n\r\nI will say this though, I'm glad I experienced it, and had zero lasting side effects (or benefits). \r\n\r\nI would say for anything other than addiction, psilocybin, LSD, MDMA, or DMT (Ayahuasca) would be friendlier, and equally effective. I cannot speak for the addiction curing potential, but if it indeed resets the brain, this would be a good thing for a serious addict to consider. It's only worth the risk if whatever problem you are trying to solve is potentially life-threatening.\r\n\r\nAll in all, nothing profound or earth shattering, but as I said, I kinda have my mind in order, so maybe in a different context I would have found it more perspective changing.\n\n\n\n\n\nExp Year: 2014ExpID: 106574\nGender: Male \nAge at time of experience: 28 \nPublished: Oct 12, 2015Views: 916\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}