{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t 150 ug\n\t\t oral\n\t\t ETH-LAD\n\t\t (blotter / tab)\n\t\t\n\t\t\n\t\t   T+ 0:50\n\t\t   repeated\n\t\t vaporized\n\t\t Cannabis\n\t\t (plant material)\n\t\t\n\t\t\n\t\t   T+ 4:30\n\t\t 40 mg\n\t\t insufflated\n\t\t Methoxetamine \n\t\t (powder / crystals)\n\t\t\n\t\t\n\t\t   T+ 8:30\n\t\t 1.5 mg\n\t\t oral\n\t\t Etizolam\n\t\t (liquid)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   160 lb\n         \n\t\n\n\n\n\nI typically only post reports on reddit (/r/mydnmreviewacct for an archive), but someone suggested I submit to erowid, as there are few ETH-LAD trip reports, and fewer with combinations. \r\n\r\nFirst, I want to pre-empt this report with some info: \r\n\r\n* I've done a number of psychedelics and other compounds over the years, in no particular order (but not limited to): LSD (Over a sheet's worth of experience, ranging from single tabs to a 10 strip of ~150+ug), Psilocybin, 4-Aco-DMT, 2C-B, 25I/C-NBOMe, Ketamine, MXE, MDMA (reagent tested), 5-MeO-MiPT (moxy), DMT (non breakthrough, yet, havent attempted breakthrough dose), Etizolam, Nitrous, and stuff I'm probably forgetting.\r\n* I tend to be naturally resistant to psychedelics, so while 150µg of ETH-LAD may be light for me, it may be heavy for others.\r\n* Research before you ingest novel substances, manufactured/distributed from people other than yourself. Please have a test kit, and do allergy tests: you could seriously die.\r\n* Anything worth doing is worth doing right!\r\n\r\nBioassay\r\n\r\nDespite warnings against consuming the substances, as they were sold for research purposes only, I decided to test the ETH-LAD this weekend, so here's a trip report!\r\n\r\nThe plan for the day was to hang out with my girlfriend, test some ETH-LAD, then later on at the end of my trip, I'd dose 20mg 2C-B, and she'd take 5-MeO-MiPT, and we'd fuck (having tested 7.5mg 5-MeO-MiPT, I found it a bit underwhelming, though still good for sex, but I liked 2C-B for sex better. My GF on the other hand LOVED her 3.5mg dose of 5-MeO-MiPT, as she's very sensitive to psychedelics, so this was perfect for her). I'll let you know ahead of time that this isn't what happened, in case you skip most of the story.\r\n\r\nSo at my place, I prepared all of the substances. Weighed out volumes of Moxy, some 2C-B powder, stored some drops of ginger to pre-empt any potential nausea. I took some magnesium as a muscle relaxer. All as just precaution for tripping. I've never thrown up on any substance yet (The closest so far was on a 10 strip of ~150µg LSD which I probably won't ever do at that dose again. Wasn't bad, just not something that needs to be repeated) but sometimes I do get some annoying muscle tension.\r\n\r\nThe plan was, I'd drop 1 tab of 150µg ETH-LAD, and we'd catch a ride to her apartment which has more activities for tripping. I dropped the ETH-LAD at 2:38 PM (I started taking notes, although I knew this would stop once I was really tripping). I held it sub-lingually, and decided I'd swallow after a half hour.\r\n\r\nThe notes sum it up best, so I'll list them until they stop then pick back up:\r\n\r\n* 2:38pm: Start\r\n* 2:54pm (T+0:16): initial come-up tingles.\r\n* 3:03pm (T+0:25): Funny feeling in teeth\r\n* 3:06pm (T+0:28): Swallowed tab\r\n* 3:08pm (T+0:30): Calves feel funny\r\n* 3:15pm (T+0:37): Definitely coming up, gonna take a quick shower\r\n* 3:27pm (T+0:49): Out of shower, still only coming up\r\n* 3:29pm (T+0:51): Started smoking weed\r\n* 4:59pm (T+2:21): Sex over\r\n\r\nIt's worth noting a few things at this point. One, my gf and I have been passing out before we get to fuck the past few days. Two, I have a high libido sober. Three, EVERY psychedelic I've tried makes me horny. Four, summer time magnifies my libido by a LOT, and I've been voraciously hungry for sex.\r\n\r\nBasically, we lay on the bed at 3:29 and smoked out of my vape, which I think I loaded with a small piece of pollen press hash I made, in addition to the weed it was loaded with. We smoked and cuddled up, and soon enough we were playing with touch, making out, playing with each other, etc. I then proceeded to fuck her probably harder than I ever have in my entire life. I usually have pretty good control of my orgasm, but now I had COMPLETE control of it. I could freely enjoy the pleasure without worrying about cumming, and if she had enough, I could finish right then and there. The sex was insane. I also forgot to mention I took sulbutiamine, which is something like a analogue of B-vitamin that athletes take for energy/stamina. I pounded away to the sound of the music, occasionally alternating rhythms and angles. I don't know how many times she came, but her bed was soaked with squirt (its not unusual for her to squirt, but this is a lot). I literally felt like an unstoppable fuck machine.\r\n\r\nWhen she seemed tired, I decided to cum, and blew one of the biggest loads I have in a while. She was literally laughing at how much I just kep cumming. I collapsed next to her, and caught my breath surprisingly faster than I would. At this point I was pretty much full blown tripping, and realized the ETH-LAD had given me somewhat of a trip sort of tunnel vision which I think allowed me that extra control. She toweled off and we laid in bed for a bit, touching.\r\n\r\nTouching lead again to more touching, kissing, and then I look at her, and I was like 'Are you not exhausted?' She smiled and shyly said 'not really.' So I responded, in some what joking, somewhat serious manner, 'Do you want more dick? I can give you more dick' to which she laughed and said yes.\r\n\r\nSo I climbed on top of her again, grabbed the lube, and started slowly again. I like to use the music as a guide, as you can divide the rhythms into half notes, triplets, etc to increase intensity as the music goes as well. We're both very in tune with music, so I find this works really well for both of us. I was careful not to get too fast back into it, to really savor the feeling of being inside her, and also to build up some tension for her to want me to increase intensity again, rather than forcing it on her cause I know she just took a pretty hard pounding.\r\n\r\nWithout getting too much into the erotica zone, we eventually ended up back at full throttle and it was just as intense as the first time, except now I'm also really enjoying the sensation of tripping as well. She's now got the hitachi, and I'm pounding away, and her orgasm(s) take on a noticably different quality which I seem to be extra in tune to. I adjust angles and push it even further. After she comes down from her orgasm, she's noticably limp, so I take this as note to finish up. I pull out and cum again, and I swear to god I came just as much as the last time, which, guys will know, is rare to cum even half as much if you had just came even like an hour prior. Her and I were both notably stunned. \r\n\r\nShe laid back, limp, and told me that if I had told her that I had given her a dose of 5-MeO-MiPT, she'd believe me, because she felt like she was high/tripping. I don't know if somehow she got a small bit of ETH-LAD from my mouth (I made sure not to kiss her until well after I had swallowed the tab) or if I had just dicked her so hard that I brought her on my level, but it was entertaining and felt quite congratulating for me. She WAS a bit stoned, but she def said she felt a bit trippy, which isn't normal with her as she has smoked much more weed in life than I have.\r\n\r\nThen, with little warning, she became incredibly overwhelmed with emotion, and began crying. I tried to comfort her, and she assured me it wasn't sad tears, she was just overwhelmed with feelings. I've heard of this happening, but haven't seen it in person before.\r\n\r\nAfter a minute she had calmed down, and we just snugged up in bed a bit. At this point I reflected on ETH-LAD's effects on me. I think the descriptions of it so far are pretty on point. It's moderately visual, definitely less visual than 300µg of acid, but definitely more than 100µg or maybe even 150µg of acid. There is far less mind fuck going on, but it is present nonetheless. The colors were all pretty much primarily rainbow based (as opposed to one or 2 specific colors that some drugs do, I find acid to be a lot of red and green usually). I would say this is like an acid-lite. Previously I would use this to describe 2C-N ('acid light plus MDMA, but also different') but I would say this is heavier on the trip than 2C-B, but lighter than acid. This is just my one subjective experience.\r\n\r\nThe body load wasn't too different than LSD's. The set and setting was good and my mood that day was positive, and this seemed to reflect the vibes I got from ETH-LAD.\r\n\r\nIn terms of 'spirituality,' I feel like ETH-LAD has a high potential for spiritual use, if that's what you're into. Very similar in terms of LSD's quality, but I'd want to increase the dosage and have a separate setting for that kind of use.\r\n\r\nWe lay in bed, I clearly still had energy, but my gf was quite exhausted. I got water and a bit of food while she rested. After a bit, I told her we should go outside, cause we only have so much more sunlight left to enjoy (it was a BEAUTIFUL day). It took some coaxing, but eventually she managed to get up and ready. I was pretty much dressed at this point so I laid on the bed with my shoes on (for shame, me!) while she cleaned her makeup that I'd wrecked, and got clothes on.\r\n\r\nWe headed out to the park just in front of her apartment, which is a really nice park on a waterfront. There were tons of families out that day. I became really preoccupied with what the fuck all these other people were doing in the park. It seemed like there was an unusually high amount of people there, but everyone looked like they had nothing to do with each other, but it looked like nobody was doing anything in particular.\r\n\r\nI began to think, wtf do people do at parks? Like, is the plan just to exist in the park for a bit? How do you know when that 'activity' is over? It's not like I haven't done this, my brain just got really wrapped up in this whole cultural concept of doing mostly nothing.\r\n\r\nThere was a salsa festival with a live band playing in the distance, and I became acutely aware of the way it reverberated, 100s of feet, down the part to me, and each shift of my body and location warped the audio. It sounded like something shpongle would do (some of Simon's songs have a very hispanic influence), like taking a salsa sample, and flanging it around with some weird delays and moving it around the stereo field. It was pretty cool.\r\n\r\nWe stopped at the dog park for a bit, where we saw my favorite kind of dog, the Shiba Inu. I'm like obsessed with them. We watched the shibe run around the park and play with other dogs. I felt like every other dog was black or white, but this shibe was very bright red, almost like a fox, a bit more red than your typical 'tan/red' shiba. It was very well groomed.\r\n\r\nI felt like this shibe was sort of the king of this side of the park. It would inspect and 'approve' new dogs. It would initiate play with most of the other dogs, but not the other way around.\r\n\r\nThe other half of the park had a whole bunch of people in jeans or khakis and blue shirts. I SWEAR TO GOD I thought they were some kind of uniform, but it turns out just like 10-20 dog owners just all wore the same fucking thing. It blew my mind. This one guy was bouncing a ball and his black poodle was going NUTS over it. The poodle jumped with each bounce. I could feel my mind entering/simulating dog brain. This dog was completely hypnotized by the ball. When the ball went, the dog went. The dog got the ball, brought it back and was ready to begin the ritual again. It was just bizarre to see dogs from this perspective.\r\n\r\nEventually, after looking at enough dogs and their owners, I began to get the feeling that there were all these really awesome, extremely well groomed dogs, with the most boring vanilla looking owners walking them. My brain began to imagine that maybe these people are just really boring or have depressing lives, and use the dog as a replacement for their personality. This is an entirely superficial thought based on their looks and I realized that, but tripping brain sometimes just sends you through thought patterns whether they're logical or not, you know?\r\n\r\nAfter exploring that thought branch a bit, I decided to move away from the depressing thought and we decided to venture away from the dog park towards the salsa band.\r\n\r\nThe band was interesting, there were some people salsa dancing. We decided to sit in the grass, but I felt like we were around too many people, were up to even more nothing than everyone else, so I had the feeling that we just looked weird sitting in the grass. It also got really hot in direct sunlight so we decided to get up and find shade or go in.\r\n\r\nWe walked past the dog park again, but the shibe was gone :( We walked along the water towards her apartment. We passed all sorts of middle aged moms, and I felt that as a 25 year old dude I just didn't quite fit in around all these families. But the weather was great and the park looked beautiful.\r\n\r\nEventually we made it back inside, and decided it would be a good idea to hit her building's pool. It's there, why not use it? Plus the weather was still nice. At this point I'm well beyond the peak, and its not like the peak was too intense anyways.\r\n\r\nWe change into pool gear and head over. The pool is outdoors on the roof, overlooking the aforementioned waterfront, which is such a sweet view. We hopped in the water and it was like everything I ever needed in life. I never knew I wanted to be in that pool so badly until I was inside.\r\n\r\nWe mostly just kinda floated around for an hour or so, enjoying the weather and the coolness of the pool. Sometimes I'd carry my gf around, sometimes she'd carry me. There was one funny part where these adults were carrying their babies around the pool, and my gf was carrying me around, which I found internally very amusing. There was another kid outside the pool looking at us really funny while we were doing it, which only made it funnier.\r\n\r\nI kept thinking that the pool looked 'so vapor wave,' which my girlfriend (appropriately) made fun of me for. I was trying to say that the lightly waved water reflecting the buildings around looked like rendered water you'd typically see in vapor wave art, and the sun cast a glow on the whole area that gave it that sort of hazy tint. My girlfriend remarked that 'anything with water to you is vapor wave' and also that 'you know you've gone too far in computing when you're now trying to intentionally render bad polygons (etc)'. That last sentence isn't actually what she said because what she said actually made no sense in english, but I understood what she meant, and that's more or less the gist of it.\r\n\r\nThere was this weird guy on the side of the pool, who had headphones in and appeared to be on a call the whole time. At first I figure, a lot of business people live here, so its not that weird. But the longer we hung at the pool, the more I heard bits and pieces of conversation, and I began to realize, that this guy was honestly not on the phone with anyone, and was just having an egregiously loud public phone conversation that just didn't make sense.\r\n\r\nNow that could have been me tripping, but I told my girlfriend who was much more sober than I, and she said that the more she thought about it, the more it seemed I was right. The guy left before she could hear enough to be sure, but I swear at this point I just had some medium visuals with very little head fuck.\r\n\r\nI just felt like every time I walked by he'd start up the conversation again like 'Oh yeah so umm... uhhhh...' literally multiple times. Nothing he said was ever of any substance. Eventually he was very loudly saying, while sitting up now (he was laying in a beach chair) 'oh yeah! I'm just sitting by the pool! Enjoying this BEAUTIFUL day! Yeah it's SO cool! You think I should keep enjoying it? Haha!' and stuff like that, and then a few minutes later, he was practically shouting 'This is the best day of my life! woo!'\r\n\r\nI don't know, it was weird. But as a few families (with kids) left, eventually this guy left with little noise. Maybe my tripping brain is drawing too many conclusions (as it tends to do) but it was at the very least DEFINITELY WEIRD.\r\n\r\nThe last weird thing happened when we ventured over to the designated 'laps' side of the pool. Its a side restricted for people who want to use it for exercise, but it nobody is around, you're free to use it. So we were using it for a while, just wandering, until all of a sudden, this old lady appeared and was doing a lap and almost ran into us (she wasnt there before, and we were in there for like 10 minutes before this happened).\r\n\r\nWe apologized, and moved to the other side. It was really weird because she seemed very fakely apologetic, saying like, 'Oh, no, you can stay over here, I don't need the whole half to myself! I swim in a very straight line!' while I was already apologizing saying no worries, that we shouldnt even be over there when people are doing laps and we'll be on our way. It just seemed like she was being very passive aggressive, and instead of asking us to move, she just decided to go ahead and swim into us to make us move. But whatever, I was 100% on avoiding any confrontation so I just pulled a Canadian and moved my GF and I to the other part of the pool.\r\n\r\nWe then got out and dried off, and headed back to the apartment. This is sort of the point where, if I wanted to do a 'booster' of 2C-B, it would be now or never unless I wanted to be up all night. We discussed and decided we fucked pretty damn hard earlier, so our planned fuck fest with 2C-B/5-MeO-MiPT would be a bit wasted if we did it now. So we decided to fuck as is (her sober/stoned, me lightly tripping) and do that another day.\r\n\r\nLong story short since this story has enough sex, was it was some really good sex, not as intense as before, but probably better than our average, and she was pretty done for the day afterwards. Also notable that I came just as much, if not more than most previous times. I have no idea how to account for this.\r\n\r\nShe browsed reddit for a bit, and I decided I could get a bit more out of my trip if I did some of my MXE. So I weighed out 40mg, then split it into 4 lines of ~10mg (I prefer to titrate my mxe experiences 10mg at a time). I did a line and asked if she wanted to play (computer) game.\r\n\r\nI set up the game, but at this point, she hopped into bed and seemed like she wasn't gonna get up. So I went over and snugged a bit, did another line, and just played with touch sensation as she struggled to stay awake. It was hardly 9pm maybe 10 at this point. I wasn't about to sleep but she was just exhausted.\r\n\r\nAfter snugging for a bit, she seemed fairly asleep, so I hopped on over to the game.\r\n\r\nI haven't been a HUGE fan of MXE up until this point. It's been okay but not great. However, I feel like MXE *really* shines when adulterating another trip, now that I've experienced.\r\n\r\nIt was like, if you consider ETH-LAD to be a linear space, and MXE to be another, separate linear space, the combination created a now 2-dimensional plane of psychedelic space to explore. Mentally this was much more fascinating than either alone.\r\n\r\nI decided I'd play the game I'd set up. The game is called Antichamber. If you want a game to play while you are tripping, dear god THIS IS IT.\r\n\r\nThe game is a psychological puzzle game. The graphics are very basic. Mostly white with black lines, and occasionally bits of primary colors, and this very basic graphical style is part of what makes it so trippy.\r\n\r\nI'd watched a playthrough of this game a year ago and despite that, this game STILL caught me by surprise, every time. I was playing it on a 4k monitor with the configs adjusted to go up to my native resolution, so I was basically absorbed in this game. I think I had my third line of mxe at this point (30mg total).\r\n\r\nThis is the kind of game where you can walk forward, then turn around, and whatever is behind you is NOT what you walked past. You could make 4 right hand turns and end up somewhere completely different.\r\n\r\nThis game was endlessly entertaining for my trip, and I'd highly recommend it, as long as you're not tripping too hard. The game doesnt require a huge amount of motor skill, its mostly puzzle based, so it's fairly tripper friendly.\r\n\r\nI eventually stopped after the first major landmark (which I was surprised how quickly I got it), cause my GF wanted to cuddle. I shut the game down and we cuddled a bit, but I knew I was not about to fall asleep. It was maybe 11pm at this point. The ETH-LAD was just barely there and the only reason I could feel it was cause of the MXE, I believe, which makes ETH LAD about an 8-10 hour experience for me, 8 if you dont do MXE.\r\n\r\nI layed in bed more, and fely like by brain was huge. My brain felt almost like it was pouring out onto the bed, which was interesting. It also felt like my brain could affect my girlfriends, as I changed thoughts, her tension in bed seemed to change. After being awake for a while, I grabbed 1.5 mgs worth of etizolam solution I'd made, mixed it in some OJ, drank it, and passed out with my GF.\r\n\r\nNot much else I'd like to add. Like I said before, my perception of ETH-LAD seems about in line with what others have experienced: visual, less mentally demanding. Like a lighter LSD. I highly recommend MXE at the tail end, I wish I'd tried just a bit maybe an hour after peak actually. Definitely has spiritual potential if that's what you're looking for. Didn't note any particular physical side effects. Typical psychedelic afterglow the next day, nothing bad. Music was very enthusing and enhanced similar to when I take acid.\n\n\n\n\n\nExp Year: 2015ExpID: 106623\nGender: Male \nAge at time of experience: 25 \nPublished: Jul 14, 2015Views: 3,098\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}