{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t   \n\t\t  \n\t\t DXM\n\t\t \n\t\t\n\n\n\n\nThis is a retrospective on my report I wrote 15 years ago, which you can read on Erowid, titled '24 Hours of DXM'. I recently came back and re-read my report I wrote and wanted to provide some perspective.\r\n\r\n\r\nReading this report 15 years later, the fist thing I think about the most is what the social consequences would have been for me if my parents had found out. Years later as an adult I did discuss my drug experiences with my dad, but if he would have found out about it then things would have been rough between us. \r\n\r\nI do still remember that night, but not very vividly, and reading the report now isn't much different than reading someone else's report. It has only a vague personal sense of connection to me and I don't recall the hallucinogenic details at all. While it seemed really bad at the time, it quickly became something humorous to look back on; I certainly didn't have any sort of traumatic negative results to my psyche as a result. There's also a sense of accomplishment - I did something crazy and scary and got away with it and really expanded my world as a result \r\n\r\nI ended up taking numerous other psychedelics after this, including DXM again quite a few times, but I never again took DXM at this high of a dose. Future DXM usage was mostly with polistirex - that stuff was a lot of fun, easy to get, and easy to dose. I mostly had good trips but there were times on other substances that I got anxiety about the trip going too far. I think it's just part of my nature to worry a bit too much. \r\n\r\nI have a family now, mortgage, real job and all that and I still really enjoy psychedelics and I'm glad I experimented with them when I was younger. They definitely changed my perspective on things for the better. I think as an adult I'm more aware of other people's feelings, and of the ephemeral nature of my own feelings and my own perception of reality. Despite this difficult experience, DXM helped me get into psychedelics and got me comfortable taking others that I now find more enjoyable (tryptamines!!). At this point, I would never take DXM at psychoactive levels again - it was a sort of challenge and exploration thing that doesn't need to be repeated. \r\n\r\nI'm proud to have contributed in this very small way to Erowid!\n\n\n\n\n\nExp Year: 2015ExpID: 106741\nGender: Male \nAge at time of experience: 32 \nPublished: Aug 3, 2015Views: 2,603\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}