{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t 1.3 mg\n\t\t oral\n\t\t DOPR\n\t\t (liquid)\n\t\t\n\t\t\n\t\t   T+ 2:17\n\t\t 1.25 mg\n\t\t oral\n\t\t DOPR\n\t\t (liquid)\n\t\t\n\t\t\n\t\t   T+ 0:00\n\t\t   repeated\n\t\t oral\n\t\t Alcohol - Beer/Wine\n\t\t  \n\t\t\n\t\t\n\t\t   T+ 0:00\n\t\t   repeated\n\t\t smoked\n\t\t Cannabis\n\t\t  \n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   160 lb\n         \n\t\n\n\n\n\nDOPr Trial #1 \r\nby Xorkoth\r\n\r\nA short time ago I managed to receive a substantial stash of DOPr in powder form, from the same place that the recent DOPr blotters going around were originally from before being resold.  I decided spur of the moment this morning to take my test/low dose.  I have a 4mg dose planned for next weekend.  \r\n\r\nMy state of mind is very good today, I just spent a wonderful night with my girl and woke up sluggish but happy.  Everything in my life is going great, I'm doing stuff I am passionate about every day and I have an extraordinary amount of personal freedom.  The setting is at home by myself, at work.  When I got home this morning, I made solutions out of some of my DOPr, DOiP, and DOF.  The DOF appears as a fluffy white powder that smells very much like other fluorinated amphetamines.  Of that one I made a 10mg/mL solution.  The DOiP came in powdery but solid rocks that could be easily picked up without breaking with a pair of tweezers.  Of this I made a 5mg/mL solution.  The DOPr looks surprisingly similar to 2C-P (or 2C-E), but more solid and crystally.  It came in white (almost slightly yellowish depending on light) snowflake-like crystals, sort of powdery and sort of crystally (as opposed to 2C-X flakes which are entirely soft/powdery, these are more crystalline).  Of this I made a 1mg/mL solution.  I have some 1mL oral syringes I got free at my local pharmacy, that have .1mL large markings and even 10 subdivisions of each of those, so I am able to measure 1mg/mL solutions to 10ug accuracy, with any scale inaccuracy spread evenly over 30mL or so.  I strongly recommend going this route if you plan to work with potent chemicals like any of the DOXs.\r\n\r\nI knew I had to work today but I felt comfortable taking a low dose.  Also later in the evening I have band practice, and I'm hoping this will provide a sparkle that will be beneficial for that.\r\n\r\n8-18-15 at 10:20am - Ingested 1.3mg of DOPr in solution, first dose ever taken other than a miniscule allergy test (.25mg) right after I got it that had no discernible effect.\r\n\r\n10:49am - Faint alerts?  I feel sure this will provide some sort of low-end experience.  Not surprising since it seems roughly half as potent as DOC or a little more, and even .5mg of DOC provides a sparkle for the day and even sometimes very light psychedelia.\r\n\r\n11:30am - Definitely a small effect now.  Compared to DOC it is actually significantly nicer.  Early stage DOC has some jitteriness/sweatiness and usually feels a bit overwhelming if I'm sitting inside working like I am now, even at a low dose like this.  There is also a lot of excess energy with the DOC come-up, even at low doses.  But this low-dose DOPr feeling is extraordinarily comfortable.  I feel in a good mood, and the physical feeling is calm, smooth, and velvety.  Really quite nice.\r\n\r\n12:05pm - No real development but it still feels great.  Work is not impacted in any way, in fact my patience is improved.  I think in a while I'm going to go work out, but for now I am going to eat some chicken curry... appetite is not affected.\r\n\r\n12:37pm - Just ate, it was very satisfying.  I decided to take 1.25mg more of DOPr because this is so nice, but I'd like to see what it's like a little more developed.\r\n\r\n2:25pm - Just got back from working out; the workout went great, I did deadlifts, chest presses, rows, triceps, biceps and abs, plus ended with a farmer's walk/shrugs.  I felt strong and healthy and I had more strength and stamina than last time by a very noticeable degree (though I just got back into it after 2 months off so it's natural I'd be gaining strength back quickly).  The buzz has increased for sure, it's more of the same but stronger.  I feel a little bit like I'm on a drug but really it's more similar to that LSD sort of feeling where it almost doesn't feel like a drug when you're not deep in, but more like a natural state that is different from usual.  It's really so comfortable, almost like a blanket wrapped around me, a very light and unconstricting one that's as soft as can be.\r\n\r\n3:14pm - Took BP: 156/72, 80bpm.  Wish I would have thought to do it beforehand.  I rarely take my BP so I'll try to remember to try again tomorrow or the next day when I'm baseline.  I also worked out recently and was just washing dishes so I'm going to try to lay down for a bit sometime and take it again.\r\n\r\nThis feels very serene, I am calm, collected, happy and I feel good.  Nothing about this feels at all alarming.  It's also quite clear-headed.  I'm navigating work projects and work phone conversations with complete ease.  The redose has made it a little more drug-feeling, but it's still entirely pleasant and welcome.\r\n\r\n4:25pm - Just took a shower which was nice.  This feels a little more psychedelic now, though there are no visuals.  I'm thinking this really takes longer to come up than DOC by a substantial bit... which would make sense.  Trying to finish up some work stuff, it's still not impacted but I do feel like I can't wait til work is done now, and I can get over to band practice.  Took my BP again, this time it's 133/66 and 79bpm.\r\n\r\n6:16pm - Work got crazy and I got out a bit late.  Despite the increased amount of tripping, it was still easy to navigate but it did get a little stressful.  However, it would have been stressful anyway, trying to finish up 4 things along with some emergency requests by the end of the day.  Anyway, it's over now and I'm heading to band practice.\r\n\r\nNext day reflections and summary\r\n\r\nBand practice went very well.  I had a blast and felt creative, though it was not my best practice (but still a great and productive one).  I'm not sure if that was due to the DOPr though, as I felt it was easy to focus and I didn't feel any impairment of my motor functions.  I of course spent lots of time hanging out too as the band members are my best friends in town, and my other best friend in town lives there too.  I was in a great mood for that and quite articulate.  I ended up drinking 2 40oz ~5% beers over the course of a few hours, plus one more regular size beer, so about 8 12oz beers (which is something I do with some frequency, when I go to band practice).  \r\n\r\nLike with DOC, alcohol mixed well, though the combination was less satisfying than it is with DOC.  I suspect that the relative lack of stimulation of DOPr as compared to DOC prevented that additional alcohol tolerance from happening, so I got pretty drunk by the end of those beers.  With DOC it takes a long time to get fully drunk and there seems to be a synergy between it and alcohol; with DOPr there was no apparent synergy, even though it felt nice and was enjoyable.  At about 2am I went home.  I watched some episodes of the Simpsons, Bluelighted/moderated a bit, and fell asleep.  Sleep was good, except I overslept a bit and fortunately did not miss anything at work.  I slept about 7 hours.  \r\n\r\nThis morning I feel fine... I can perhaps still detect a bit of the body buzz but otherwise I feel normal.  I just took my BP again, and now it's 135/60 at 72bpm (I took ~150mg of caffeine when I woke up so it's probably still a little higher than baseline, but I also took the same amount of caffeine yesterday when I woke up, a bit before taking the DOPr, so the comparison should still be valid).  So it seems that DOPr does increase my BP and HR slightly, but not by much, at least at this dose.  Sometime I'd like to take my BP on DOC for comparison purposes, but I can say with some certainty that DOC makes me more stimulated than this by a good margin.  Also, DOPr did not cause me to sweat at all, whereas DOC always causes hand and foot sweat during the first half (I am prone to this however).  I have tried DOT/aleph-1, DOB, DOC, DOI, and DOM, and this seemed less stimulating than all of them.  Currently I'd say DOPr and DOC are tied by a huge margin for my favorite DOXs over the others.  There are things I like better about each of them but they seem to fit in nicely with each other.  DOI and DOB seem much rougher to me, and less enjoyable, and DOM is just less exciting to me than either.  DOT was strange and I only tried it once but didn't like it very much.  I have by a tremendous margin the most experience with DOC out of the DOXs, as it's one of my very favorite drugs, which is why I compare the two so frequently in this report.  Plus I just find them to have more similarities to each other than to any of the other DOXs.\r\n\r\nOverall I really loved my low-dose trial of DOPr and I look forward to my next dose (which I think will be 5mg now, after this trial, in a week or two).  I found the body feeling to be even better than DOC's.  I really enjoy how DOC feels but a drawback of it is that you can feel it a lot more in your body, as an electric energy sensation.  This is great for hiking and other physical activities but it can become uncomfortable in other situations, if it doesn't have an outlet.  DOPr, however, did not give me any excess energy at all.  I was able to sit still and be completely comfortable.  And sleep at the end of the night, even after longer than the time that had elapsed since taking the DOPr and sleeping, can be quite difficult due to this excess energy.  DOPr really didn't seem to give me any extra energy, though I was certainly focused and awake.  The body high was entirely comfortable and felt quite good, and sleep was as easy as usual (at least after that number of hours, plus alcohol).  The ease of everything was very nice.  Nothing felt threatening or uncomfortable the whole time.  I was better able to navigate socially and professionally than I am with DOC, though I am able to do it pretty easy usually with DOC.  \r\n\r\nThere are two things I like about DOC better.  The first is that it provides more of a direct euphoria.  DOPr's euphoria, at this dose, was more of a zen-like calm feeling where I felt extremely content and at peace.  perhaps that will change at a higher dose.  The other thing is that DOPr felt more or less the same the whole time, it just slowly ramped up and down in intensity.  DOC on the other always produces a more full-on trip in the first half, and then levels off into one of the greatest states I know how to achieve on the plateau stage, where I become, for lack of a better term, a dynamo, socially, mentally, and emotionally.  Sociability was unaffected and fun for the entire duration of this DOPr trial, even the come-up, but the plateau stage of DOC makes socializing much more satisfying than I felt at any point with DOPr.  DOPr does not seem to have this same magical plateau stage shift in effects, though it's possible it will at a full dose.  However I suspect not, as DOC produces this effect for me regardless of dose.  I can't speak yet to a comparison of the psychedelic nature of the two, as I feel at this dose the full nature of the effects never developed.  One other thing I noticed is that the come-up of DOPr was much smoother and longer than DOC's come-up.  With DOC it really begins a bit like a rocket right at about 1 hour after taking it... the come-up happens pretty quickly and can be disconcerting if I'm not focusing that energy and attention on something engaging, even with quite low doses comparable to this dose.  With DOPr it began slowly and calmly and continued to build over several hours, but at no point did it feel intense or uncomfortable.\r\n\r\nAlso I smoked weed at several points throughout the experience, and it mixed fine.  No synergy or anything, at this dose.  I got high though and it felt nice.  When I get my testing reagents I will post some reagent results as well.\r\n\r\nI hope you found this report on a currently quite rare DOX substance useful.  I'm happy to contribute it and I will be contributing at least two more in the future, when I try my 5mg dose and then probably an 8mg dose (depending on how the 5mg dose goes), to get a broad spectrum of the ranges of this chemical's effects.  I definitely will not do either of these doses while working, I only did that because I knew it would go fine at this dose (or I was as sure as I could be), and I know myself and psychedelics very well.  So far it seems like a real gem and I'm excited to experiment further!\n\n\n\n\n\nExp Year: 2014ExpID: 106861\nGender: Male \nAge at time of experience: 32 \nPublished: Oct 9, 2015Views: 999\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}