{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t 330 ug\n\t\t oral\n\t\t 1P-LSD\n\t\t (blotter / tab)\n\t\t\n\t\t\n\t\t   T+ 3:00\n\t\t   joints/cigs\n\t\t smoked\n\t\t Cannabis\n\t\t (plant material)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   70 kg\n         \n\t\n\n\n\n\nI had gone out clubbing with a good friend; not that wed known each other for a long time, but wed been to some festivals and had certain experiences together, and so were definitely on a wavelength. We got inside and went straight to the smoking area to drop  he took one 100ug tab, and I took 3.3: specific, yes, but it was in line with a personal philosophy I was working on. Such an exact number was intended to add layers of insight to my trip.\r\n\r\nWe hung around in the smoking area for what must have been about 45 minutes  about as long as we could bear the smoke filled air. We just sat and waited to come up, chatting to a few people who were around us, eventually heading inside.\r\n\r\nThere were two rooms; pink and funky upstairs, blue and techno down  or something like that. We went back and forth a couple of times but settled on the downstairs room. The music was quite good, quite heavy too  among the acts in the venue that night were skream, surgeon, artwork, and jasper jones.\r\n\r\nWe found a spot and attempted to settle in, in terms of claiming a space so that we actually had room to dance. Quite often it got congested for short periods of time, but at this point I was pretty much just standing still even when I did have room to dance. In my mind, I would not force myself to dance and make moves just because it may have been expected of me  I was coming up quite strongly and I was more than happy to just stand and feel everything wash through me. I also found it quite funny in terms of perturbing peoples expectations  my feeling was that I will dance when a beat or rhythm makes me do so; a lot of people seemed to be trying at least a little bit too hard, as the beat hadnt gotten that deep yet  but I expect a lot of people were on MDMA and so had that surplus energy that could only be released by mindlessly jiggling glow sticks.\r\n\r\nI had tried 1P-LSD a few times before at lower doses, and this was an attitude very much in line with the substance. It makes me very efficient; precise with my words, and dis-inclined to make unnecessary movements. It seems like a very potent self-analytical tool, quite pure and un-biased too. It is in a sense quite cold and robotic, but only compared to LSD, perhaps. It is not dissociative from the human state, like say methoxetamine, which I would also describe as robotic; but very true to it  like emotions get in the way of correct examinations. I would estimate that delusions or dysphoria would be harder with 1P-LSD, simply because the nature of the experience is very clean and exact. The visuals are crystal clear, razor sharp, and scintillated, but certainly not melting or wavy as is the case with many other psychedelics.\r\n\r\nSo after standing for some time, enjoying the music all the while, I gradually began to throw in the odd dance move, maybe over the space of about an hour I went from only standing to only dancing (except for when people got in the way and stood in front of me, at which point I would stop everything and stand like an insolent lemon until they moved). My reflexes to the beat seemed superhuman whilst on this compound. I may as well have been the source of the music, so seamlessly was my movement matched with the beat. I began to engage in stretching, mostly my spine, more and more, so that it was barely still dancing  say 49% stretching. But what was magical to me was that whenever I finished a stretch, say I leant back then came all the way forwards  when I touched the ground, the beat would kick in. Every single time. I was absolutely synched with the rhythm, and this whole experience was like some next-level yoga. I worked such deep and minute areas around my spine with my funky chicken pop-lock-and swivel dance moves I feel like Ive built up a whole new and inner core of muscles. By the end of the night I was absolutely clear of blockages, walking like an actual upright human being, rather than a sloucher. As well as the fact that I was synching in dance with my friend, Im not kidding, we absolutely ran the show. Slipping back to the corner of the room over time, we were like the cornerstone of the pulsating mass of humans, holding it all together. I didnt stop for anything, until it became apparent that it was an auspicious time to go, at which point we slipped upstairs as seamlessly as we had arrived. This was after maybe 3 hours.\r\n\r\nWe went a retrieved my weed from a hiding spot outside the club and went to a quiet spot to smoke. This got very drawn out as he basically had an emotional hissy fit with me over the fact that I very rarely spoke and that I should be more considerate to him  I managed to explain over the course of about an hour that it is because he is a good friend that I know he knows what my intentions are already, and there is no need for me to waste time with words, when we were basically communicating on more subtle levels as you do with psychedelics. He proclaimed the n-word quite loud because I think he was scared about being in the area, but as per our whole conversation, I explained that saying what you think is not always the best course of action. Some unsavory locals began to mill around us after this, and we left in quite a hurry after having finally smoked. I left my bag of weed though, which, on a spiritual level I was fine with (I always seem to shed the heavier drugs) but I was annoyed with him because I felt it was his fault for making a scene, and that I would have liked to be in and out much quicker and more efficient. I did not realize I had left it til later on though. And the cosmos in fact rectified it as the bike police came and took his weed later on. I was annoyed until this happened. There was nothing serious in terms of his record.\r\n\r\nWe got the nightbus back towards our homes, which I had planned out beforehand. It turned out to be one of the new hybrid energy buses (London) and I will definitely remember it as it was the first time I had been on such a bus. The seat covers were for a new age  very 1P-LSD if I do say so. Smooth, shiny, and with a psychedelic lattice pattern. We sat and reflected. I slid down into my seat more and more until I was sitting right forward, and when the bus went over a bump it got that last little crick in the smallest, lowest part in my back  the 33rd vertebra. I moaned involuntarily and a wave of comfort washed over me. This was the same as the last trip Id taken when I went out to the forest and partook in some stretching, and on the way home in a taxi a car rear ended us, producing the same effect for my lower back. Cosmic stuff indeed.\r\n\r\nMy main revelation on the bus was that I am now in fact evil. I have just tipped over to the dark side, but this did not worry me as I understand duality to be an illusion. My understanding of how society is held together by essentially evil acts became elucidated. At a fundamental level, the Alpha of the group needs to slaughter animals for food. This is surely not nice for anyone, but it is a good thing considering the longevity of the group. I extrapolated this thought out into everything Ive read about the upper echelons that are the controlling class, from everything from war to social control, and I was OK with it. I too am on their side now, because I deem my self illumined and initiated enough. It was clear talking to my friend, and this is not the first time I have thought this, that I no longer have any equals in my immediate circles (though he is advancing!). Generally and often, I know what is best, yet people rarely listen to me because I seem so hapless, based on the fact that I dont dance just because youre supposed to, if that analogy makes sense. I dont make any pretense for anyone, but I am very intelligent, plus all my meditation, psychedelics, yoga and reading, and I am miles ahead of anyone I know in terms of personal enlightenment.\r\n\r\nAnd so this is it. I was into eastern spirituality a lot with acid, and so got very close to veganism. I became too skinny and upon further reading discovered that not only was there a genetic component to diet, but that vegetarianism in the west was isolated to cities, and was promoted for social control. The white / European culture is built on meat eating, more so than other races. Perhaps thats why people say the whites are evil  and perhaps we are. But again, I understand duality, and I know that the white race has brought a great number of advancements to the world and humanity also. So, here I take my place as a proud, initiated member of the white race. I eat meat because it is optimum for my health, and I am happy with sacrificing certain animals to re-appropriate the raw materials into my being. I am confident enough that it will not be in vain. I realize I must take more of a leadership role with my peers. Too long I have assumed that everyone is the same, but I realize with clarity now that different classes and races are raised in such different ways it makes for whole different character constitution. I realized with more clarity than before the fact that there is most likely no other  all that the whole situation is, is enlightened humans keeping other humans in line for the greater good. I think immortals probably run the world. If I was designing the human experience, it would be mostly sandbox as it is, but I would definitely write in a function of being able to obtain immortality given a heightened enough self awareness. It makes most sense to me.\n\n\n\n\n\nExp Year: 2015ExpID: 106904\nGender: Male \nAge at time of experience: 22 \nPublished: Aug 24, 2015Views: 5,634\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}