{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t 2 hits\n\t\t  \n\t\t 1P-LSD\n\t\t (blotter / tab)\n\t\t\n\t\t\n\t\t  \n\t\t   \n\t\t smoked\n\t\t Cannabis\n\t\t  \n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   82 kg\n         \n\t\n\n\n\n\nNo one really thinks about what happens after an acid trip, mild or otherwise. They seem only to focus on the trip and want/hope to see weird and wonderful things and with no real physical side effects. Sounds fun. But what about psychological side effects? \r\n\r\nYou read other people's experiences and you may think what you are going to feel or see will feel will be merely a dream. At the beginning it seems pretty predictable, what you expected, happens. The feeling of euphoria, seeing things so much clearer, the mild colour waves distorting your vision, concentration practically impossible, seeing geometric shapes so fantastic it literally takes your breath away but still aware.  Personally I had to concentrate on remembering to breathe as well as a watery nose and eyes to begin with. But it was what I expected and was loving it... Until, at my peak, I had sex.\r\n\r\nThe most intense pleasurable feelings all over your body like you never thought possible. Feeling the other persons energy course through your veins and your energy in theirs. Seeing the angelic glow around them and seeing into your own soul through their eyes. The orgasm was something out of this world, truly indescribable so I am not even going to try. And as always, a joint after sex is only natural. And by this point I was having waves of normality, assuming I was sobering up like my partner. \r\n\r\nBut then reality snapped without warning. \r\n\r\nLooking out over the balcony, seeing the grass and trees (but not the buildings or people) like psychedelic waves so vivid then I questioned everything. And I mean everything. Things I have never even thought of before. Like what is reality? What is this we are living in? (Trying to remember this experience is making my head feel tingly like someone's tickling my neurons, odd?) I was trapped in an endless, deteriorating existence. Time lapses repeating over and over again with little bits altered, as if it was a game and I had to find the odd thing out. Only being able to communicate in short sentences without knowing what was coming out of my mouth until I heard it. Seeing my loved ones faces change into a morphed beast that was barely still humanoid. Being told the trip is ending over and over again and coming to the conclusion life is just an acid trip inside an acid trip. My mind was melting in a terrifying whirlwind like water down a drain. I begged God for help. I tried so hard to grab what I have always seemed to be normal life. But my brain just would not allow me to grasp it. Every time I thought I was back and the trip was over, it would slip away from my conscious mind and hurl me like a plummeting plane in flames back to my own personal hell. The fear is what still haunts me. Never in all my days have I felt that level of terror, but once I stopped trying to fight the fear, it disappeared for a while and I felt just confusion again. Then slowly it would creep back and fill every fibre of my body.\r\n\r\nThis kept coming on it waves in a place where time no longer existed. Never knowing when it was going to be over, if it was going to be like this for eternity. One minute daylight, blink, and its night. Close a door then open it only to find the light come on by itself. I finally accepted my fate. I had come to the conclusion that I had gone insane. I told myself this is what it is like to be mad. Something had disconnected in my brain and would never be back to what was. The panic hit me so hard, like a mountain on my chest, I melted in with everything then crawled into a ball while trying to cry but couldn't and then it was gone in an instant. This could have taken 30mins, 5 seconds, I still have no idea. Time just did not exist. Trying to describe that is impossible too. \r\n\r\nAfter accepting this, I also accepted death. Yes. I was no longer afraid to die. It was and still is inevitable, so why fear it? It may have been the fear or the acceptance of insanity, but it was so freeing. Like I could breathe again for the first time, or had been underwater for the last 25 years and finally reached the surface.\r\n\r\nAll I could think about was my partner. It was the only thing my mind allowed me to keep a hold of while everything was getting worse and constantly changing. This alone is the only thing that kept me on the brink of letting go completely. I have come to the conclusion that what I feel for him is something I will keep feeling for the rest of my life and even into death. I always thought of him as my soul mate, but a very tiny piece questioned it when things got rough in the relationship. But now, I truly believe that he is part of me. The emptiness and destitution when he isn't with me was always proof that he makes me whole. He makes me happy. \r\n\r\nFeeling true belief is something I have never felt before. I believe in many things, like atoms are real, dinosaurs were real and the evolution happened for example. But those are logical. Having a belief in something that is not of this world, never to be proved with our five senses is something I thought I knew. I assumed what it felt like, but nothing feels like this new TRUE belief. It is simply unquestionable. Once I accepted the fear it seemed to open up my feelings and my mind to things I have always wanted to know but my conscious mind was never going to come to a conclusion. But now I know. Now I believe in true love. I am so much more peaceful with everything.\r\n\r\nAt this point I should make you aware that I have been diagnosed with multiple mental health problems, anxiety, depression, PTSD to name a few. This meant that every day for the past 8 years I have felt panic, sadness or irrational anger without really understanding why. I had good days and bad. But after this trip I have yet to feel anything but calm. I could never in a million years tell anyone, not even my partner whom I trust, love and respect, anything that the voices in my head were saying and making me feel. I desperately wanted to let him in and hope he could help, but I couldn't. Any time I tried it would feel like a physical lump in my throat that blocked my words and I always knew it was never going to get better unless I talked about it. Yet now I can say anything without the guilty feeling over unloading my burden with complete honesty and openness even though I do not feel the need to. I have never felt this calm before, a bit like what you assume a spiritual enlightenment may feel like. It's nice :)\r\n\r\nReceiving this peace happened gradually the next day after the hungover effects wore off. I could still see everything in vivid HD and even see the energy from the grass and trees while outside just to see the sun rise. It made the headache bearable. It was nowhere near as colourful as before but more like a faded picture over a normal one. Caffeine seemed to stimulate the visual illusions until lunch time, but I wasn't afraid, I knew it wouldn't last for much longer. Now it has all stopped and all I am left with is this calmness I have been craving for so long. I don't know how long it will last but for now I am truly enjoying it in case it too fades like the colours. \r\n\r\nWhat I have written is merely a blip in what I experienced. Until you can tap into my memories and see what I saw, or improve the English language, it will just have to stay untold.\r\n\r\nTwo tabs for a beginner is a bad idea. I can honestly say I will not be doing 1P-LSD again. It is not for the weak-minded or weak-hearted. It is not like a dream at all, like I assumed. You become nothing but a mind in a puppet with no way out. I had a bad trip with a happy ending. It was one rollercoaster that I can say I have ridden, got my T-shirt so now I can get on with my life with a clearer mind and soul.\r\n\r\n*This was originally written for a forum. [Partner's report. ]\n\n\n\n\n\nExp Year: 2015ExpID: 106975\nGender: Female \nAge at time of experience: 20 \nPublished: Oct 7, 2015Views: 1,909\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}