{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t 2 hits\n\t\t  \n\t\t 1P-LSD\n\t\t (blotter / tab)\n\t\t\n\t\t\n\t\t  \n\t\t   \n\t\t smoked\n\t\t Cannabis\n\t\t  \n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   76 kg\n         \n\t\n\n\n\n\nI have never experienced a drug quite like 1P-LSD before, so please bear with me here as it's incredibly difficult to put into words and accurately portray what happened.\r\n\r\nI'm not entirely sure of the timeline as time was soon forgotten, but for the first couple of hours after taking my first tab I began to feel very tipsy and then quite drunk, and was overcome with a fit of the giggles like I haven't experienced since I first started smoking cannabis, only far more intense. Not long after taking the second I began to see some of the colours on the TV changing colours quite subtly, but I soon lost interest in watching it and put some Led Zeppelin on. I was expecting a lot more at this point than I was feeling, and whilst I did feel very happy and the music resonated with me deeply, I wanted more and wanted more visuals and so I was beginning to feel a bit let down that I wasn't getting it at maybe four hours in or so and after two tabs. \r\n\r\nAt this point Mrs Fry [see Mrs Fry's report] and I went to lie down in bed, and I discovered how incredible it felt to rub my body against the sheets, all of my nerve endings all over my arms and legs were tingling and felt as though they were electric. I can only compare it to getting goosebumps from being cold and rubbing them to warm up, except much more intense and to the point of being almost sexual in terms of pleasure. It wasn't long before she and I we were both naked and exploring each others' bodies like it was the first time, the whole time staring into each others eyes and seemingly communicating telepathically. It felt like I could see into her being, her soul, and I could see nothing but the sheer natural beauty of a pure-hearted woman that loves me unconditionally. In turn it felt like she was staring into mine and had stripped away every defensive layer I have built over the years, and could see into my inner child and the core of who I am. We understood each other completely, overwhelming and we both cried with happiness. Without a doubt it was the single most joyous experience of my life and I will be forever grateful to have had it. \r\n\r\nWe returned back to the living room and I was standing on the rug when I noticed how amazing it felt on my feet and started to stretch my toes, I looked down and saw the rug was rippling under my feet like it was responding to my movements. Eventually I managed to sit down and roll a joint, which must have taken 20 minutes to make and looked a bit ragged in the end. Then Mrs Fry says I should check and see what 'my wee forum people'* are up to lol so I get the tablet and we're lying down on the rug, my leg is still going all the while, and I looked at the tablet and the letters from everyone's posts were sort of floating on the page and wiggling up and down like they were enchanted words. The normal light green background was changing all sorts of colours, a bit like a slow Christmas lights sequence. I didn't even bother to try reading anything as the words were to fascinating to concentrate on whole sentences or paragraphs. Eventually I got to the bottom of the page and brought up the keyboard which is normally black/grey with white lettering but this time it was changing colours that reminded me very much of the old Windows themes, it shimmered and waved on the screen then would ripple like a drop in a pond with every touch I made. \r\n\r\nSo post made, I hit the next tab over which was still on an image search of Alex Gray art.... WOW!! This is going to be the most difficult part to explain as words cannot convey what I saw in that art work. I will do my best to try and give you my best impression of the picture I explored the most and felt very deeply about. Ok so after seeing this picture on the 7' tablet, we both decided that the screen just wasn't enough, we needed more detail, more information. I fired up the Xbox on the 50' HDTV and got the image back up, we were only sat about 2 feet away and both gasped when the image loaded on the screen. It utterly blew us away, literally took our breath. \r\n\r\nThe picture was a version of Alex Grey's painting, 'Dying':\r\nhttp://alexgrey.com/art/paintings/soul/dying/\r\n\r\nEvery tiny minute detail in this picture had deep meaning and was just as important as the larger more obvious focus points. The man here was just as alive as you or I and we could feel him dying, and see his energy was diminishing. His soul was leaving for another place and the eyes were all watching over his body and soul to make sure his journey would be complete. The eyes would constantly be changing colours and the iris morphing into different shapes like there were beings inside them stretching in a sack. I really can't do it justice with the  English language, it was far too complex and absorbing to be able to type out accurately. \r\n\r\nWe spent what seems like a very long time looking at lots of Alex Gray's art, absolutely captivated every time,  but the pictures started to become still again and I knew I was headed for the end of my journey. I rolled a fat joint and just chilled smoking and thinking about what had just happened and what it meant for me. I questioned myself very deeply and I am still doing so now. I'm not going to get too much into it as it is quite personal and still confusing, but I feel like I've been able to look at myself, my personality and behaviour, and make a new judgement on what I should and shouldn't be doing in my life in terms of social interactions and reactions and my views on certain things. \r\n\r\nI've been left with a lot more questions than have been answered, and I feel that 1P LSD could be a very powerful tool to explore a lot more of myself, my life and my interpretation of life. However I also feel it has the potential to be have very adverse affects if not taken in the right frame of mind or in the right setting. Will I be taking it again? Yes, I probably will. It will not be without a good break inbetween trips though, I feel it has the potential to not be as beneficial if taken often, though this is just speculation.\r\n\r\n*I originally wrote this for a forum but it was suggested I post it here.\n\n\n\n\n\nExp Year: 2015ExpID: 106974\nGender: Male \nAge at time of experience: 20 \nPublished: Oct 7, 2015Views: 1,637\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n",
  "doses": [
    "2 hits 1P-LSD (blotter / tab)",
    "smoked Cannabis"
  ]
}