{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t 83 mg\n\t\t oral\n\t\t 4-AcO-DMT\n\t\t (powder / crystals)\n\t\t\n\t\t\n\t\t   T+ 8:00\n\t\t 6 carts.\n\t\t inhaled\n\t\t Nitrous Oxide\n\t\t (gas)\n\t\t\n\t\t\n\t\t   T+ 8:00\n\t\t   \n\t\t  \n\t\t Etizolam\n\t\t  \n\t\t\n\t\t\n\t\t   T+ 0:00\n\t\t   \n\t\t  \n\t\t Alcohol - Beer/Wine\n\t\t  \n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   190 lb\n         \n\t\n\n\n\n\nHmm, where to begin with this one.   I'd taken 4-AcO-MET several times prior to this experience, once at a slightly higher level.  I have not experienced the kidney problems others have mentioned.  My friends who have had kidney issues do not drink, I do.   My suspicion (although unverified) is creation of Methanol in large enough amounts at some point during metabolism to cause the kidney pain.   For these people, it also acts as a strong diuretic.  \r\n\r\nSince I drink beer very slowly, the Ethanol may actually be acting as an antidode.  The other possibility is the fumarate salt being metabolized poorly, although this seems unlikely given the quantity it exists in in many foods. \r\n\r\nThe above is just speculation anyway, and not important to the trip, but the reports of it are disturbing.  \r\n\r\nPreface\r\n-------\r\nI have found 4-AcO-MET to be a almost universally pleasant trip, with very strong CEVs evolving at lower levels and taking over completely at higher levels, along a lack of the dysphoria that Mushrooms / 4-AcO-DMT cause for me.   The timeline isn't listed, because I wasn't paying attention to it. \r\n\r\nSet & Setting\r\n-------------\r\nI was in my apartment with a good friend C. from work, as well as A, who had never tried a psychedelic before but did smoke marijuana from time to time.  Dose schedule was ~83mg 4-AcO-MET (Fumarate salt) for me, ~80mg for C., and ~60mg for A, measured on a +/-1mg accuracy scale.  Although 60 seems high for something this strong, A. also weighs over 300 pounds and we were concerned that there may be weight dependence in the dose, as being a tryptamine you would expect more MAO as weigh goes up.   \r\n\r\nAs you read the below please keep in mind that I consider this the best trip I've ever had.  \r\n\r\nThe Trip to Confusion \r\n---------------------\r\nFrom the start, A. made me uncomfortable.  \r\n1) This wasn't suposed to be happening that night, and I hadn't slept the night before.  The insomnia is a standard thing for me, but I prefer to be well-rested for trips.  \r\n2) We had eaten large amounts of Korean BBQ earlier.\r\n3) It was already probably too late in the night. \r\n\r\nWe decided to put on a Rifftrax of one of the old Star Trek movies.   A. was calling out everything that was going to happen 5 minutes ahead of time, which was particularly annoying me.  I was also being constantly asked odd questions and for a blanket (the apartment was ~70 degrees), which I unfortunately couldn't provide because it was in the wash.    \r\n\r\nAt some point I entered that downward thought spiral that most who have tripped have entered before, and became confused.  I realized that I had been working in a job I find not only painful in the mental sense, but immoral.  I remembered all the lies I'd been told about a promotion.   I used to make stained glass windows, and other than the boss I loved it.   To create an object of beauty is a good task, and doesn't make my brain hurt.   I finally couldn't take the movie anymore and things started getting weirder.  \r\n\r\nA. kept demanding a blanket I didn't have, and eventually said he was leaving.  That's when I sort of lost it.  It's an unspoken rule that the trippers are in for the long haul, and he was planning on driving to his hotel (I'm strongly against driving on *anything (except prescriptions and marijuana)*, let alone something Alice-In-Wonderland level).  I don't drive, myself, but marijuana for a heavy smoker should not prevent problems on the road.  \r\n\r\nI began to sob uncontrollably, and told both there that the last thing I ever wanted to do with my life was software engineering.   During the time I took the job, I was  suicidal over having to put my cat to sleep, and they were offering my more money than I was used to.  I went into deep thought cycles;  should I quit the job now and move to a cheap apartment?   No, that doesn't end anywhere good.   A. was trying to convince me that I was an important member of the company the entire time, and that I could be creative there, but that was an easily ignorable myth.   I hadn't programmed anything that ended up in-product in a year, partially because of sudden time rushes, and partially because there's a sort of Catholic Nepotism at our job, and you can't be a manager without the Church. \r\n\r\nC. was quiet during this time, because he had been through this sort of trip before and knew I needed to work it out myself.  I was focused on an old fiestware glazed ash tray in the middle of the room, and started to realize my body parts were melting into everything.  My arm was the carpet, or the arm of the chair I was in.  It was a level of ego loss I'd only *thought* I'd experienced before.\r\n\r\nThe negativity spiral continued for a while, until I could talk without crying.  A. was a little floating spaceship head at that point, with pincer arms growing from his ears.   Seeing that I was calmed down, he eventually left, and despite multiple promises to not drive, he took his car to the hotel with him.   That alone took him off of my list of people who are allowed to do substances of any sort with me.  At the time it was that he drove, later that he wouldn't answer messages (worrying us further), and I finally realized it was the lie that did it. \r\n\r\nC. stayed around a bit longer and had his own interesting experience.   While standing up talking to me, he said this his body broke into pixels, moved one inch on the x-axis, and rotated 90 degrees on the time axis, then reassembled itself within almost no time.   He could feel each pixel as they moved.  I've found that 4-AcO-MET can cause weird 'shifts' like this and is more likely to cause synesthesia for me than many other substances.   From pleasure from sound, to watching waves form in the carpet from talking, to severe pain.\r\n\r\nC. eventually went home and went to bed (although reported having horrible flashes of being thrown through a wood chipper sometimes). \r\n\r\nAdventures In Hell\r\n------------------\r\nThis is strongly related to other difficult experiences I've posted on here, so it may or may not be worth reading those.  None of the others were so direct. \r\n\r\nAfter C. left, I decided to do some nitrous.  I can't say why, other than that it was around.   The following descriptions were visual and tactical. \r\n\r\nCanister 1 -- I ended up in a hellscape, laughing at someone's misfortune.   I turned around just in time to see that it was me, which a large sword, and had my upper torso cut in half at an angle.  I could feel the pain from this.  This repeated for a small infinity, another me behind the other slicing them in half, always laughing, always turning my head at the last minute. \r\n\r\nCanister 2 -- Back in the hellscape.  I wasn't laughing anymore, and I knew to turn around to find me holding a high powered laser, burning my eyes out.  Then, unable to see, I would be cut in half again. \r\n\r\nCanister 3 -- This seemed to last longer.   Every time I tried to escape the cycle of self destruction, a new method of torture was devised.   Each of these lasted for around several hundred iterations.  I knew the pain was coming from my head. \r\n\r\nCanister 4 -- This time, I tried to knock myself out with the nitrous.  I had actually managed to hold my breath long enough to pass out from it, but I said aloud, 'Wake up'. \r\n\r\nThe Love & The Light\r\n--------------------\r\nCanister 5 -- I realized that the only way to escape this hell was to love myself enough that I wouldn't harm the other me.  At this point, a bright light opened up above me and I was able to approach it via sort of translating there.   I understood this to be the light of god.  I saw the connection between all living beings that was love, and that this love was in all of us.  All of the hell had been in my mind.   There was no communication this time, but at that moment I received an understanding that there was no harm to be had from this Light & Love, and that was what I should be doing all along, that so many problems would fall away.  Once recognized, I can always return to the connection. \r\n\r\nCanister 6 -- I needed confirmation that this wasn't just another spiral.  This time, I ended up huge beautiful space with the light above me.   I saw five chalices, each representing a religion that was being problematic.  The White Light of Love was being filtered as if by a prism into each chalice, and flowing over and being wasted.   Hebrew characters appeared on each chalice, and I was given a non-verbal message that the religions needed to make peace and see the True Light and not their chosen color before the world could progress much further.  Without being able to read Hebrew, I guessed that the religions were Christianity, Islam, Catholicism, LDS, and another I couldn't name.  \r\n\r\nAt that point the light tasked me with trying to tell them about this experience, which I am still meditating on how to do properly.  LDS and the less crazy sects of Islam would probably be most accepting of the vision as they have not discounted the modern prophet, and LDS are in most ways a peaceful church already.  Their problem was presented as minor.  The other three I recognized present much larger problems, but I will still try when I feel I can speak the particular church's religion with their scholars and find the right people who will listen.\r\n\r\nThe Endings\r\n-----------\r\nI made several major life-affecting decisions that night.  I meditate now, and have achieved something like Zen, although I don't study any one religion.  My mind is clear and can be whenever I wish, because there is no internal conflict when one speaks the truth as one understands it.  \r\n\r\nI decided to buy a house that night with the advice of C.  With a horrible credit score and several other things that went wrong, this was to be a test of my patience and self control that allowed me to achieve the peace mentioned above.  The house was needed for the workshop I'm creating.  \r\n\r\nI bought the tools I needed for stained glass window manufacture the following week, had a house by July, and now practice Shaolin wushu every day, although because of my location I have no master.  I have to imitate what I see on training videos on youtube, but that only makes it more challenging.    I've dropped about 25 pounds, and even though my current work is something I don't believe in doing, I was able to find a way to cope with this as well.   \r\n\r\nI am much happier now than I have been in years, although because of the meditative state people mistake it for sadness often.  I smile when my good friends make me smile, and am still sad when sadness is required, but the emotions are like dust in the wind that can be used as I please.   \r\n\r\nA lifetime experience as an agnostic / atheist / SubGenius taught me to distrust god as a superstition.   I can no longer do that.   The problem stemmed from me looking for god in all the wrong places, when a tree or a cat will suffice.  I don't evangelize, although I do tell those who will listen about the experience.  It captivates people for some reason, maybe because most I know can't pull anything functional out of that deep a trip.   \r\n\r\nAs the great Ian Anderson of Jethro Tull fame once sung: \r\n\r\n'People -- what have you done --\r\nlocked Him in His golden cage.\r\nMade Him bend to your religion --\r\nHim resurrected from the grave.\r\nHe is the god of nothing --\r\nif that's all that you can see.\r\nYou are the god of everything --\r\nHe's inside you and me.'  -- My God, Ian Anderson w/ Jethro Tull\r\n\r\nSometimes the truth can be so simple you miss it entirely, even when it's staring you right in the face.  \r\n\r\nThe Continuance\r\n---------------\r\nThe famous quote (was it Leary?) that 'Once you get the message, hang up the phone.' has never been one for me.  There is always more to learn.  \r\n\r\nLove & Light\r\n--FlowGnome\n\n\n\n\n\nExp Year: 2015ExpID: 106962\nGender: Male \nAge at time of experience: 34 \nPublished: Oct 6, 2015Views: 630\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}