{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t 50 mg\n\t\t oral\n\t\t MIPT\n\t\t \n\t\t\n\t\t\n\t\t   T+ 0:45\n\t\t   \n\t\t smoked\n\t\t Cannabis\n\t\t \n\t\t\n\t\t\n\t\t   T+ 1:00\n\t\t   \n\t\t smoked\n\t\t Cannabis\n\t\t \n\t\t\n\t\t\n\t\t   T+ 1:50\n\t\t   \n\t\t smoked\n\t\t Cannabis\n\t\t \n\t\t\n\n\n\n\nI am still on this substance as I type this, so please excuse me if anything I say is somewhat difficult to follow. I wanted to get as much of this down as I could while I still remember it.\r\n\r\nBasically, what I have to say about MiPT is that I was shocked by how great it was for me.... I think that's important to get out there now because most of what I'm going to be doing is just raving about it. This was only my first time with it, so I don't know how it will be on repeated use and I don't know if this was what I could consider a normal experience or anything, but with that all considered, it was pretty amazing. I actually want to say it was definitely one of my best trips ever.\r\n\r\nMy previous experience with psychedelics includes psilocybin mushrooms, LSA seeds, bufotenin, DMT, LSD, 2C-B, 2C-I, 4-AcO-DMT, 4-HO-MET, 4-AcO-MET, 4-HO-DET, 4-AcO-DET, 4-HO-MiPT, 4-HO-DiPT, 4-AcO-DALT, DiPT, DALT, and at least a couple of unidentified things like psychedelic amphetamines and suspected TFMPP.\r\n\r\nT-12:00 - I was thinking quite a lot about taking this one for the first time the night before due to my and my friend's recent experiences with DiPT, combined with the fact that I was really feeling the itch to experience something similar to DMT even if it was not exactly DMT itself. While trying not to set any solid expectations, I was kind of hoping that MiPT would at least have some of the peaceful, easygoing feelings of DiPT for me while still retaining more DMT-like qualities to it.\r\n\r\nT+0:00 - I get out of bed and immediately take 50 mg of MiPT. The taste is much milder than expected from experiences with other synthetic tryptamines, but it was still nasty. I used a fiber cookie to wash it down in hopes that this might also help my stomach later on.\r\n\r\nT+0:15 - First alerts came in here, a definite tryptamine energy growing up throughout my body as I move around. I start feeling most tryptamines around this time, so it's not surprising. My first thought is that it does indeed feel similar to DiPT, in that it feels much more 'heavy' than a lot of other tryptamines, less likely to cause things like jitters and shakes.\r\n\r\nT+0:35 - I have been working through just a little bit of an ordeal here. The body feeling has still remained remarkably easy to handle compared to the other tryptamines I'm used to, but despite that it's still harder to handle than nothing at all and I do have to talk myself through some things. I could definitely see how people not used to psychedelics could get anxiety from this onset, but it's really quite easy compared to almost anything else that will still feel that intense at the same time. Ultimately, what I start to realize is that this is the build-up to a purgative type of trip; I quickly run to the bathroom and release what little I have inside me. There was very little nausea leading up to this, I just knew that it was something that was going to have to happen for me to move forward. I felt much better right afterwards, so much that I almost thought I wasn't even tripping anymore, for a minute or two.\r\n\r\nT+0:45 - At this point I decided to take a hot shower, and to start smoking a bowl of cannabis while I'm in there. This is where things started really picking up.... I could already tell that this feeling creeping up in me was as powerful as from any other hyperspatial tryptamine; my imagination and the edges of my vision were already being flooded with hints of very bright and colorful imagery, completely on the level I would expect from a close analogue of DMT. The visuals in the center of my vision were less distinct, being mostly blue, green, and yellow distortions, but they were honestly still fairly active compared to many tryptamines I've taken. Even DMT honestly doesn't do much more for me than this with eyes open on most occasions, it's more about what goes on behind them. With this in mind, I closed my eyes to let the water wash over my head and was immediately shown the very beginnings of visions forming, such as the edges of detailed faces turning to the side through the non-distinct shapes, and immediately got excited for what was to come.\r\n\r\nConceivably some time around T+1:00, though at this point I was in too much of a rush to care, I decided that the shower was a nice effort, but my body was starting to feel overwhelmed from movement like DMT or DiPT and I decided that all I really wanted to do at this point was lie down and meditate, possibly while listening to music. I managed to struggle against the relaxation and the growing sensory garbage flowing in the corner of my eyes enough to dry myself off, do some slight grooming, and get back into bed. At that point I believe I also took a couple more hits of cannabis, and then relaxed into the bed for just a moment. After getting a feel for whether I should guide this trip or let it guide me, I figured that it probably wasn't going to get hugely more intense on its own by this point and decided that music seemed like an excellent choice for the moment.\r\n\r\nAnd wow, how great it was. I started putting on songs I listen to by various female artists, and I immediately noticed a strong music enhancement of the kind I am used to getting from LSD, and just recently from 4-AcO-DALT. However, that had just been a taste of the same kind of thing.... This was easily as great as my best experiences with LSD, if not even sometimes deeper. It reminded me of experiencing music enhancement for the very first time, back in my younger days when cannabis, MDMA, and psychedelics were just wonderful new discoveries to me, and every note of every song sounded impossibly deep and complex on levels you can't fathom how you never noticed before. It was breathtaking to say the least, but that was only the very beginning of it. Shortly into my first song, the visionary effects of the MiPT really started making themselves known.\r\n\r\nIt started with feeling an empathetic connection to the artists, one of feeling every emotion they sing with flowing through me as if it was my own, and upon that foundation grew the ability to project entire perceptions into my field of experience. At first I was merely emotionally overwhelmed, and the visions consisted mostly of widely repeated swirling bodies and hands, usually the artist's but not always, and then they started turning into entities who I could feel guiding me through this powerful feeling. The first song I listened to had a longing, nostalgic romantic feeling to it and I felt my perception of my body dissolve until it left only my heart which was glowing and took on something of a biological clockwork machinery appearance, and suddenly it was surrounded by loving entities who were holding it up and carrying me through the heavy emotions with feelings of compassion. This allowed me to release myself into them at full force, which sent me more fully into an out-of-body feeling with watching beautiful, colossal geometric patterns shooting out from myself from a remote perspective along with my sense of emotional release, all while my body I saw falling towards the ground up from high in the sky, the clouds rushing by, and seeing my clothes flowing in the wind around me. The next song I listened to was more playful, but I also knew it better, and the visions actually started organizing themselves into an actually structured and logical (but still quite psychedelic) music video to play along to it.\r\n\r\nThese things continued on and I listened to as much music as I could to get the most of them, as I was really in awe. At this point, they really felt equal to me to DMT in terms of realism and intensity (strength of the dose considered), and I found the coloring highly similar to DMT as well, but at the same time there was also two very distinct qualities to it that DMT lacks for me: a feeling of pushing everything, geometry and visions alike, into hedonistic extremes, which I identified strongly with 4-HO-MET, and a very noticeable erotic vibe to the imagery and female entities which I would describe as burlesque, which I specifically associate with 4-HO-MiPT. All of these qualities essentially combined to make it the most intense combination of visual, emotional, and sexual overload I have ever experienced, to the backdrop of music enhancement which, again, I was enjoying at least as much as LSD. And yet, despite this intensity, mentally I felt extremely calm and collected, with no significant mind load except for the occasional therapeutic spontaneous observation about my life or my behavior, which actually felt extremely deep in their own ways as well, definitely what I'd hope for out of a tryptamine. And just to top it all off, aside from still feeling a little too heavy to move comfortably, I had no side effects of any kind, not even some shaking like other tryptamines, but my body in general felt fantastic and slightly electric when I just relaxed into it. I was pretty much in a state of bliss, and I really, really didn't want it to end.\r\n\r\nT+1:35 - But, alas, it did. By this point I could tell that my music visions were no longer going as deep, and that part of the experience was starting to pass. Most of the open eye visual effects had started fading by this point as well, at least in terms of distortions. My body still felt kind of heavy when I tried to move it, and just a little sweaty and alien like DMT can make me feel, but aside from that I mostly just still had that lingering body energy and definitely a good amount of music enhancement still, but not as much as the peak. I used this short time to try to orient myself and think about the start of the day, since I was still technically just lying in bed in the morning.\r\n\r\nT+1:50 - I still feel positive that most of the heavy tripping is over, and decide to just keep listening to music for a while. It still sounds deliciously deep. I smoked a little more cannabis at this point, but I think it was mostly gone from me hitting it during the visionary phase, being still just that one bowl.\r\n\r\nT+2:00 - Another noticeable drop in intensity, but I still feel good. The body feeling reminds me of a 4-HO-MiPT at this point, with a little less muscle tension. Music still great.\r\n\r\nT+2:30 - I first start typing some of this down, but while watching letters appear on the screen as I type them I see ancient-looking wheel patterns with abstract art faces in them exploding outward from each position, which surprised me as I had thought the visuals were mostly gone. I feel a little overwhelmed and decide to do something else for a little while longer first.\r\n\r\nT+3:00 - I ended up eating some cereal because I could tell that my stomach was not happy with me taking a drug on an empty stomach and then making myself even more empty, and still not replacing it with anything for a couple hours. I still felt a little funky afterwards and had a brief stomach ache, but it has resolved itself not that much later. I also noticed at this point that I had a slight headache like I would've gotten from smoking a bowl of strong cannabis that quickly in the morning without the MiPT, but I very distinctly hadn't noticed it during the peak. This is similar to LSD and most other psychedelics really as long as they have me feeling good.\r\n\r\nNow, as I write this, it is T+4:20, and I still feel really awesome. My stomach and head now feel fine, and aside from a lingering relaxation from the body high, I have an energy to face things during the day. Overall my body still feels how I would expect it to feel after 4-HO-MiPT, but a little more relaxed. Music is nowhere near as enhanced as it was earlier, but it's still much more than I would expect it to be from just being high, and I really hope it lasts quite a while through the day! Visuals however are totally absent by now, except for maybe just things like slightly stronger afterimages or visual snow.\r\n\r\nOverall, I really have to say that I wasn't expecting this AT ALL. I had wondered if people were maybe undervaluing MiPT by the dose, but I had no idea it would be like this. It was pretty much exactly what I had hoped for, and then even so much more; if this is actually a consistently reproducible kind of experience on this substance for me, I have very little doubt that it will go on to be one of my favorites, or possibly even just the favorite. I am compelled to call it that already but don't allow myself to say such things after a single experience, but I do have to say that this trip gave me an even better first impression than 4-HO-MET, which is the only other psychedelic that I currently consider to be hedonistic on a similar level to LSD.\r\n\r\nIn the future, I will consider this dose the bare minimum. I imagine that I would start seeing some truly fantastic things at between 75 and 100 mg, and very dearly hope to find out some day soon.\r\n\r\nThere is not nearly enough love for this substance. I personally expect to be singing its praises for a long time to come.\n\n\n\n\n\nExp Year: 2015ExpID: 107087\nGender: Female \nAge at time of experience: 24 \nPublished: Oct 21, 2015Views: 697\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}