{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t 25 mg\n\t\t oral\n\t\t 2C-B\n\t\t \n\t\t\n\t\t\n\t\t   T+ 0:45\n\t\t 15 mg\n\t\t oral\n\t\t 2C-B\n\t\t \n\t\t\n\t\t\n\t\t   T+ 1:00\n\t\t .25 mg\n\t\t oral\n\t\t Pharms - Alprazolam\n\t\t \n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   200 lb\n         \n\t\n\n\n\n\nSome background:\r\n\r\nI'm a 26 year old male with multiple sclerosis (MS is more aggressive in men). I have had it for about 4 years and it is getting worse, albeit slower than it could be, but is extremely unpredictable and there is always a lingering possibility I could not be able to walk next week. But at the same time for now it is aways so distant and easy to not think about. I look perfectly fine to others unless you'd know what to look for. I've never really dealt with this in a real way emotionally because of this. I can always deal with it emotionally in 10 years when I need a walker. Now is meant for doing things I will never be able to do in the future. This has resulted in my pushing away in the worst way possible my stable and grounded girlfriend of 3 years that had no real accomplishments other than hurting her. \r\n\r\nMy personality craves control, I am an engineer with an engineer mindset and a workaholic, everything is analysable and everything can be manipulated or understood if you just know how the the parts move. I attempt to control others in a weird fatherly way because it makes me feel powerful and respected. This urge has turned out really good sometimes for the people who are seeking that stability, girls with father figure issues, friends seeking advice, but not always. I really think it's a high in of itself but it is unhealthy. I am very open minded I'd like to think, but to a point.\r\n\r\nI've tripped on LSD and shrooms both twice. The first time with LSD was solo 200ug and resulted in some profound thoughts followed in an extremely bad period where I talked to either god, the devil, or my own condescending Super Ego, I am not completely sure which. It challenged me on all the facades I put up in a very 'socratic method' way but confrontational and abrasive. I was/am not ready to deal with this yet.\r\n\r\nThe two shroom trips resulted it in extreme paranoia. I was trying to resist the trip unable to control this earth-shattering change in reality. In doing so I panicked.\r\n\r\nMDMA however, now that is possibly the most profoundly healing chemical I think I could ever experience. I have never had a bad experience even in marginal set and settings, I feel for other people and care about myself, but it just too much fun and way too distracting. Also the neurotoxicity issues makes me weary, especially because with MS my brain is under a heightened level of excitotoxic and oxidative stress already.\r\n\r\nThe trip:\r\n\r\nI tripped last night solo in my apartment. I had read about 2C-B being an excellent transition during an MDMA come down, some saying it is not an empathogen, some saying it is. Others with extreme visuals. Well I can say that it is a very introspective empathogen, as if all the caring on MDMA was turned internally. The visuals were extremely disorienting but not nearly as scary or anxiety inducing as shrooms. \r\n\r\nI orally dosed about ~25mg, at about T+ 0:45 I was feeling slightly off but nothing of note. I redosed 15mg then irresponsibly. Within 10 minutes after the redose the visuals hit me hard and very fast. I was listening to my Tool pandora station, the Tool tracks were amazing as always but some of the other tracks I liked much less than I usually do. I felt some anxiety coming on so I took .25 mg xanax just to be safe. I was still tripping hard after.\r\n\r\nI got lightly introspective and physically restless with the typical psychedelic need to stretch. I lay in bed and put on a Solar Fields and Tycho station. Then this song came on: Late Night Alumni - Finally Found from Ultra Records.\r\n\r\nThen it hit me like a brick wall going 5000 miles an hour. Ever since my last relapse two months ago, every day I'm in pain. Physical pain. My left back spasms constantly. The constant tension in my leg is sinister. It causes my posture to be terrible making my whole body hurt. It's easy to brush away but it's constant and unyielding. A persistent reminder every second that my body is falling apart around me and there is absolutely positively nothing I can do about it. WHY ME. I'D RATHER BE DEAD THAN TORTURED SLOWLY. WHY DOES THE UNIVERSE HAVE TO RELISH IN MY DESPAIR. I'm just a confused child trying to build a treehouse to keep the rain out but the roof keeps rusting and leaking and there is nothing I can do to fix it.  I'm grabbing for crayons thinking it can help if I can just draw on the rust, but the roof is too high up and I cant even reach the drawers in the kitchen. I cried for 30 minutes straight. A real, raw, completely vulnerable cry into a pillow. I'm running from others unless I can control them because I can't even control myself. I care about others but I care about my need to keep up this facade more, usually at their expense.\r\n\r\nI wasn't crying as myself. I was doing it for myself. There was some disassociation perhaps from the drugs or the emotional sledgehammer. And it honestly didn't matter and probably helped. It was good in a 'everything eventually will be ok, it's ok to feel this way there is nothing you have to protect against or prove' kind of way. I have to stop hating myself so deeply. I try to perfect my broken body while I still can to draw in others. I hate my mind because I can never attain the high standards I place for myself and I am constantly running out of time and never doing enough as I should. There is no one on this earth I dislike more than myself.\r\n\r\nI calmed down gradually, made a couple notes so that I could keep these feelings moving forward. Reminding myself that unless I turn this into action it will all be for naught. I listened to Deadmau5 - Chill Mix and got lost in the amazing ethereal sound and passed out at T 4:30 completely exhausted.\r\n\r\nI woke up today refreshed, a small body load but nothing like LSD or shrooms. I still may have been tripping very slightly when I woke up.\r\n\r\nThanks for reading. Writing this helped put my thoughts into concrete words.\r\n\r\nConclusion:\r\n\r\n2-CB is an amazing empathogen and psychedelic. The empathogenic and slight euphoric traits of MDMA without the speediness, intensity, or serotonin depletion. The trippyness of LSD with a welcoming headspace.\n\n\n\n\n\nExp Year: 2015ExpID: 107035\nGender: Male \nAge at time of experience: 26 \nPublished: Oct 8, 2015Views: 1,523\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}