{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t 40 mg\n\t\t insufflated\n\t\t Methoxetamine \n\t\t (powder / crystals)\n\t\t\n\t\t\n\t\t   T+ 0:05\n\t\t 42 mg\n\t\t insufflated\n\t\t Methoxetamine \n\t\t (powder / crystals)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   140 lb\n         \n\t\n\n\n\n\nBackground: I am a 19 y.o. male college student, weighing approximately 140 pounds, and am fairly experienced with drugs, mainly psychedelics, and a daily cannabis consumer. For the sake of being detailed the drugs I have experienced are LSD, LSA, Shrooms, San Pedro Tea, 25-?NBOME, 5-meo-mipt, 4-aco-dmt, 4-ho-mipt, 3-meo-pcp, Ketamine, MXE, MDMA, MDA, DMT, 2c-e, 2c-b, xanax, etizolam, vicodin, ritalin, adderall, vyvanse, and good ole nitrous. As I have Tuesdays off and had just received a particularly good exam grade, I decided to celebrate with some MXE, after partaking in two dabs.\r\n\r\nExperience: At 10:45am I insufflate ~20mg MXE per nostril. Five minutes later I repeat that process, insufflating a grand total of 82mg of MXE. I throw on headphones and my music of choice for MXE. Then I crawl into bed, feeling a warm glow already. After perhaps 5-10 minutes of listening to the music I notice that I need to throw up, and awkwardly retreat to the bathroom to do so. Another 5-10 or so minutes passes in the bathroom as I make sure Ive puked all that I need to, and I return to my bed. \r\n\r\nWithin minutes of laying down, closing my eyes, and covering myself with the sheets, the MXE starts to come on strong. The music becomes distorted in a most beautiful way, slowed down so that I can hear every note perfectly, as well as the voice of the singer, which is usually unintelligible. I am covered in this warm pressure, similar to the feeling of being under a warm blanket in the middle of winter (only 10x better). My consciousness drifts apart from my body, and the world of the inside of my eyelids swirls and changes around me. What is usually just a blank, dark field of vision expands and contracts with different patterns and colors. \r\n\r\nAs this world of CEVs expands and contracts, I feel my body morphing in shape and size along with it. As I give in to the MXE I feel myself become one with my bed, and through the bed my room, and through my room the world. Ive never felt that were all so interconnected as in that moment on MXE, not even on relatively high doses of psychedelics. A heavenly, euphoric aspect comes over my trip, and I start to feel as if I am connected with God and Jesus. This reaffirms to me my belief that I was put on this world to love everyone, regardless of their flaws, as well as that I am pansexual and thats ok, despite the straight and gay communities not being the most ok with bi or pan men. \r\n\r\nI continue to drift around the hole for a while, perfectly content with my existence. I get up a few times to use the restroom throughout the trip, which proves to be quite difficult in my inebriated state. Eventually I grow bored and uncomfortable with being in a dissociated state for such a long time, and turn off my music and attempt to smoke cannabis to calm myself down. This doesnt help and in fact only lengthens the duration of the MXE. At the time of writing this (approx. 5:00pm) I still feel the MXE in the background of my head, and am somewhat exhausted by the experience.\r\n\r\nSummary: MXE is a wonderful drug in its own right, however, it is not an appropriate substitute for ketamine as it lasts far longer. In my opinion it is still a wonderfully therapeutic drug with potent anti-depressive properties. In addition to this, it synergizes quite well with psychedelics. I would go as far to say as MXE is a drug meant to be done in combos, as when it is combined with psychedelics, it is a truly humbling entheogenic experience.\n\n\n\n\n\nExp Year: 2015ExpID: 107075\nGender: Male \nAge at time of experience: 19 \nPublished: Oct 3, 2015Views: 1,266\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n",
  "doses": [
    "T+ 0:00 40 mg insufflated Methoxetamine (powder / crystals)",
    "T+ 0:05 42 mg insufflated Methoxetamine (powder / crystals)"
  ]
}