{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t 35 g\n\t\t oral\n\t\t Cacti - T. bridgesii\n\t\t (tea)\n\t\t\n\t\t\n\t\t  \n\t\t 65 g\n\t\t oral\n\t\t Cacti - T. pachanoi\n\t\t (tea)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   210 lb\n         \n\t\n\n\n\n\nWhen fall crept up this year, I began to want to trip. I had previously tried shrooms and acid, but was not completely happy with my experiences with either (the acid was of poor quality and I gave myself a horrible shroom trip by taking them while I was in a miserable, stressed-out emotional state). \r\n\r\nI had been growing cacti indoors since last fall (San Pedro, Achuma or T. Bridgesii, and Peruvian Torch) but had been very reluctant to try them, because cacti grow rather slowly and therefore my material was in short supply. I did not want to waste it on a bad or mundane trip. I shot right over that risk by the way, as I spent most of my time not really doing anything but lying around. The setting probably wouldnt have mattered so long as I was alone. \r\n\r\nAnyway, finally settling on trying my precious cacti, I made a tea from 35g of Achuma and 65g of San Pedro. I added the San Pedro in hopes it would provide a little extra kick. I wasnt expecting 65g of San Pedro to do much, especially since I had already failed to see psychoactivity from this strain at the doses I tried. Due to bad luck and an aloof weed man (didnt want to trip without something a little extra), I spent the whole day I was originally planning to trip on just making the tea. I did two pulls of simmering San Pedro for 30 minutes before deciding they probably needed more time, and switched to hour-long pulls. I did three-hour long pulls on each bridgesii and San Pedro, in addition to the short pulls I did only on the San Pedro. I simmered the resulting liquid down a little but I was more worried about harming the alkaloids with excessive heat than I was about having too much to drink. It got too late by the time I had everything lined up, so I decided to start fresh tomorrow.\r\n\r\nI drank my tea at 3:20 in the afternoon. Cactus tea is thick and incredibly bitter. The taste is so revolting your body rejects it out of instinct. I gag and dry heave even though I feel no stomach discomfort (yet). I smoke a joint after finishing the tea to help settle my stomach. I end up spending most of the come-up period just really high, which wasnt unpleasant but it did make it harder to discern what early symptoms were caused by the cactus and not the marijuana. In fact, my green was a little stronger than what I am used to and probably caused most of it (for instance, I wrote down goofiness at T+10mins, which in retrospect was probably just me being high). Anyway, I chill out and watch Pineapple Express. Ive seen it a million times but its one of my favorites even when Im not blazed. \r\n\r\nNausea sets in about an hour later. It creeps up slowly and gradually, from mild stomach discomfort to the notorious purge, which hits me at T+2hrs, an hour after my nausea began. The purge isnt so bad. It happens so gradually. For the past ten or so minutes before the purge I had been creeping ever so slowly closer to my bathroom (bringing my laptop with my movie with me) just because I knew it would happen, not because I feared I would purge at any given moment. All the while my saliva is growing thicker and thicker to the point I cant swallow it and just hack it up into the toilet instead. Eventually this aggravates my gag reflex and boom. Purge. Purging for me was not profound. It was not miserable nor cathartic. It was throwing up. Unpleasant but you get over it. I should mention this was on an empty stomach, which I think helped. The time of my purge was the last thing I wrote down, so Im fairly certain my trip began shortly after it, which would only make sense. The first thing I remember of hardcore tripping was after smoking another joint, I lay on the floor to watch Lord of the Rings (The first one, which is by far the trippiest of a very trippy trilogy). I stretch out and notice it feels amazing, what I imagine MDMA feels like (Ive never done MDMA but Ive heard plenty enough about it). \r\n\r\nThis sets the stage for the incredibly physical aspect to the trip. I find myself writhing on the ground because it simply feels good. I imagine I was acting not unlike a cat on catnip. I try to watch the movie but end up only doing so for about 30 seconds at a time every few minutes, because I found myself being pulled into waves of psychedelic ecstasy. My head would grow heavy and finally I would give in, close my eyes, roll over to lie flat on the floor, and basically start writhing around like a lunatic again. I see visions of endless neon flashing spiral flowers. They remind me of candy and make me crave some. I see waves of endless cactus flesh flashing in a neon rainbow. These are the first visions and the ones that stand out to me the most. \r\n\r\nI haphazardly scribbled beginning of the end of trip at T+6hrs so that means for about four hours I was rolling around in these nonsensical psychedelic visions. I cant say there were much open-eye effects, although I did jot down visual distortion at T+1.5hrs, but this was only distortion. I didnt see anything, although I had some pretty trippy moments watching my movie. Lord of the Rings is so trippy I suspect the people who made it (from Tolkein all the way through Peter Jackson and his underlings) must have had plenty of experience with psychedelics. A huge part of the story revolves around people and objects influencing others through some sort of otherworldly energy, and I never really got that part before, but while tripping I felt that same energy- a profound indescribable pull, and completely understood how the One Ring influenced people. Plus the movies soundtrack is basically just a lot of building, epic music so I would lay back and trip hard as the music synched with my trip and rose, peaked, and then fell all together. Pretty good movie to trip to if you can handle some unpleasant vibes, because its definitely not a feel-good story most of the time.\r\n\r\nIf I were to describe my trip in one word it would be powerful. I was floored. I was non-functional. I couldnt have been around people if I wanted to. My coherency wasnt completely shattered, as I did have the presence of mind to decide going outside was too dangerous while tripping, even though I wouldve liked to have gone for a walk. The body high of bridgesii is very strong, and I never recovered from the nausea really. In the future I would like to be able to get outside and experience more, but I had a great time despite the limitations. I think 30g of bridgesii and skipping the San Pedro would have given me a more controllable trip, and having some anti-nausea medication around might have been nice. All in all good shit, but my approach needs some tweaking.\r\n\r\nP.S. I dont think I got all there is to get out of my cactus materiel, so I plan on doing more, longer pulls and using an acid/base extraction. Maybe Ill have a report-worthy experience again soon ;)\r\n\r\n[Reported Dose: '36g dried bridgesii 66g dried San Pedro'\n\n\n\n\n\nExp Year: 2015ExpID: 107135\nGender: Male \nAge at time of experience: 23 \nPublished: Oct 10, 2015Views: 984\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n",
  "doses": [
    "35 g oral Cacti - T. bridgesii (tea)",
    "65 g oral Cacti - T. pachanoi (tea)"
  ]
}