{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t 200 mg\n\t\t oral\n\t\t MDMA\n\t\t (powder / crystals)\n\t\t\n\t\t\n\t\t   T+ 0:00\n\t\t 100 ug\n\t\t oral\n\t\t 1P-LSD\n\t\t (blotter / tab)\n\t\t\n\t\t\n\t\t   T+ 2:00\n\t\t 200 mg\n\t\t oral\n\t\t MDMA\n\t\t (powder / crystals)\n\t\t\n\t\t\n\t\t   T+ 2:00\n\t\t 200 ug\n\t\t oral\n\t\t 1P-LSD\n\t\t (blotter / tab)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   95 kg\n         \n\t\n\n\n\n\nThe Sundering of the Veil\r\n\r\nSet: \r\nFeeling very calm and relaxed in the home of a friend. A little anxious as always before a psychedelic session, and it's the first time I have visited them, so everything is new, but I am generally in a very good and positive head-space. Dinner is eaten and wine is drunk, and the atmosphere is very good.\r\n\r\nPeople present: \r\nThere is me and my friend A (who I have met a few times only, but have had a fairly long online relationship with), and his partner B, who I have met for the first time today. A has been an extremely experienced psychonaut for decades, and I trust him greatly. Another couple, C & D, who are known to all present, appear later on at the peak of the trip, but purely on the astral level.\r\n\r\nSetting: \r\nA Friday night in early October, 2015. A detached bungalow in the deep British countryside. The lounge where most of the session takes place is decorated with many 'niknaks' from around the world: spiritual statues of Buddha, Pan, fauns & satyrs, decorated skulls, brass animals, original and reproduction paintings (some very surreal). The place has an extremely Celtic or Pagan vibe. The lighting is very low and almost entirely made up of candles placed around the room. Incense burns. During the come up the music is mostly The Stone Roses and Black Grape, good vibes and good grooves! As the drug really begins to take effect, a series of 'mash up' CDs is put on (lots of different parts of many well known dance music and electronic tracks mixed cleverly together). As the intensity increases I ask for something a bit less full on and more mellow, and from then on it's mostly Psych Folk and Psychedelic Rock that is played, with stand-out tracks and albums from Traffic, The Incredible String Band, Van Morrison, Dr. Strangely Strange, Kevin Ayers and David Crosby.\r\n\r\nIntention: \r\nI have wanted to try another high dose 'breakthrough' MDMA session for many years, but the substance has just not been available to me. I've also wanted to be able to take psychedelics with an experienced person, not so much to 'guide' me, as just to be there when I trip so that I can fully let go into the experience. For the last fifteen years or so I have mostly taken psychedelics alone, in bed, with headphones on. I feel like I have exhausted that setting, and want to try something new. I have also been sticking to fairly low doses for the most part. I wanted to feel safe enough to be able to take a higher dose. As far as self-analysis or spiritual seeking went, I had nothing in particular that I wanted to unearth or work on.\r\n\r\nDose: \r\nDinner had been consumed approximately 30 minutes before taking the first capsule. 1 gel cap containing around 200-250 mgs of MDMA and 100 mcgs of 1P-LSD was swallowed with wine. About two hours later when it had been established that I was OK with this, another 'booster dose' gel cap of 200-250 mgs of MDMA and 200 mcgs of 1P-LSD was taken.\r\n\r\n[Erowid Note: \nTwo samples of powder (even of the same chemical) with equivalent volumes won't necessarily weigh the same. For this reason, eyeballing is an inaccurate and potentially dangerous method of measuring, particularly for substances that are active in very small amounts.\nSee this article on The Importance of Measured Doses.]\r\n\r\nComing up: \r\nFor the first couple of hours it felt mostly like an MDMA come up, but not too strong. It was slightly trippy, and I was enjoying the company and the music a lot. Black Grape was very funky and the conversation flowed freely and easily. Next the mash-up CDs came on and they were also a lot of fun, especially spotting all the dance tunes that I hadn't heard for years. I had a bit of a walk and dance about the room, the laser light show projection was a lot of fun. At some point around two hours after dropping, we dropped another capsule. I felt very secure and not really 'out of it' in any way. Fully in control and very much enjoying the experience.\r\n\r\nMain experience: \r\nAfter this things started to get a little strange. I can't put my finger on exactly when it happened, but the experience started to gain in intensity, and I had to sit down and just watch things unfold. Around this time, A told me later, I started to go quite quiet and became much less communicative. I think A could see I was having an intense time, and asked me if I'd like the music changed. I said yes, I wanted something a bit more mellow. The 'mash up' music was very frenetic, and it had begun to sound almost demonic in some way, to me. It was like I could hear the voice of a 'nature demon' in the music and vocals in places, and that the energy level was being raised to a very high state. It was like Mendes, Pan, or Baphomet, a very powerful nature spirit, was immanentizing right there are then, through the music. It wasn't so much scary, (throughout the whole trip there was a very Pan like presence, but it was nature Pan, fun Pan, frolicking, mischievous, musical Pan that was guiding me on the journey) as just very, very real, visceral and intense. I started to wonder if A was a Pagan, and that perhaps he was the head of some mystical, ancient, Celtic, Pagan, hereditary witch cult, that was involved in ancestor and animal worship. Perhaps he was the embodiment of the Pan like figure. At least that's how it seemed to me. Whilst this could be seen to be a paranoid delusion, it didn't feel like one, and it didn't feel scary, although I was pretty sure that it was definitely the case/'true' at the time.\r\n\r\nIt was when the music changed from the mash-ups to the Psych Folk that things really began to shift though. The music married PERFECTLY with the very magickal, Pagan trip that had now begun to unfurl. It was at about this time that I became completely drawn to and absorbed by a ram's skull that hung on the wall over the fireplace. I was told later that it was a Tibetan Bonpo fetish used by shamans, but didn't know this at the time. The skull had four horns, and was covered by metal plates which had been affixed to it, showing teeth and jewelled eyes etc., some of its real teeth were also showing at the front. In the candle light and the reflections of the other brass objects nearby, and in my mind state, looking at it from a few feet away, it looked to be made of something like shimmering liquid rose gold. At one point the words in the music started to appear from the ram's mouth, and it began to communicate with me via the music. It came alive. It was a momentous occasion, and I felt very privileged to be witnessing it. I was whisked away from my everyday reality into an ancient Celtic village where families would gather around their 'hearth shrine' altars, to worship their ancestors which would then impart important knowledge of their tribe's rituals, history and traditions. I realised I was standing holding hands with other people (my 'Fey' family?), and we were all witnessing the great event together. It felt like I had been transported to the world of Faery. Things got a little scary as the Ram entity kept speaking, manifesting its essence, and slowly, the rest of its body began to emerge out of the wall. I could now not only see its head, but the rest of its skeleton too, and it felt like it was a very feminine entity, like a very old, wise and slightly scary lady. The skeleton was dressed in rags in places.\r\n\r\nFrom here on I was completely torn away from normal reality, for what I guess was about hour three . It's extremely difficult to piece together what I actually perceived, and in which order. A would occasionally 'check in' on me, and it would suddenly be a huge shock to realise that I actually had a real body in a real world, and that it wasn't all just some kind of an extremely bizarre vision or dream. I remember mentally and physically starting, when A would ask if I was OK. I think it's probably the highest I have ever been, apart from the time I smoked NN-DMT many years previously, but the short acting DMT flash was nothing compared to the prolonged intensity of this.\r\n\r\nHere are a few of the other visions that I had, but it's very difficult to remember them clearly or put them in order:\r\n\r\nThere was a part where I was aware of a couple of acquaintances, who I know to be very experienced magick workers. In the vision they embodied part human and part animal spirit bodies. They weren't like Satyrs or Fauns, with part animal/part human bodies, but more like a perfect genetic amalgamation of the two species. It seemed they were cat or rabbit or fox like in some way, with definite mammalian characteristics. They were guiding children around. They were friendly entities, like sprites, that were caring for and looking after everyone. C was relaxed and friendly, D was flitting around like a mad thing (flying like a fairy) , happy and laughing, and together they both appeared to be weaving a good and positive reality for everyone else, to make things flow more smoothly. I could even see the weave as a series of horizontal red and green bars at times; there would be a blockage somewhere, and D would flit to the blockage and remove it, letting the energy flow though freely again. There were more of the animal entities around, many of them young children, all living in a magickal village (perhaps in Cornwall?) and I felt like I had entered their magickal world fully. Everyone was mischievous, chilled out, laid back, and having a lot of fun.\r\n\r\nIt seemed that later I became transfixed by the Ram's head entity again, only this time there were many more of them in different people's cottages, and they had somewhat changed their appearance. Every household had one, and they were the dead tribal elders come back to advise the tribe. They were a little scary, and I wasn't completely sure that I trusted them. They now lived high up in the 'triangular' corner of rooms, not above the hearth, and looked more like some bizarre mix of octopoid Cthulhu like entities, with thick spider's legs, or large outdoor street lamps in a Victorian iron rail style. They were not very animated, they could only move a bit, but they had lights inside their heads that seemed to speak of conscious intelligence and wisdom. They were about one to two meters high and a meter wide. They definitely had a less benevolent mien than they had had previously. I found them very bizarre, but they were totally real to me. They seemed to be calling meetings and having arguments with similar such entities in other parts of the village. There seemed to be a lot of jealousy and some other negative emotion, perhaps anger or frustration.\r\n\r\nThis must have been around peak time. Of the whole trip, the number once intense experience was hearing The Incredible String Band's track 'Invocation' from their album, 'U'. It was utterly transfiguring, alien, elven, elemental, Pagan, and nature-spirit like in it's effect, intensity and voice. I will never be able to hear it again without remembering the realm I existed in on first hearing it (for this was indeed my first time to hear it). As I was peaking when it was playing, it is very difficult for me to be able to say exactly what part of the trip hearing this track occurred with, but it was somewhere around this part.\r\n\r\nThroughout the whole trip I was sure I was living thousands of years ago in Cornwall, or another Celtic society, with very basic houses and villages. At a late part of the trip, I could feel that the intelligence level of the people suddenly seemed very low, like they didn't have many of the parts of consciousness that we have today, like they operated very much more on the 'animal' survival level, something akin to Leary's first circuit of consciousness. Visually I could now watch them, and they appeared flat and two dimensional to me. I could see them but they looked like black sketches on a white page. They would shuffle about slowly and not really be aware of what they were doing. Sometimes they would come from their houses into the field, and not know why they had come, and then shuffle back again. At other times they would get stuck 'on the page' and slowly disappear there, with no apparent reason or purpose, almost decaying as with the seasons and the years of time, into dust.\r\n\r\nComing down:\r\nI slowly started to return to reality, my ego completely shattered, no longer sure of what was real. I started to focus more on the music and that helped me to get a fix on things again. I spent a wonderful 30 minutes or so listening to Van Morrison's 'Astral Weeks'. I had a bit of a chat with A, although I couldn't tell him about any of the strange things that had occurred until the next day. We decided bed was in order, I am guessing some nine hours or so after first taking the substances. Sleep was fitful and I kept waking up and not being able to go back to sleep again, still heavily tripping. I finally got up around 1:30 PM the next day, and we spent the whole day chilling out and trying to integrate the experience. It should also be noted that it was only the next day that I realised that there was a letter/card in red behind the Ram's head above the fire place, and that that letter had been given to A & B on the occasion of their hand-fasting by C & D.\r\n\r\nAfterglow:\r\nI am writing this three to five days later and I am still feeling the effect slightly, both physically and mentally. An extremely powerful experience, and generally a very positive one, although some parts were so weird and overwhelming that they became a bit scary. I've spent the last few days researching the Faery and pixie/pisky traditions of Celtic Britain, and modern/Traditional Cornish magical practice/Witchcraft, and I am sure that that 'map' of reality is the best way for me to explain what happened to me that night. I fully entered the other side, the Faery Realm, after an almost violent 'Sundering of the Veil' between this world and the next. The combination of Set, Setting & Dosage was probably the most powerful and profound one I have ever had, for which I thanked my host greatly.\r\n\r\nConclusion:\r\nA truly powerful, awe inspiring, and wonderful experience that I had been wanting to have for a long, long time. Not something that I'd want to repeat often, but I am very glad to have visited there! Some of the experiences, memories, or 'ghosts' of the otherworld that it has left behind will stay with me until I die, I am sure.\n\n\n\n\n\nExp Year: 2015ExpID: 107156\nGender: Male \nAge at time of experience: 41 \nPublished: Oct 7, 2015Views: 2,289\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n",
  "doses": [
    "T+ 0:00 200 mg oral MDMA (powder / crystals)",
    "T+ 0:00 100 ug oral 1P-LSD (blotter / tab)",
    "T+ 2:00 200 mg oral MDMA (powder / crystals)",
    "T+ 2:00 200 ug oral 1P-LSD (blotter / tab)"
  ]
}