{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t 20 mg\n\t\t oral\n\t\t 5-MeO-MIPT\n\t\t \n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   120 lb\n         \n\t\n\n\n\n\nI have previous experience with 4-aco-dmt, not regularly but enough to appreciate ~20mg doses. I can remain 'in my head' enough to prevent a trip from turning sour, I am comfortable tripping alone (actually prefer it), and I do everything I can beforehand to ensure a positive time.\r\n\r\nI ordered what I thought was 4-aco-dmt from a reputable online vendor. Searched online beforehand, looked on Reddit, nothing to suggest what would happen. I weighed out 20mg of 4-aco once my package arrived, stirred into purified water, and drank it.\r\n\r\nOr tried to.\r\n\r\nTurns out, this was 20 mg of 5-meo-mipt. I didn't learn this until browsing online and finding the vendor admitting some sort of mix-up.\r\n\r\nI immediately noticed the 5-meo-mipt was much more bitter. Dissolved 4-aco-dmt is almost tasteless to me; dissolved 5-meo-mipt made me puke before I even finished the solution. I felt slightly better, finished the solution, lay down.\r\n\r\nI don't even remember the good parts. Hugged a pillow for awhile. Ate pretzels before realizing that I couldn't get to water, and might choke on them. It was similar enough during the come-up that I might confuse it for a low dose of 4-aco-dmt but otherwise, never again. Took about as long (45 minutes?) to come up as well.\r\n\r\nI remember writing down my mother's phone number (while I could still write)  because I felt like I was going to die. I lost all sense of time. I would look at my phone, see the time, and become convinced that it wasn't changing. I stayed grounded by repeating the date, the name of the person I had a date with that weekend, and the name of my debate group. Having 'anchors' like that is, IMO, what kept me from going full crazy.\r\n\r\nI didn't hurt my back or bruise anything. Wasn't even sore the next day. But...I thought I was dead and that people were trying to revive me. That I was in a coma, that if I didn't move I would have permanent paralysis. That I was found outside and brought to my debate group's meetingplace. That paramedics were asking me questions trying to orient me, and I went mute. I couldn't talk.\r\n\r\nAt this point my sight is wobbly/fuzzy/blurry, and my heart rate is likely horrid. The only things that registered with me after I couldn't talk were 'rape' and 'death'.\r\n\r\nI was raped repeatedly during an abusive relationship some years ago and this was never an issue during my times with 4-aco-dmt. I can say my rapist's name while on 4-aco-dmt, nothing happens but a goofy smile. I take notes during 4-aco-dmt trips and abuse doesn't show up during any of them.\r\n\r\nThat 20mg of 5-meo-mipt had me convinced I was dying of some spinal injury, that I should just let myself flatline so that I could finally be at peace. Before I went mute, while I still thought I was in a hospital, I kept saying my abuser's name. If I was going to die of a drug OD, parents at my side, then dammit someone's getting justice. I'm also Catholic and I remember asking for last rites several times, then panicking when I couldn't verbalize the request.\r\n\r\nI stared at my bed during a moment of lucidity, thinking this was the longest night of my life. I refused to text or call anyone because, I think, some part of me realized it was temporary--and that calling 911 would mean permanent consequences. DON'T do dumb shit like that, let a close friend or three know what you took, etc etc. \r\n\r\nEventually got back into bed. The whole experience lasted--as a guess--around five hours, with the worst bit in the middle.\r\n\r\nWould I do it again at a lower dose? Will I ever be trying tryptamines again? No and no. It's about two weeks out now with no signs of lingering paranoia/unrest/anything even close to that trip's insanity.\r\n\r\nTL; DR: lab test your drugs before using, even if it's a substance you think you've used before, even if you have little reason to. Fifty bucks would have been worth it to test what I bought and not feel like impending death.\n\n\n\n\n\nExp Year: 2015ExpID: 107112\nGender: Female \nAge at time of experience: 24 \nPublished: Oct 10, 2015Views: 1,109\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n",
  "doses": [
    "20 mg oral 5-MeO-MIPT"
  ]
}