{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t 25 mg\n\t\t oral\n\t\t 4-HO-MPT\n\t\t (powder / crystals)\n\t\t\n\t\t\n\t\t  \n\t\t 2 bowls\n\t\t smoked\n\t\t Cannabis\n\t\t  \n\t\t\n\n\n\n\nWell, I had hoped to keep some time log during this experience as I did my last one, but the nature of the trip prevented that sort of basic functioning from really being workable. Instead, I will just have to recall the events from memory as best I can.\r\n\r\nFor some quick background, my previous trip was nine days before this on 50 mg of MiPT. That experience had left such a strong euphoric impression on me that I was still feeling little bursts of it all the way up until this, and I was really wondering if this was going to be a somewhat similar experience based on some things I had read online. I will just say now that this was not the case.... Not at all. What this 4-HO-MPT had in store for me was another very familiar but still very different kind of tripping.\r\n\r\nMy previous experience with psychedelics includes psilocybin mushrooms, LSA seeds, bufotenin, DMT, LSD, 2C-B, 2C-I, 4-AcO-DMT, 4-HO-MET, 4-AcO-MET, 4-HO-DET, 4-AcO-DET, 4-HO-MiPT, 4-HO-DiPT, 4-AcO-DALT, MiPT, DiPT, DALT, and at least a couple of unidentified things like psychedelic amphetamines and suspected TFMPP.\r\n\r\nT-1:00 - Around this time I was reading the swirly talk thread and saw Just A Guy talking about tripping on DOPR. This gave me a desire to test one of my newest goodies, which I wrestled over whether or not to give into as I made my way home after a long but ultimately easygoing day.\r\n\r\nT+0:00 - Just after arriving, I decide to take 25 mg of 4-HO-MPT. The taste is awful, not the worst I've had of the tryptamines but not the best either. I try to keep myself calm and keep my head clear, as I have a lot of expectations about this one just from reading around that I don't want to get in the way of me getting the full actual experience.\r\n\r\nT+0:20 - At this point I'm convinced that what I'm feeling is definitely not placebo, as the telltale tryptamine spinal rushes I get have started to make themselves known. Suddenly things seem to be picking up quickly, and from the start I notice some definitely similar feelings to 4-HO-MET in the way that visuals very rapidly progress from being almost nothing to practically overwhelming, in a way that makes it start to feel like I am just being bombarded with sensory overload.\r\n\r\nThis is where things start to get a little more hazy in my memory of course because of that overload, and it's also where my notes ended, but I will do my best to detail what happened next. As the visuals continued to increase they kept their 4-HO-MET-like qualities particularly in the way that I could see faces among the patterns and with how there was just a lot of very colorful shifting, breathing, trailing, and so on all around me, but at the same time they still had their own unique properties as well. For an easy example, whereas on 4-HO-MET I see a very high amount of greens in everything, this one seemed to be much heavier on the blues. The complex imagery I see among the sensory distortions on 4-HO-MET is also flatter and more condensed, while this 4-HO-MPT left more space in between them but also had them more three-dimensional.\r\n\r\nAside from the visuals, one very distinct thing I noticed that this trip did not share with 4-HO-MET is a lack of strong euphoria. While there were still very slight rushes as mentioned before, they were very much a background feature to me on a level that I can only compare to 4-HO-DET. Rather, and also like 4-HO-DET, the primary body feeling I had was one of feeling 'loose' in more than one sense of the word. On one level it takes a physical dimension in the form of an erotic relaxation, like the satisfaction that comes from a very primal stretch but that never goes away and just remains constant all throughout the body. It is just as beautifully subtle as one would expect this to be as well, but no less encompassing than any other high. From this then that 'loose' feeling also extends into the mind, and then it is not only my body that is stretched but my identity as well. My understanding of reality transforms from a stable construct into one with a more 'flowing' structure, one where the different streams of my mind, such as what I perceive, what I imagine, and what I desire, may become seamlessly entwined. For example, I at first sat in an audible silence and those bare feelings extended to me as well, causing me to feel 'raw' and exposed to all of reality. Afterwards, I listened to a song with a sexual theme and started rocking back and forth to the music, and as I did I could feel my movements sending ripples through the air and distorting my view of myself and my world, turning myself into a graceful erotic dancer wandering through the cosmos.\r\n\r\nAt some point in all of this, it became undeniably clear to me that I had passed a threshold which I had not reached in some time now. As I closed my eyes and tried to take a brief moment of rest from the barrage of psychedelic power, I was greeted with the familiar patterning of a 4-HO-DET mind shredder... and with the visuals still flying around at an intensity rivaling 4-HO-MET, my mind was being pushed to its limit. Every thought I attempted to have about the situation would spring off with some section of visual data, and before I could catch it every other tangent my mind could possibly build would force its way into existence and bounce off just the same. I had a very strong urge to resort to understanding my experience through tautological ramblings, such as saying that the trip simply 'is because it is.' \r\n\r\nAround this time I also started asking myself questions that I have not in quite a long time, such as 'Is this going to last forever?' I told myself that this was probably unlikely and that I should just enjoy it while it lasts. My proper understanding of the passage of time was pretty far gone by now, but I still had enough sense to remember that this was just the effect of a drug that I voluntarily took. My proper understanding of the passage of time was pretty far gone by now, but I still had enough sense to remember that this was just the effect of a drug that I voluntarily took. Unfortunately though, I really cannot say how long this state lasted, and a lot of it is pretty difficult to recall now, but what I can say is that this was very possibly my favorite state of consciousness that I yet experienced on a 4-substituted tryptamine. It really pretty much felt like the unique mental and physical effects I love about 4-HO-DET perfectly synergized with the unique sensory visuals and complex hallucinations I love about 4-HO-MET, and yet still somehow with its own amazingly individual style. I was in awe; though, to be fair, I was also feeling a million other things at the same time.\r\n\r\nEventually, the relentless feeling of the trip seemed to calm down a bit and the experience became more relaxed. Without feeling like I was right on the edge of madness, I was able to enjoy that 'loose' mindset I described on a more lucid level by listening to music. As I said, I had been doing so before anyway, but on top of that mental state it had been making my mind go pretty wild. This was more along the lines of a lucid dream state, though through the same but now somewhat lessened 'flowing' reality. It was fun, but not as developed or believable as during the peak. \r\n\r\nAnother thing I have not mentioned yet is the fact that, very unlike my previous trip, but still like 4-HO-DET, there were really no significant music enhancement qualities to this trip; the music made the drug more intense, but not the other way around. For this reason I eventually got tired of listening to it and instead decided to just sit and think about what I had been through. Though, this was still difficult as the psychological disturbances seemed to be far outlasting the visual effects which had started to fade, but I had fun with them either way. Mostly though, really anything I tried to do at all just made me want to stop trying and enjoy the satisfied feeling all throughout my body, so that's what I did. Aside from a few short updates on the forum during this time, I really spent most of the rest of the trip just experiencing the now.\r\n\r\nT+6:00 - Based on posts I made online, it would seem that this is about when I felt mostly down. I still didn't feel completely sober even when I fell asleep, but I certainly wasn't having any more visuals beyond maybe some blurring. Really I mostly just felt dazed and tired I think, and I only managed to get a few hours of sleep, but it still was pretty refreshing when I woke up.\r\n\r\nIn the end, I have to say that I really wish that I could describe this drug more, but I think it's going to take me at least a few more trials before I can really start to wrap my head around what 4-HO-MPT is all about. For now, I will just try to cover all of the information I think is important. \r\n\r\nFirst of all, I felt that the physical side effects of this one were minimal, aside from some nausea at the beginning that led to one quick dry heave... but that very easily could have been my fault for eating a lot of cheese pizza not very long before dosing, and I expect that it was. There was a little leg shaking and the like just as I have experienced with other psilocin analogues, but it was not as bad as I would've expected from a similar intensity trip on 4-HO-MET. My heart rate seemed like it may have been just slightly elevated at times, but that may have also been from the combined excitement and anxiety of being on a synthetic substance that I have never tried before. There was a little sweating as well, but, it's just sweat. Other than those, I can't really recall anything standing out.\r\n\r\nSecondly, I feel that I should give fair warning about the psychological potential of this drug. At least for me, 4-HO-MPT is a full strength, hardcore psychedelic. I took this dose expecting it to not be too overwhelming based on what I read online, but obviously everyone reacts differently to every drug, and for me this was an extremely powerful dose already. I very strongly felt that pushing even just a bit higher could've had me starting to pass over into a delusional mania like I have felt before on 4-HO-DET, with bizarre, grandiose ideas running through my head and everything, only with the difference being that this would also be to a backdrop of by that point probably nearly blinding visual distortions. 4-HO-DET is fairly light for me in this way, with the complex imagery it produces at those higher doses being more independent, realistic, and visionary in style, but 4-HO-MPT felt much more to me like it could have that but blended into a more traditional tryptamine hyperspace experience as well. To be perfectly honest, I really felt like this substance might have the potential to take me to the deepest states of psychedelia I have ever experienced, though quite possibly at the temporary cost of my sanity and self-control.\r\n\r\nSo, I guess that's about all I have to say. I will just reiterate, please choose your doses wisely. This was a fascinating trip to experience, but I could definitely see it turning on someone who was not prepared. Even when I was just dealing with that nausea, it was very clear to me that 4-HO-MPT contains both the heaven and the hell within it. I think it could be a real risk for the faint of heart, but, on the other hand, an absolute gem for the dedicated psychonaut. I would recommend this chemical to every single person I know who enjoys exploring deeply with tryptamines, because if it works in them like it does in me then I really don't think it's something they'll want to miss. I at least certainly am looking forward to discovering many more of its secrets in the future.\n\n\n\n\n\nExp Year: 2015ExpID: 107131\nGender: Female \nAge at time of experience: 24 \nPublished: Nov 20, 2015Views: 799\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}