{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t   repeated\n\t\t oral\n\t\t Alcohol - Beer/Wine\n\t\t  \n\t\t\n\t\t\n\t\t   T+ 0:00\n\t\t 1 mg\n\t\t oral\n\t\t Etizolam\n\t\t  \n\t\t\n\t\t\n\t\t   T+ 0:00\n\t\t 52 mg\n\t\t oral\n\t\t Methallylescaline\n\t\t (liquid)\n\t\t\n\t\t\n\t\t   T+ 16:00\n\t\t 2 mg\n\t\t oral\n\t\t Etizolam\n\t\t  \n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   178 lb\n         \n\t\n\n\n\n\nT-05:00 :: Alcohol, Beer, 7.2% (2)\r\nT-01:30 :: Alcohol, Beer, 7.2% (1)\r\nT-01:00 :: Etizolam, 1mg\r\nT+00:00 :: Methallylescaline (MAL), 52.05mg \r\nT+16:00 :: Etizolam, 2mg\r\nT+17:00 :: Alcohol, Beer, 7.2% (1)\r\nT+18:00 :: Alcohol, Beer, 7.2% (1)\r\n\r\nI had previously prepared a solution of this in water so that I could accurately measure dosages without the losses of weighing each time.   It was a Friday night, ~11:00pm, and I had eaten a decent amount of food 7 hours previous.   My past experience with phens can mostly be found in other reports, 2C-T-[2, 4, 7, and 21], 2C-B, C, and E, 3C-P, etc...  but no 3,4,5 substituted ones, except a threshold amount of mescaline once via San Pedro which did little but cause a slight warm feeling and energy boost.   \r\n\r\nPhenethylamines tend to last much longer for me than PiHKAL indicates, so I took the possibility of that into account.  I've found Shulgin's listed dose ranges to almost universally be spot-on in terms of effects (and those not as accurate usually seemed to be too low), so I decided on a 'medium' dosage.  \r\n\r\nMy entertainment for the night was a new thing for me;  I realized several years back that I don't (or as of the time of this report, didn't anyway) enjoy being with most other people while tripping, and my solo trips tend to allow me to explore the mindspace more freely without worrying about someone else going on a bummer, especially at the first time with a new substance.  People tend to I also got away from the whole 'I'm tripping and should do / listen to something trippy' and now opt for watching the alteration of everyday experiences and hobbies -- whatever I feel like.  Also, as this was a new substance for me, I felt that nobody else should be exposed to it until I had tried it.   \r\n\r\nThe timeline breaks down relatively quickly, but I'll include the earlier parts.  I only mention the beer above because there were many reports of nausea / vomiting with this substance and having alcohol in your system usually potentiates that...  it didn't for me.  I should point out here, too, that I drink beer daily.   I generally drink 4-6 relatively strong beers a day, spread out over something like a 10 hour period (my office allows drinking on the job, as they assume that adults can be responsible with it [what a concept!].  I usually have 2 there and the rest later). \r\n\r\nI moved to a more European style of drinking quite a while back, drinking so slowly that the alcohol has little to no effect, and is actually hydrating.  If I accidentally drink more than a beer an hour,  I drink the next one over two.  My liver and kidneys are in perfect condition according to blood tests at an unrelated ER visit last year, with all readings falling at almost exact center of norm.\r\n\r\nT-01:00h\r\nIngest 1mg of Etizolam.  I am benzo-tolerant thanks to a klonopin prescription for sleep, and years of being on temazepam, so 1mg is about 1/4 strength for me as it is for a non-tolerant person based on comparison of notes.  I've found in the past that a small dose of benzodiazepines prior to phenethylamines smooths out the ride to the peak a lot, and has very little effect on the actual trip.  It's sort of like the difference between travelling down a pothole-covered road on a bike versus doing so in a modern car.  Etizolam is perfect for this due to short half-life / duration.  \r\n\r\nT+00:00h\r\nIngest 15mL of solution, which contains 52.05mg of MAL.  It was somehow much less foul-tasting than most phenethylamines I've taken in this fashion...  still bitter, but not as bad as the 2C-Ts for example. \r\n\r\nT+00:30\r\nFirst vague alerts.  Little twitch felt in the gut, smiling a little more. \r\n\r\nT+01:00h\r\nThings are starting to move in interesting ways.   I'm still playing videogames waiting for things to progress more.   Around this time I had my only hint of nausea during the entire night, which went away rather quickly as the MAL increased in intensity.  I forgot all about the phenethylamine body buzz, and as usual was impressed by how intense it is.  Potent anorexic effects.   I should be getting hungry about now, but do not want food at all.  As I had eaten earlier I decided that my body would be able to handle the lack of food just fine. \r\n\r\nT+02:00? \r\nI started losing track of time at this point.   I wasn't too concerned with the clock.   Several interesting things happened within the next couple of hours (this is a small selection): \r\n   * My cat jumped onto my lap.  I began calling him by his name and petting him, and then realized that as he is an intelligent creature I had no right to name him in the first place, but didn't know what his real name would be since I can't speak cat very well.  For the rest of the night, I would only call him 'pretty kitty' or tell him that I loved him.  I love my cats very much and generally have very strong reactions to them when they come to hang out on my lap while I'm tripping, but this was the first time I had the feeling that naming them was wrong.   Looking back on this I feel like I may have accidentally watched part of the 'Cats' musical in the past few weeks.  \r\n   \r\n   * Open eye visuals were fairly strong at this point, probably equivalent to 1/8th of mushrooms.  I'd compare to another phenethylamine, but it has been a long time since I have done any and feel like the mushroom comparison was easier to relate to.   Similarly, I've tried 5-MeO-DALT fairly recently but it was not a very visual compound so it doesn't make a good basis for comparison. \r\n   \r\n   * Visuals eventually got stronger, and for the first time I experienced a massive change in the sizes of objects in the room.  Some things seemed to shrink to 1/4 of their normal size, while others got larger or taller.   Strangely I have not experienced this from any other phenethylamine or tryptamine.   It may be less the nature of this compound and more the relaxed state I was in, it's hard to say. \r\n   \r\n   [Aside: I have had what I would call religious experiences on certain drugs before, usually involving negative aspects of life & reality.  I'm not religious, nor do I usually feel any sort of connection to spiritual things.  None of it seems to resonate with me]\r\n\r\n   * At one point I closed my eyes while a random song was playing, and immediately saw beams of pure white light emanating from the center of my chest...  it was as though I was slightly behind my body, and could see it, as well, outlined in light.   This light felt wonderful.  It felt like the light of a god passing through me, and I realized that it was coming from me somehow.  I quickly turned off the music and remained silent with my eyes closed for several minutes, just feeling this light.  Afterwards, I raised my head up and looked upwards and just wept with joy for probably 15 minutes at the sheer incomprehensible glory of whatever I had just experienced.  This was one of the most amazing 'mystical' experiences I've had while on psychedelics, up there with the 3C-P / 2C-T-2 / Mushroom experience but without the negative parts.   I believe this was set & setting more than anything but it does make me believe that this chemical has some potential for greatness.  \r\n   \r\nT+03:30h\r\nDecided to check the clock, because it felt very late.  I was rather surprised to learn that it was only a bit over an hour later.\r\n\r\nI spent much of the next hours playing videogames because it felt very interesting to attempt to compose new strategies on-the-fly.   While computer monitors normally look 'dirty' in some undefined way or aren't affected by visuals that I would get when looking at anything else, this time there was full motion in static background scenes, and a great appreciation for the artistic design put into the game.  There were some tinges of being bothered by some of the violence, but there was enough mental clarity to realize that I was just playing a game and this violence had no relation to my real-life attitude of pacifism except under extreme threats to my own life.   My cats took turns hanging around / sleeping on my lap this entire time, as they usually like to do.\r\n\r\nT+06:30h \r\nOnce again decided it felt like it might be late, and checked the clock.   This time, three hours had passed instead of one...  interesting amount of time warping.   I realized that I actually felt a little sad that the 'white light' had gone, and wondered upon the acronym for this chemical...  maybe not MAL because of effects, but MAL because of what it gives for a short amount of time, only to disappear.  Then I called it methallylescaline in my head and decided that if things are going to be called by their proper names there was no point in worrying about the acronym. \r\n\r\nEpilogue: \r\nVisuals persisted at about the same level as peak until ~T+08:00h, with a slow drop-off to almost nothing except a residual weirdness of textures at T+16:00 which lasted another couple of hours after that.  I took 2mg of Etizolam at around T+16:00h to attempt some sleep, but it didn't really do anything to put a dent in the energy of the MAL.   Ended up drinking a bunch of water and a couple of beers at about T+18:00h and finally fell asleep leaning back in my recliner.  I woke up about ~4 hours later feeling surprisingly well rested and without a hangover from the drug, although my legs were shaky from not eating during the (very long) experience.  \r\n\r\nI didn't have any of the negative effects listed in PiHKAL with this one, and found it quite pleasant overall.   The duration (and some minor body load) was the main negative for me, as it is very hard for me to devote 20 hours to a trip these days.  I'll also probably try it on a beach or in the woods with some trusted friends next time as well.   I feel like I was coherent enough on this particular drug to be social, and that it could add some humor to things.   I also feel that the visuals would be more compatible with nature, so next time I'll probably keep around the same level and find some woods to walk around in.\n\n\n\n\n\nExp Year: 2014ExpID: 107150\nGender: Male \nAge at time of experience: 34 \nPublished: Oct 16, 2015Views: 875\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n",
  "doses": [
    "T+ 0:00 repeated oral Alcohol - Beer/Wine",
    "T+ 0:00 1 mg oral Etizolam",
    "T+ 0:00 52 mg oral Methallylescaline (liquid)",
    "T+ 16:00 2 mg oral Etizolam"
  ]
}