{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t 60 mg\n\t\t oral\n\t\t 4-AcO-DALT\n\t\t \n\t\t\n\t\t\n\t\t   T+ 0:45\n\t\t   \n\t\t smoked\n\t\t Cannabis\n\t\t \n\t\t\n\n\n\n\nThis was my third experience with 4-AcO-DALT, and my first time taking it orally, after smoking it the last two times. I knew that it was supposed to be much less potent this way, and unfortunately that turned out to be true, but I still thought it would be worth it for the sake of having a fuller experience by getting the full oral duration to let the effects develop. I think this turned out to be a good idea in the end, but it is a little saddening how much is needed just to have a strong trip off of it. But, that is life.\r\n\r\nMy previous experience with psychedelics includes Psilocybe cubensis, Ipomoea tricolor, Argyeria nervosa, bufotenin, DMT, LSD, 2C-B, 2C-I, 4-AcO-DMT, 4-HO-MET, 4-AcO-MET, 4-HO-DET, 4-AcO-DET, 4-HO-MPT, 4-HO-MiPT, 4-HO-DiPT, 4-AcO-DALT, MiPT, DiPT, DALT, and at least a couple of unidentified things like psychedelic amphetamines and suspected TFMPP.\r\n\r\nI got up in the morning thinking that I might be taking DOC for the first time, but before too long some responsibilities emerged that I would have to attend to later in the day, and I really didn't want to risk tripping for that long considering them. Telling myself that I'd definitely do it next time, I opted to have my first oral trial with 4-AcO-DALT instead.\r\n\r\nT+0:00 - 60 mg of 4-AcO-DALT taken orally. It's pretty nasty, and sadly I really didn't have anything to get the taste out of my mouth with. I was a little afraid that it would linger for a long time and then cause nausea when the trip came about, but this never became an issue.\r\n\r\nT+0:30 - I took a hot shower in preparation, it felt good but nothing too great happened. Still not feeling more than what might be placebo? I was surprised at how long it was taking to kick in, but I did find a single account online of someone saying that this one actually has a surprisingly slow onset and long duration for a large-tail psilocin analogue when taken orally. I decide to be patient.\r\n\r\nT+0:45 - This is maybe the earliest time I really felt like something was definitely happening, but it was still very weak. I started smoking cannabis at this point, slowly. I don't think I had more than this one bowl over the course of the whole experience.\r\n\r\nT+1:00 - Around this point I started listening to music with headphones on, and this is how most of the interesting effects happened. By this point I had started to notice mild open eye visuals, nothing much more than subtle movement illusions and static patterns. With eyes closed and music on, things were still what I would mostly call just barely above threshold dose, but were by no means weak. To the contrary, I actually felt even more than I have in my previous trials that there is a true hyperspace lurking right around the corner on this psychedelic. For example, though the patterns I saw were still transparent and not very colorful, they were not just your typical flashy geometric patterns, but were more along the lines of watching the many layers of biological life slithering around just beneath the surface of reality. Typical tryptamine visionary content made itself known as well, such as turning faces, arms reaching out, and beautifully impossible clothing and ribbons swirling around the hallucinated body imagery. Out-of-body-type visuals were also dimly present, such as seeing myself floating with arms stretched out and up in the distance. During much of this my body could almost not be felt at all, though I would not say that I felt I ever actually left it. There were also some flashes of very large images of entities that were similar in style but different in visual theme to my experience with MiPT. There was some decent music enhancement as I had had on that trip as well, but nowhere near as deep.\r\n\r\nT+2:00 - Most of the fun visual peak has concluded by now, or maybe I just got tired of trying to bring it out. I started thinking about life instead, and about how awesome I felt. I didn't really feel like I was tripping too much at all in a traditional way.... Mostly I just felt like senses were enhanced and I had a building energy. Even at this point into the experience, the body high didn't quite feel like it was done developing. It had been something more of a background event during the heavier visual phase, but now it was developing into more an actual desire to move and be active. I decided to get out of bed and play with my roommate's dog for a bit. After a while of that I got tired and went to lie down again, and while I was just lying in the darkness my thoughts started to go down an erotic path. I ended up testing what enhancement effects it had in that sense as well; it was not the most stimulating thing in terms of what one would want from an aphrodisiac, but the fantasy intensification and immersion it caused sure was intense!\r\n\r\nT+4:00 - Not much more to report until this point; I mostly just kept thinking about things and appreciating how I felt. About this time though I took another shower and had fun getting lost in thought which was more intense than usual, and then I ordered myself some food. I got myself a tuna melt and onion rings, which was amazingly delicious when it arrived. There was a definite enhancement of the sensory pleasure in this way, but in a very general sense. I mostly just felt really good still, but nothing incredible to report. I was still having mild warping visuals with eyes open at this point though, which I found kind of impressive for a weaker trip on a psilocin analogue.\r\n\r\nT+6:00 - This is around the time that I decided that I was mostly down, aside from some lingering energy and motivation, though counterbalanced with some exhaustion. I had to go attend to my other responsibilities in the day around this time, so I stopped really paying attention to the timeline of my state after that.\r\n\r\nNow, I would like to properly explain something, so please allow me to go on a little bit of a ramble here. Based on my research and personal experiences, I have noted what I believe to be a few activity patterns among tryptamines. I should say first of all that I am someone who considers 4-HO-DiPT to be the most similar psychedelic to psilocin, though I know that many do not. I will explain my reason for thinking this, and some other views of mine in the process.\r\n\r\nThe four simplest additions to the tail of the psilocin molecule would be 4-HO-MET, 4-HO-MiPT, 4-HO-MPT, and 4-HO-DET, so of course I can understand why it would make sense for one of those four to be the most similar to psilocin, and I have met people who believe that most of them are. However, I personally find 4-HO-MET to actually be fairly unique, being flatter and less profound than any mushroom or 4-AcO-DMT experience I've ever had, but at the same time being a lot more colorful and geometric, more euphoric and energetic, more technological and demented, and even showing some notable visual similarities to LSD, DMT, and phenethylamines. On the other hand, I actually do find 4-HO-MiPT to be more comparable to my psilocin experiences than 4-HO-MET is, but it still very notably has an erotic, euphoric, and visual style that I can only compare to the latter. It sort of feels like a step back in the right direction from 4-HO-MET, but without abandoning some of the unique spin it puts on things. 4-HO-MPT I just tried recently and found it to only vaguely resemble most of these in general, it was possibly the most unique tryptamine I have experienced yet. The visions were more developed and real than the others but in a way very different from that of psilocin. Of all of these four, I actually surprisingly find 4-HO-DET to be the most similar to psilocin, despite the fact that it is the only one without a methyl group in its tail.\r\n\r\nMy current theory for why this could be centers around the fact that all of the research I could find suggested that extending the tail length from dimethyl into an asymmetrical structure could alter activity more than extending it into a symmetrical structure. So, in this case, a methylethyl, methylisopropyl, or methylpropyl tail could be expected to have some unique properties that may not be added on to a diethyl tail. In correlation with that, 4-HO-DET for me actually does produce three-dimensional imagery in a way just like psilocin, causes breathing walls at a similar level of intensity for me, has a similar kind of overwhelming headspace, and so on. Though, something else it also very noticeably has that psilocin does not is some of the demented style I also found in 4-HO-MET and a bit in 4-HO-MPT, but not so much in 4-HO-MiPT. So far, my thoughts about this are that perhaps there is a second structure-activity relationship found within these wonderfully complex substances which is altered to a similar degree by increasing the bulk of the tail in either direction, thus accounting for some similarities between 4-HO-MPT and 4-HO-DET that I find have even more of this than 4-HO-MET, but that maybe some of this activity is disrupted by splitting the tail at the end, thus leading to some loss of this quality in 4-HO-MiPT. This would then account for why 4-HO-MiPT is actually more like psilocin than 4-HO-MET in certain ways.\r\n\r\nSo, based on my experiences so far, I do feel that in this way the bridged tails still resemble the activity of their non-bridged counterparts more than other tails of equal bulk, given that I find 4-HO-MiPT much more like 4-HO-MET than like 4-HO-MPT, and I imagine that it could be for this reason as well then that I find 4-HO-DiPT to be so similar to 4-HO-DET. In fact, given that I've already stated how I find 4-HO-DET to be the most similar to psilocin of the aforementioned tryptamines but with some of that demented quality as well that I do not find in 4-HO-MiPT, it stands to reason that one might expect 4-HO-DiPT to basically be in the same relationship to 4-HO-DET as 4-HO-MiPT is to 4-HO-MET. In other words, when step back closer to psilocin. The only thing that needs to be considered about the diisopropyl tail, though, is that its unique bulk seems sufficient to hinder activity in the typical psychedelic sense of strong sensory distortions and intricate patterns, so there is much less of this than would be present on an equivalent dose of psilocin for me, but I find this quality to be largely superficial. What I find much more significant is the fact that, without the extra twisted aspect of 4-HO-DET in the picture, the three-dimensional visions and the like that I also get on 4-HO-DiPT just go back to literally being even of the same emotional and visual theme that I would expect from psilocin. The mindset also becomes less rushed, and I am left more contemplative like on a powerful mushroom trip. Ultimately, what I am left with is a trip that feels a little darker and less colorful than psilocin, but makes me think about the same kinds of things, shows me mostly the same kinds of visions, and takes me just as far out of myself.\r\n\r\nNow there's a reason that I wanted to cover all of this, and the first part of it is that 4-AcO-DALT for me felt as though it was inhibiting some of its own typical psychedelic qualities in the same way that 4-HO-DiPT does. The visuals with eyes open for me have always been very light warping or breathing or some light wheels, but nothing like I would expect from other psychedelics. \r\n\r\nThe thing I have been able to compare these the most to by far has been 4-HO-DiPT, and this time was no different; it even gave me little black shadowy dots moving all over the place in the exact same way that that does. One of the significant differences however is that, unlike 4-HO-DiPT, this 4-AcO-DALT has consistently shown itself to be more like 4-HO-DET than it is like psilocin. It is a very mind-centric trip in the way that 4-HO-DiPT is, but it takes me to some similar but different places. The second part of the reason then goes into this, which is that I specifically noticed that some of the extra qualities that the diisopropyl group takes away from the diethyl group for me were left untouched by the diallyl group, despite the loss of other properties. Though, it was not as similar to 4-HO-DET in other ways as 4-HO-DiPT, and I expect that this is because it will turn out to be more like 4-HO-DPT overall, but I have yet to take that one for comparison. Basically, though, the point of what I'm saying is that 4-AcO-DALT feels to me to be in the same category of unique trip as 4-HO-DiPT, but that compares more to higher-end synthetic tryptamines overall than it does to psilocin.\r\n\r\nSo in the end, I actually think that 4-AcO-DALT is a very intriguing substance. This subtlety that compares to 4-HO-DiPT is one of the things I really love about it, and especially since it encompasses a different but equally important realm of tryptamine experiences I am familiar with as well. Though I do intend to push higher in the future to fully get to the point I want, I also have to say that at this dose there were no side effects of any kind, and my body felt quite comfortable either just relaxing or getting up and moving around. \r\n\r\nThis is truly a wonderful substance, if you know how to treat it right. It doesn't seem like the kind of thing that will completely blow me away at anything less than huge doses, but that potential does genuinely seem to be there and it is still a very nice and easygoing tool at lower concentrations. Though I think may not get around to using it again for quite a while, I will still be excitedly looking forward to when that day does come.\n\n\n\n\n\nExp Year: 2015ExpID: 107236\nGender: Female \nAge at time of experience: 24 \nPublished: Oct 25, 2015Views: 698\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}