{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t 300 ug\n\t\t oral\n\t\t ETH-LAD\n\t\t (blotter / tab)\n\t\t\n\t\t\n\t\t  \n\t\t   \n\t\t smoked\n\t\t Tobacco - Cigarettes\n\t\t  \n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   160 lb\n         \n\t\n\n\n\n\nWhen I came into the online psychedelic scene, the fact that there exist many novel lysergamides besides LSD was well-known, but the idea of any of them being available seemed a flight of fancy.  For whatever reason, no one had decided to make them available, probably due to difficulty of synthesis.  So, many years later, when LSZ and AL-LAD became available, and later 1p-LSD, I was absolutely elated.  I haven't gotten to try LSZ, but when I tried AL-LAD I knew these novel lysergamides were class acts in the psychedelic pantheon.  I enjoy AL-LAD very much.  I find it quite visual, and in a different way from LSD or anything else, and it's quite euphoric, though there seems to be a certain depth lacking.  1p-LSD is also great, I find it slightly different from LSD but quite similar.  But when reports of ETH-LAD started surfacing, I had the feeling it might have as much potential as LSD itself.  \r\n\r\nSo when I was gifted two 150ug hits, I was beyond excited.  I waited around for a good opportunity to try them... I wanted it to be something memorable.  That time came on Saturday, October 17th, 2015.  I had plans to go river hiking; this is what I name the activity, which involves going to an absolutely beautiful small mountain river which winds its way uphill and is filled with boulders and fallen logs and other obstacles.  I use these things to balance, jump and climb up the river.  Halfway there is a very tall and gorgeous waterfall which I climb to continue.  I have done this activity at this place many times (at least 30) and I am confident in my abilities there.  My good friend, the one I trip with most often, was coming with me.  \r\n\r\nAbout 15 minutes before arriving, I took both hits, for a total of 300ug of ETH-LAD.  There was no taste, just like with the other lysergamides.  Though people have by and large been reporting that it's as potent or even more potent than LSD, and that even 1 tab is quite strong, I have found that with all other lysergamides including LSD I have a high natural tolerance, always have.  For example, 300ug of LSD (admittedly estimated) is for me a nice dose, but not too strong, and AL-LAD does not even really get too interesting until 450ug.  So into my mouth the 2 blotters went, 300ug of ETH-LAD.  My friend took 2mg of DOC, which is the usual drug we take for this particular venture when we take a psychedelic for it.  We finished the drive and started hiking into the forest to get to the spot.\r\n\r\nI began feeling it right when we finished the trail hike down to the waterfall (it begins at a lower waterfall), about 50 minutes after taking it.  I suppose I had felt faint alerts before then, but it was at that point it started to take off.  The first thing I noticed was that I felt a wonderful tingly lightheadedness that reminded me very much of LSD.  Colors were suddenly brighter, much brighter in fact.  The blue sky radiated at me with a sharpness of color that took my breath away.  The green and yellow and reds of the leaves were jewel-like in their intensity.  As he and I smoked a cigarette, a 'pulsing' effect began to happen with my vision.  It's hard to describe, but it was like whatever I looked at was pulsing towards me as if moving to a heartbeat, perhaps my heartbeat, but I was not aware of my heart at the time.  This effect was rather intense but quite breathtaking.  A warm feeling was quickly building in my body.  Again, it reminded me of LSD but was much warmer and softer.  It almost felt like a more frenetic mescaline energy.  I was significantly altered already and the pulsing effect was a bit visually disoriented, but I felt serene nonetheless.  There was a bit of euphoria but not like with AL-LAD, where it feels drug-induced and pointed (not that that's a negative thing).  Rather, this euphoria was more of a peaceful, natural feeling, partially brought on by my setting and partially brought on by the beauty I was perceiving, which was enhanced substantially by the drug.  Mentally, I felt a bit scattered, which is common for psychedelic come-ups.\r\n\r\nUpon finishing our cigarette, we began the journey.  Nearly every step along the way requires planning, balance, and strength.  I know the route very well, and so does my friend; we've probably taken a psychedelic on this route half the times we've done it, though usually it's DOC.  The water level was moderately high and rushing, which added some to the difficulty, and it was COLD.  The water was so cold that it hurt and numbed immediately, and kept hurting for a good 20 seconds after removing our feet from it.  The rocks were also cold.  The air temperature was probably about 50-52 degrees, and the elevation is around 4500 feet.  But the sun was out, and before long I had removed my long-sleeved hoodie and was lightly sweating.  The effects of the ETH-LAD kept picking up, smoothly but relatively rapidly.  My friend commented that he was feeling the DOC pretty strongly, more strongly than he expected.\r\n\r\nWhen we stopped for a minute at the first checkpoint ('Fallen log checkpoint number one'), about an hour and 20 minutes after taking it, I realized that I was tripping pretty hard.  It was at this point that the peak began.  The most noticeable thing was the visuals. about an hour and 20 minutes after taking it, I realized that I was tripping pretty hard.  It was at this point that the peak began.  The most noticeable thing was the visuals.  I generally don't get very strong open-eyed visuals, but this was about as altered as my vision has ever been on anything.  I couldn't believe how intensely I was hallucinating.  Everything was crawling with patterns.  It reminded me of LSD's visuals except this was MUCH more intense than any dose of LSD I have ever taken, as well as a little different in character - it reminded me of mescaline also, though primarily it was like LSD.  \r\n\r\nWe kept moving on, getting to more and more difficult parts.  I found myself needing to pause and focus before putting my hands on a rock because the lichens and variations in texture and patterns on the rock would be morphing so wildly that it was hard to tell where I was putting my hand.  Looking at the sky, the myriad blue hues seemed to swirl and pulse so intensely that I found it disorienting.  Looking at my friend, his face seemed to morph steadily from young to old and withered.  His mouth, when it moved, would seem to be dozens of mouths outlined, all moving independently.  Lip reading would have been impossible, but my hearing was unaffected.  It was like looking through a psychedelic soup.  This soup was beautiful, however.  The colors of the patterns were many and varied.  Crisp, clear patterning was emerging constantly from everything.  I was amazed by how altered my visual field was, far more with the eyes open than with them closed.  My balance and coordination were unaffected, though I was so altered that it seemed amazing to me that they were.  Despite having to navigate a dangerous rocky obstacle course through a psychedelic soup, I felt at ease and was able to make my moves confidently and without trouble.  \r\n\r\nI did find my ability to speak was a bit compromised.  As usual, my friend and I were having intense and thought-provoking conversations about the nature of life and humanity while we jumped across things and avoided the water.  I had things to say, but it was sometimes hard for me to get them out, so I mostly listened.  This effect seemed to come in waves.  One minute I'd feel pretty chaotic in my head and I'd feel at a loss for words, and the next I felt fairly sober mentally and easily able to communicate.  I get this effect from LSD as well, as if the base state of it is just an altered sobriety, but I go off regularly on little mini-trips where sobriety is not part of my state in any way.\r\n\r\nThe hike continued in this manner, over increasingly steep and intense terrain with a lot of climbing.  I chose some of the slightly less difficult routes in some places than I usually do, just because it seemed prudent, but I was amazed by how easily I was able to do it, as was my friend when I told him about what I was experiencing.  My visual field was profoundly altered, in fact I don't think I've ever had such strong open-eyed visuals other than from DMT and ibogaine, but I was still able to process what I was seeing, even if I sometimes gasped at the intensity or beauty of a rock or a log or the water.  \r\n\r\nEventually we made it to the tall waterfall in the middle, at the apex of the difficult and dramatic terrain.  There's a large rock you get to by walking up a fallen tree (better get your feet wet first for traction, because the log has been weathered perfectly smooth), and we always sit there and take a breather.  Usually we smoke a hitter or two of weed, but we both felt this day like it was not necessary.  I was in a place that a lot of people would be terrified to be in (physically), with a myriad of opportunities to seriously hurt or kill myself, and I was, amazingly, fully functional despite how hard I was tripping.  Adding weed might have catapulted it into a much more intoxicating place.  My friend was having a perfect DOC trip, and he was very animated and talkative.  We sat on that rock and just talked for over an hour.  I peaked during that hour too; my moments of being lost in the trip and in my head were more often, and the visuals were, if possible, even stronger.  I looked around at everything in wonder... the sun was behind a tree up at the top of the south-facing ridge, and the beams of light bursting from around the tree formed a high-definition scintillating rainbow kaleidoscope.  The trees breathed with the wind and sparkled with green, red, orange, yellow and coral colors.  My arm gave off majestic and long-lasting tracers, as did insects.  My friend's face continued to morph through a spectrum of ages and crawl with thin, crisp, colorful patterns.  \r\n\r\nWe talked about all kinds of things, and eventually got to some details of his childhood and the way he was that I never knew.  I definitely got the sense he was choosing to share that with me and he was a little shy about it, which was really endearing to me.  I feel like I know him even better after that.  I think that easily could have happened anyway, but the psychedelics were certainly helping to facilitate an additional level of empathy and desire to communicate.  \r\n\r\nAfter an hour or so, we moved on and climbed the waterfall.  It's actually too smooth to climb directly (plus the water was dangerously cold), so what we do is pull ourselves up the side by rhododendron branches.  At the top is an angled, wide, polished smooth expanse of rock that is part of the waterfall, but you can walk around on it and it has some of the most amazing patterns in the rock that I have ever seen.  There's also a band across the whole thing at a certain elevation that looks like concrete but feels satiny smooth.  We thought it was concrete the first time but then we noticed that there are veins of quartz shooting through it.  The whole area is breathtaking no matter what state of mind you're in, but it was phenomenal on ETH-LAD.  We made our way up to the top of that and checked the clock on my phone... it was 4, so about 2.5 hours had passed.  The visuals were starting to die down a bit (just a bit), and my demeanor started to become more jovial and outgoing, because I felt great and it was getting easier for me to communicate.  We pressed on, through the upper stream, a flat, slimy section that's much less dramatic and fun - the river becomes a fickle temptress up there, fooling you with unstable rocks that look solid, invisible slime, and lulling you with its slow, flat flow - but which has endless stands of blueberries and blackberries during the late Summer.  Sadly, it was too late into Fall for there to be any left.  We continued having great and amusing conversations about ridiculous hypothetical things on the way. \r\n\r\n At one point we looked up and my girlfriend was standing there - she had come with us but doesn't particularly enjoy risking life and limb in a raging boulder-strewn waterway, so she hiked around elsewhere nearby once we left the car.  Apparently we had walked right by her a couple of times, but we were looking down at our feet and she was so quiet that we didn't notice her.  By this time, about 5:00, I was accustomed to the trip enough, and the intensity had gone down markedly, so I was able to make the social adjustment easily rather than feel a little awkward.  She knew we were taking a psychedelic but she did not join in on that and there are times that can make me feel a little awkward before I adjust, but this was not one of those times.\r\n\r\nWe were pretty close to the car so we headed back to on the trail.  Along the way my friend was walking barefoot (part of river hiking is doing it barefoot, it's so much better that way, and you start to use your feet partly as hands, and a lot of the time we also walk in the forest trail barefoot to work on our foot pads), and some lady commented on how he was brave for doing that.  Right then he stubbed his foot on a rock sticking up out of the trail.  He didn't think much of it at the time but near the top we started noticing little spots of blood on the ground in his footprints, and he had become aware of pain and was limping.  When we got back to the car we took a look.  When he stubbed his foot, a sharp edge of rock had caught him right above the bottom front foot pad and his pinkie toe foot pad, his foot's Achilles' heel, a tiny stretch of soft skin, and it sliced pretty deep into/under the bottom of the foot.  It was flapping quite dramatically and bleeding pretty steadily, though not to a dangerous level.  We reacted pretty quickly, my girlfriend got some alcohol and bandages from her pack and we cleaned it out and wrapped it up.  It could have probably used some stitches but none of us had stitching stuff and my friend doesn't have health insurance so he just intended on really cleaning it out and bandaging it up better when he got home (which he did).  He was definitely worried about it but we still chilled the whole way back (45-50 minutes), and listened to various good music from Ray Charles to Herbie Hancock.  There was definitely music enhancement, though by this time I was solidly off the peak.  The visuals were mostly gone, though colors remained brighter and everything just struck me as beautiful.\r\n\r\nWe made our way back to my friend's house, where our other friend was having a birthday party/bonfire, along the Blue Ridge Parkway, to beautiful sunny mid-Fall views and great music.  On the way back we stopped for some beer.  When we got back and got in to join up with our two friends, the birthday girl and her fiance, I starting feeling the trip a little more again, due to the change in setting and additional socialization adjustments.  The rest of the night went really nicely, I felt a warm, comfortable glow and significant mood lift until I went to bed.  I drank a 40 ounce beer and some of another one throughout the night, until around midnight when my girl and I left.  Like with LSD during the plateau/comedown, alcohol mixed well, it provided a little extra social lubrication and felt nice. There was much hilarity to be had that night, and the atmosphere definitely felt festive.  At one point me and another friend took turns jumping over the fire/through the flames when the fire was high, which was really fun.  When I got home with my girl around 12:30, we had some nocturnal adventures before we went to sleep and that was great, the remnants of the ETH-LAD did not inhibit at all and in fact I would bet that ETH-LAD is pretty pro-sexual (but hard to say for sure by then since it was barely a factor anymore).\r\n\r\nI was really impressed by ETH-LAD.  For one thing, I don't seem to have as high a tolerance for this as I do for the other lysergamides.  300ug was very strong.  The come-up happened fairly rapidly, but it didn't feel uncomfortable to me (though keep in mind that after all these years of using psychedelics, I rarely feel uncomfortable during come-ups anymore, especially lysergamides).  \r\n\r\nThe most powerful part of the trip for me was the visual display, which left me awestruck and was truly up there with the most altered my visual field has ever been.  The visuals were in many ways like LSD's visuals, in style (though more colorful and more intense) and also in that they seemed to be more than just simple patterning and seemed tied in with my thoughts, but they also seemed to have less content.  I think this is because of the biggest difference I could see from LSD, which is that the mind was a lot less out there and active.  I felt pretty grounded, really, very centered.  The trip felt a lot like mescaline in certain ways.  I felt very open at the heart, and the feeling was a warm, stable, tingly glow.  \r\n\r\nI found my mind was pretty still much of the time, though it could be because of the activity, focusing hard on physical moves.  But on DOC when I river hike my mind floods with thoughts the whole time, so I'm thinking it may be a quality of ETH-LAD itself.  It's not that I didn't have out-there moments, it's just that for the most part I felt centered and capable and able to function.  If I had been hallucinating that hard on LSD or mushrooms or something, I feel like I would have been really out there, and not really comfortable or safe doing a river hike... I'd have been in psychedelic thought loop territory.  ETH-LAD's feeling was very zen, especially as time went on.  I didn't feel like it stimulated me energy-wise... my mood was better and I was excited to be out, and I had plenty of energy, but I feel more of an actual energy boost from LSD (or mescaline for that matter).  I felt comfortable the whole time, and the tail end was beautiful as well, without any negative aspects (but I also don't get any sort of negative aftereffects from LSD).  It felt much more similar to LSD than to AL-LAD, though all 3 share a character of body feeling.  AL-LAD feels more outright euphoric though, I get giddy on it and everything is hilarious and awesome.  With ETH-LAD I felt euphoric but in the way that mescaline makes me feel euphoric, more of a deep contentment and peace, though it seemed there was less empathy than with mescaline.  Visually, ETH-LAD outstripped even AL-LAD in every way.  AL-LAD has some beautiful visuals too but it's more like a web of patterning, in pinks and greens and blues primarily, whereas ETH-LAD was any and every color, and beyond color, in a more LSD-like fashion where the visuals are varied in style.\r\n\r\nI'd like to try this again at the same dosage in a different setting.  I'll probably want to take it with this same friend while we listen to music and drift, and then play music post-peak and see what happens.  Something tells me doing this with a close friend is going to be better than by myself, and he and I trip in the same kinds of ways so self-exploration is not inhibited at all with him.  I think I maybe didn't give some deeper mental effects a chance to develop because of doing such an external activity that required a lot of focus on the moment.  It was meditative and I'm glad we did it, it's a beautiful thing to do, but next time I'd like to see if it will also show something deeper.\n\n\n\n\n\nExp Year: 2015ExpID: 107251\nGender: Male \nAge at time of experience: 32 \nPublished: Nov 17, 2015Views: 888\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}