{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t 100 ug\n\t\t oral\n\t\t 1P-LSD\n\t\t (blotter / tab)\n\t\t\n\t\t\n\t\t   T+ 2:00\n\t\t 100 ug\n\t\t oral\n\t\t 1P-LSD\n\t\t (blotter / tab)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   244 lb\n         \n\t\n\n\n\n\nFirst things first: 100µg taken at T:00, another 100µg taken two hours later, on an empty stomach. As others have noted, this stuff is very slow on the come-up; 2 hours after my first dose I still felt no changes at all. Perhaps this is because I am a big guy physically, I dunno.\r\n\r\nBy T:+5hrs I was very much into the thick of it. I had read somewhere that, because 1P-LSD mimics one's serotonin molecules, one would have a significantly lesser experience on the substance if one were taking SSRI drugs in one's everyday life. Whoa: I needn't have worried. At all. I got the full Monty, the 'round the world in eighty days' with a deluxe ticket.\r\n\r\nHow to describe the sensations? All I can say is, somehow the user is gained access to his fuller set of emotions and thoughts. Freud was right: Our everyday waking thinking is cluttered with so many defense mechanisms: Here's a discussion online of these: http://www.utahpsych.org/defensemechanisms.htm We humans will do anything to hide from the truth of ourselves! The only problem with this is, it is our lies and obfuscations that make life a real, fucking drag. In other words, the brilliant naked truth of the now is truly 'where it's at'. I'm not a Christian, but the New Testament has Jesus saying, 'Let the dead bury the dead.' And now I see what he meant: each of us owes it to ourselves to pursue truth and harmony and goodness, and there is a whole lotta fucking bullshit that we don't really want to turn our attention to. Apostle Paul also tells us to think about the good shit, not the fucked-up stuff.\r\n\r\nBut in this 1P-LSD frame-of-mind, a lot of the obfuscations that clutter our daily thinking are dissolved, and, for once, we get to see the greater picture of who we are, and our role in the cosmos. To me, the metaphor felt like entering a huge, ornate golden temple, in which you are free to study everything in the architecture-- from the basement of the building, to its achingly beautiful jewel-studded concaved ceilings.\r\n\r\nI became very aware that, wherever you find yourself in life, you got yourself there because of your daily habits of thought, word and deed. This 1P-LSD test felt rather like the ancient Egyptian idea that your soul would be tested against the weight of a feather. In short: being a good person is important! (As naive and Polyanna-ish as that sounds in today's complex world.) Buddha was right: You want to think correct thoughts, perform correct deeds, because each of us stands on a flimsy tendril of grace versus blame.\r\n\r\nInterestingly, even on 200 mikes, my external world never did 'dissolve' or dramatically mutate... However my artist's eye became electrically acute to shades of color and infantesimal nuances of balance. I never felt that 1p weas showing my anything... that wasn't there ALL THE TIME. So, in short, if I did see OEV's, they were simply my brain showing me all manner of cascading harmonies of sacred geometry... that are with us at all times, if we but sensitize ourselves to them.\r\n\r\nCEV's? Yes, vast panoramas of interlinking cells, in pulsing red, orange and yellow, endless arabesques of mathematical relationships.\r\n\r\nThere was no 'bodyload' to speak of on 1P-LSD. No nausea or unpleasantness. Just a sense, maybe of frazzled nerves and fatigue after about 11 hours of tripping.\r\n\r\n1P-LSD was a very emotional experience, intense for a guy like myself who considers himself something of a tough guy and an egghead. I had many moments-- thank God nobody saw me--- of simultaneously laughing and crying with extreme intensity. The very things in life that are pathetic... are staggeringly hilarious, and vice-versa. And for the same reasons. The crying had to do with becoming aware of how all creatures hurt and suffer at times... and the laughing is all about my instinctive knowledge that 'God' is always there with infinite forgiveness. So one minute, I'd find myself crying with shame and pathos... then the very next moment finding it all uproariously, staggeringly, cosmically funny, because I knew that God always loves me and forgives me. Only trippers know this feeling, I think, of simultaneously laughing and crying-- at the same thing, for the same reasons.\r\n\r\nI also found myself thinking much about women... women in general, and the women in particular in my life. I found myself deeply touched at the humbleness and selfless love that the women in my life have given me. [I even decided to tell a few women how I felt online ... 'Oh, thank you... for loving me!' They took it very well, I must say. haha One girl replied, 'Well, all I did was LOVE you!' And I wrote back: 'I know, and I can't believe you DID!'] I began to see the Catholic representations of the Madonna and the Virgen de Guadalupe, etc., and I realized they symbolized the vast humility, sacrifice and tenderness that women bring to each of our lives. I had the feeling of: 'Honestly, I don't know how women put up with us men at all!'\r\n\r\nAs Ram Dass has decribed, you find yourself stepping into all the 'characters' you have ever played in your life, and you begin to see Shakespeare was right: All the world is a stage and each of us simply plays different characters. In fact, in this heightened state, I began to perceive many different planes.... like a glassy millefeuille of amber panes... between my 'real reality' and the myriad of fictions I have entertained... in books, movies and theater. You start to ask yourself things like, 'Well I was a real boy once... Was Huckleberry Finn a real boy, too?' And the answer is YES: Our lives are the sum-total of not only our 'real, external events' but also of our imagined events... as with plays and fiction. Pablo Picasso once said, 'Anything you can think of is real.' And he's right.\r\n\r\nOn 1P-LSD, I often found myself vastly thirsty, especially for vitamin C. So I downed two of those EMERGEN-C drinks, and indeed felt much better therafter.\r\n\r\nI did some art in PHOTOSHOP whilst at the peak of the trip; I had hoped 1P-LSD would give me some insight into art and the artistic process. I was NOT disappointed: I produced three art works that I am extremely proud of. The images are 'me', but a me infinitely refined in discrimination and taste. The pieces basically 'created themselves', and I was just the monkey delivery boy who made them happen in P'SHOP. I had a ringing perception of truth at this moment, and it was THIS: All artists, in all mediums (including music, dance, poetry, painting, sculpture, architecture), have the same task: They are trying to discern sacred geometry. Period. Read that sentence again, if you must. Every artistic experiment, it became clear to me, was about trying to tune into sacred frequencies of light and sound that redound and spangle and pulsate and shimmer and vibrate and concatenate. Whether you are Kandinsky or a four year old child or a cave-dweller, whether you are Leonard Bernstein or a Cajun fiddler, you are trying to tune into sacred harmonies. If an artist has a 'muse' at all, it is his inner sense of what perfection can be, or could be, and that 'perfection' lies in the infinite, exquisite, whisper-delicate harmonies of mathematical relationships.\r\n\r\nIn short, the 1P-LSD trip was amazing and extremely rewarding. Never once did I feel myself sinking into a 'psychological hell' (as I once did on LSD in the 1980s). It's 24-hours later now, and, while I'm totally functional now, I am still basking in a certain colorful, harmonious glow.\n\n\n\n\n\nExp Year: 2015ExpID: 107233\nGender: Male \nAge at time of experience: 53 \nPublished: Oct 19, 2015Views: 2,046\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}