{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t 5 mg\n\t\t oral\n\t\t Allylescaline\n\t\t (powder / crystals)\n\t\t\n\t\t\n\t\t   T+ 3:00\n\t\t 5 mg\n\t\t oral\n\t\t Allylescaline\n\t\t (capsule)\n\t\t\n\t\t\n\t\t   T+ 4:00\n\t\t   \n\t\t smoked\n\t\t Cannabis\n\t\t  \n\t\t\n\t\t\n\t\t   T+ 4:00\n\t\t   \n\t\t smoked\n\t\t Tobacco - Cigarettes\n\t\t  \n\t\t\n\t\t\n\t\t   T+ 6:30\n\t\t   \n\t\t smoked\n\t\t Cannabis\n\t\t  \n\t\t\n\t\t\n\t\t   T+ 6:30\n\t\t   \n\t\t smoked\n\t\t Tobacco - Cigarettes\n\t\t  \n\t\t\n\t\t\n\t\t   T+ 9:00\n\t\t 1 \n\t\t smoked\n\t\t Tobacco - Cigarettes\n\t\t  \n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   70 kg\n         \n\t\n\n\n\n\nAllylescaline HCL: 10mg divided into 2 staggered doses\r\nWeighed on a calibrated .000 scale\r\n\r\nPrevious experience with Alcohol, Cannabis, MDMA, 4-AcO-DMT, LSD, Mushrooms, 2C-B, 5-MeO-MiPT\r\n \r\nNo tolerance is expected. It has been one week since my most recent RC experience (6mg 5-MeO-MiPT)\r\nI have been researching Allylescaline online for the past several weeks while searching for a mood brightener and emotional opener.\r\n \r\nWith this batch of Allylescaline I have:\r\n  Reagent tested, results as expected\r\n  Allergy test at 100-200ug, no noted effect\r\n  Allergy test at 1mg, no noted effect\r\n \r\nToday I will be testing 5mg as a further allergy test, with the possibility of taking another 5-10mg a few hours later to push towards a threshold test, if desired\r\n\r\nBegin report:\r\nBreakfast of yogurt, toast and coffee at 9:00am\r\n \r\nt+0:00 5mg\r\nt+3:00 5mg\r\n \r\nt+0:00 = 9:30am I have weighed out two capsules of 5mg each and another 5mg to be parachuted immediately\r\n \r\nt+0:15 Slight excitement noticed, without checking in, slightly sweating palms, already? Unexpected. At this point I keep saying that it is likely 'all in my head'\r\n \r\nt+1:00 GF (sober) and I have left for our friends house to walk her dogs, in and through parklike settings\r\n \r\nt+2:00 Occasionally feeling, alerts? Just a little? I am surprised by this and am starting to check in with myself a little more frequently now. Possibly in my head, possibly not. Either way, I feel clear headed, conversational, not acting strange, and having a very nice time. I leave to buy groceries and return home\r\n\r\nt+2:30 Chill and mellow mindset, calm, but I have noticed that I am starting to experience 'anxious palette', where the roof of my mouth dries out somewhat. I've experienced this occasionally in the past while on Tryps and Phens\r\n\r\nt+3:00 Dropped another 5mg on returning home. After considering my options, I have committed to attempt a threshold trip and am shelving the other 5mg for now. t+3:00 Dropped another 5mg on returning home. After considering my options, I have committed to attempt a threshold trip and am shelving the other 5mg for now. I am meeting a sober friend for a hike shortly and if the dose response curve is straight with this chem, another 10mg could make me feel a little goofy. Reminding myself that it's ok to take my time getting to know this chemical. Rome wasn't built in a day...\r\n\r\nt+3:30 Feeling slightly stimulated. Feeling really good overall, slight palm sweating again, possibly a Phen thing for me?\r\n\r\nt+4:00 While waiting outside for my friend, I pack a very small weed bump (maybe half an inch, packed into the end of a cig). Colours seem kinda fantastic, but considering that the Sun is low, being Winter, it may or may not be related. Cold air is incredibly fresh and I am loving it\r\n\r\nI can see how this could become tactile and sexual, but nothing is forced at all\r\n\r\nFeels completely like nothing, with a little bit of something...\r\n \r\nt+4:15 From what I smoked I should not be stoned, and I'm not, but I do feel the chill of the weed. Feeling very lucid and calm, but never dipping down to baseline. If this is the most that a person could expect from this, than it is enough for me. I feel great. Period. I'll experiment with higher doses in the future, but this is a very sweet moment\r\n\r\nt+4:30 Becoming more social\r\n\r\nFriend has picked me up and we are (he is) driving to our hike. My friend confirms that the Sun is quite normal and that my colour perception is enhanced. He also tells me that I seem to be in a really good mood\r\n\r\nt+5:00 Lunch of pasta and potato salads\r\n \r\nt+5:30 Arrived at the hike location. We are at the base of a local ski hill, there are lots of people around and it is very cold. Getting out of the car I feel chilled and I have a brief moment of 'I don't wanna...', but I realize that this is only one of many possible responses to the cold, I put on my touque, pick a new response and off we go. I'm having no real difficulty with the snow and ice, no clumsiness or loss of coordination to speak of\r\n \r\nt+6:00 Arrived at the lookout, great view and lots of birds that will land on you and eat right from your hand. I'm possibly a little over excited about this and am having a great time. I check myself a couple times, concerned that I am getting a little loud, there are others here and I dont want to take away from their experience. The hike down is half walked and half slid (like skiing, but with no skis), so much fun\r\n \r\nt+6:30 Once at the bottom of the hike I pack a little weed into a cig. again. Still feeling great\r\n\r\nt+7:00 The weed hit may have increased the intensity of my buzz and as we're driving down the mountain I have a slight sense of flying\r\n \r\nt+8:30 Weed high seems to be fading somewhat now and my eyes are feeling cool and fresh. I am getting so INTO each moment, I occasionally lose track, or at least mind, of where I'm going or what it is that I am doing. Although, as soon as I ask myself what it was I was doing, I remember with ease and clarity\r\n \r\nt+9:00 1 cig. Tastes, smells and feels good\r\n\r\nThe brief thought of sucking the helium out of some nearby balloons makes me giggle.\r\n\r\nI really seem to have a lot of control around guiding my emotions in whatever direction I want. It is a very good feeling\r\n\r\nt+9:30 Still feeling it with no real drop yet, if there is, it's so subtle that I don't notice it. When I stop to consider it, I can easily become distracted. If I'm not feeling it, I'm definitely still affected by it.\r\n\r\nt+10:30 Arriving home for supper  rice bowl and vegetables\r\n\r\nStarting to feel a little tickle in my throat, no idea if it relates\r\n\r\nI feel as though my problem solving has increased today, nothing big, just lots of little, simple ideas to make my present moment smoother and easier. I feel as though my problem solving has increased today, nothing big, just lots of little, simple ideas to make my present moment smoother and easier. Problem presents itself... 'I could just do this... Problem solved.'\r\n\r\nt+11:30 I could be at baseline, possibly, but I still feel really good. This could be the tail end or afterglow at this point\r\n\r\nI keep feeling excited about this chemical/experience, and I am very excited and encouraged to repeat, at this dose or higher\r\n\r\nt+12:00 My eyes are now feeling tired. I feel like I'll sleep well tonight\r\n\r\nt+13:30 Just finished watching a movie, War with Jason Statham and Jet Li. Approx. 11:00PM. Today has been a full and pleasant day\r\n\r\nI expect that I will sleep well tonight\r\n\r\nt+14:00 Walk and final cig of the day. I could be at baseline, but I don't feel tired/wiped out/tripped out, just satisfied and ready for bed\r\n\r\nt+14:30 Bed and quick to sleep\r\n\r\nt+22:00 I wake at approximately 7:30am. Slept well, feeling rested and ready to go. No headache/hangover/tiredness. Slightly higher than normal energy level is sustained through the day and I have a very productive day\r\n\r\nReflections and Commentary \r\nJust prior to my second dose, I might have said that it felt a tiny bit morish. After the second dose, and after I committed to letting this experience be nothing more than a chill adventure, the sensation seemed to lift. The extra dose? The resolution? Uncertain which might have caused it. All in all a positive experience. I am looking forward to repeated experiments with this chemical\r\n \r\nI do not see this as a trip drug, per se, just an overall good feeling. If this was sold in your local drug store, the box would say 'Take this and feel wonderful for the next 12 hours.'\r\n \r\nMy visuals only consisted of deepened colours and a slight loss of sharpness at distance, but never so much that it became an issue. As my sober companions were driving, I had no problem reading street or highway signs and navigation on my phone was easy\r\n\r\nOn more than one occasion I commented that the feeling was similar to the beginning of a good beer buzz. A little more alert, an added touch of energy, a good mood boost and an eagerness to do something with friends\r\n \r\nThe mood was very level and consistent, I observed no waves of intensity, just a constant elevated mood throughout\r\n \r\nThere were a couple times that I felt as though this could go to a really sedated place OR a medium to high energy place. I could veg. out on the couch or go for a hike. Either/or seemed to be satisfactory\n\n\n\n\n\nExp Year: 2014ExpID: 107463\nGender: Male \nAge at time of experience: 43 \nPublished: Dec 8, 2015Views: 623\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n",
  "doses": [
    "T+ 0:00 5 mg oral Allylescaline (powder / crystals)",
    "T+ 3:00 5 mg oral Allylescaline (capsule)",
    "T+ 4:00 smoked Cannabis",
    "T+ 4:00 smoked Tobacco - Cigarettes",
    "T+ 6:30 smoked Cannabis",
    "T+ 6:30 smoked Tobacco - Cigarettes",
    "T+ 9:00 1 smoked Tobacco - Cigarettes"
  ]
}