{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t 1 tablet\n\t\t oral\n\t\t MDMA\n\t\t (pill / tablet)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   130 lb\n         \n\t\n\n\n\n\n\nThe only drug other than pot that I'd had any experience with at the time was acid.  And I'd done lots of acid, enough to the point that I'd quit about 2-3 months erlier.  I'd done a bunch of online research on MDMA at websites like Erowid and Lycaeum, and had decided that I wanted to try it.  A friend of mine was going to a rave with the intention of rolling, and he usually knows people there, so I gave him money and told him to pick me up a tab.  And he did - a little white pill called a Chronic 2000.  It had a split on one side, and (much to my amusement) a bud leaf stamped on the other side.  That next weekend, I went to a rave (Together as Two) with the same friend, and my roll, and later my friend purchased a new pressed Chronic at the party.  Anyways, we ate our tabs at around 12:45.  It was weird for me, as I get very strong placebo, even when I eat normal pills like Asprin or Tylonal.  With this, however, there was no placebo at all.  About 15 minutes later, I'd noticed that things just seemed kind of different.  No specific effects, yet, but I knew the roll was coming on none the less.  \r\n\r\nThis being my first roll, I wanted to be sitting down when it hit (just in case).  So, we went and sat down, and I was sitting there.  Still no specific effects.  I'd heard that X makes you really happy and made things feel really really good.  I didn't notice either of these, but I still knew the roll was coming on.  A few minutes later, I noticed that I was rubbing my legs - not that it felt special, just for the sake of rubbing something.  It just became something I wanted to do.\r\n\r\nThen, I noticed that my vision seemed to change, just like when you do any drug, like alchohol or pot.  Everything just kinda looked different, and then I felt really, really happy!  There were a lot of people rolling at that party, with all kinds of tabs going around - Chronics, Supermans, Buddha's, Christmas Tree's, Milleniums, etc, etc - and I felt all happy for the other people who were Xing too.  I would just look at any random person, and feel like they're my best friend.  I'd ask them 'Are you rolling?'  I asked a bunch of people that, and to my recollection, only two said no.  I felt really happy for them, and knew I'd found a new drug of choice.  I was sitting with my legs crossed, and stood up slowly, which was an interesting experience in itself, and went to go get some water, on the way asking people if they were rolling.  I learned something that night - When you tell people at a rave that you're on your first roll, they'll do really cool things to you.  I got a hand massage, somebody blew onto my eyes through one of those tubes that you get at Randalls (I forget what they're called), which was nice.  Somebody else let me use a vapor mask while they rolled they're fists up my back - that felt REALLY good!  \r\n\r\nSo any way, I continued on journy to the bathroom with two plastic cups, and filled them up in the bathroom.  I looked at my eyes in the mirror while I was in there - they were pretty dilated.  Now, for some reason, I'd decided to hold both refilled cups of water in my left hand.  And, as I was walking back to where we were sitting, I lifted a cup to my mouth to drink - forgetting that I was holding two cups - and drank some water.  After I was finished drinking, I looked down at myself, and realized that I'd poured water all down my shirt.  I would rub my soaked shirt on my stomach and chest and shoulders, and that felt really interesting, too.  Later, we went over to where the speakers were.  We leaned up against them.  It was my friends idea, and he enjoyed it - I didn't really get anything out of it, but while there, I noticed a guy who was laying down, with his head inside one of those little square holes on the speaker.  I looked at him, and he looked at me, and we smiled at each other - He looked reaaaaaally happy =)\r\n\r\nEventually we went back to where we'd started, and sat back down.  My roll was starting to wear off now, and I wanted to keep rolling, but I noticed something else.  The come down off X didn't suck like it did when I took acid, which was the only other drug that I really had to compare to X.  When I would take acid, during the come down, my muscles would start to ache, I would be hungry but not want to eat food, and I'd have that acid taste on my tounge.  With X, I simply became sober again, and I thought to myself, 'Wow, I really like X'.  It's now been almost two months since that roll, and I hope to do it again very soon.  I've read alot about tabs that are DXM, and one that was 95\\% guaffesin (ugh)...I'll just have to hope I don't get one of those.  Well, just thought I'd share my little experience with all you happy people out there....So, until next time, farewell.\n\n\n\n\n\nExp Year: 2000ExpID: 11\nGender: Not Specified \nAge at time of experience: Not Given \nPublished: May 30, 2000Views: 2,488\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}