{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t 1 tablet\n\t\t oral\n\t\t MDMA\n\t\t (pill / tablet)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   170 lb\n         \n\t\n\n\n\n\n\nEcstacy was first brought to my attention by a friend. My immense interest in the chemical world and the idea of 'consciousness expansion' coupled with her descriptions of the experience allowed my normally well behaved reserved self to try the drug (i.e. i'd only smoked weed once prior). Also, The fact that my four closest friends were going to do it didn't hurt either. Still, I was a bit concerned about it because the night before a close friend very knowledgable and experienced with drugs had sternly warned me against taking e and told me it was a stupid drug. \r\n\r\nPainfully curious and wondering if ignorance is bliss, I went ahead and did it anyway. On the Saturday before, three friends of mine had attended a techno dance club (not old enough, I was unable to get in). Two of them, we'll call these girls M and A, took the drug and related the experience as amazingly pleasant. The other boy, S, didn't have the money to purchase the drug but still managed to have a wonderful time dancing, hugging, and feeling the 'vibe' of the other people around him, most of them on ecstacy. Since my guy friend, P, and I were not able to join in the fun at the dance club because of our ages and S still really wanted to try the drug, a few days later we had a small gathering for all of us to do it for the first time at the house of A. Despite the fact that both of A's parents were home, we were in no way deterred from enjoying the experience and had little threat of disruption from them as we kept almost exclusively to her locked room. \r\n\r\nThe night in question was a cold December Wednesday night, the first day of our Christmas Vacation. About an inch of snow had covered the ground making driving a slight bit hazardous but a rather mild danger compared to a lot of storms one faces during Midwest winters. Uninformed and unprepared I brought nothing for the evening. Thankfully my friend M and I stopped on the store on the way there and picked up some suckers and for ourselves and our friends to enjoy. \r\n\r\nAbout 8:15 P.M., M and I made the 20 minute trek to A's house (She lives in a town 20 minutes away from the rest of us but still attends our high school) over the slick snowy roads and arrived safely. There we waited for A's guy friend, G, to bring the pills. I would estimate the lovely white round Buddha in my memory to be about 100 mg. G and two girls with him, J and K, took their pills about 8:45 PM and left to go to see some other friends but would return later.\r\n\r\n Impatiently M, A, and I waited in her room for S and P to arrive as we promised to all take the pills at the same time. About 9:15 PM they finally arrived and we took the pills in her room. Waiting for the e to kick in we sat on her bed and floor watching some tv. Quietly we sat through most of a rerun of 'Married With Children' until A told us she was starting to roll and couldn't watch tv anymore. So we put on some music, turned off the lamp, put on her two strobe lights and it didn't take long before the rest of us were rolling as well. I was probably the last to start feeling it. At first I was quite confused as A had P rub Icy Hot on the back of her neck. I didn't understand their fascination with a small blinking red light in a keychain either. I looked at it a while trying to see what they saw but it didn't capture my attention much so I went and sat on her bed. More content than usual to observe, I watched as S put on a Vicks mask and started dancing. A few minutes later my crush, P, approached me with a handful of Icy Hot and vigorously but soothingly rubbed my hands. Still fairly 'with it' at this point I got my hand free for a second so I could put my rings in a pocket before they completely slipped off. This was the last fully rational conscious thought I can remember having that night. \r\n  \r\nSince none of us were into techno rave-dancing that much the first time we rolled together we found ourselves content to just sit there touching each other's hands and arms and legs. The only words from this time I can remember are few. I can remember the euphoria of hearing P tell me 'Your skin feels SOOO good!' as he and i 'made hand love' and then soon I felt him touching my face. Unlike my second ecstacy experience, there was a long time where I was completely uninhibited and free of self consciousness. And whatever regret or embarrassment I might feel for anything I did that night is wiped away when I realize how honest with my feelings ecstacy let me be, and how easy it was for me to act on my feelings. That one little touch was all it took and soon I was touching P's face as well. Unable to express my deep romantic feelings for this guy friend of mine, through the benefits of ecstacy I was finally able to gaze deeply into his eyes. And for a long time I think I felt him looking back into mine as well. \r\n\r\nI think the peak of the experience (certainly my most pleasant feelings came then) was when the five of us all laid on her bed in a fully clothed orgy of bliss. All of us agreed that this is what Heaven must feel like and since I don't fully buy into the concept of Heaven I was quite pleased to think that for just $30 (G is able to charge an exorbitant amount of money for the pills due to the fact that so few e dealers exist in this area and we are just a bunch of stupid kids) I can experience Heaven any time I feel like it. I was also quite pleased with the fact that as I knew I was experiencing the peak of my euphoria I was still able to realize that I wasn't meant to feel this good all the time. I would describe it as much like a 'soma holiday' from the Aldous Huxley novel, BRAVE NEW WORLD. Our stay in Heaven eventually came to an end with some loud knocking on the door. A bit panicky as we thought it was A's mom coming in to tell us to turn down the music, we quickly got out of bed and braced ourselves for being caught. Thankfully, it was just G, K, and J returning to join our ecstacy party and we quickly forgot about our the fears we felt from our imagined close call. Still, the damage was done enough in the fact that we never fully returned to that Heavenly dream bliss we found lying together on the bed. The 5 of us also lost part of the closeness that we all shared together on that bed. \r\n\r\nThis is when some mysterious bad things started to happen. A bit distraught with P being less affectionate with me than I wanted and ignoring me pretty much as soon as, K and J arrived, I sort of withdrew further into myself. I just laid there not really moving but thinking and observing. I suppose the only way I can explain my state of mind at this point was kind of drunk. I can remember making very dumb hand gestures with my hands to the music while laying on the bed trying to amuse myself acting quite stupidly. Once I heard P comment to A about my dorky hand movements, I became a bit hurt so I quit and decided I was just going to pour out some icy hot and rub it on myself. Unfortuneately in a moment of inspired genius I tried dispensing the icy hot by squeezing it as I held it right over my face! At first I didn't feel the cold glop on my face but as I heard K instructing me to get up quickly and go to the bathroom I was quickly brought back to the reality of my situation.\r\n\r\nMy mind filled with dread as I wondered if I was going to be blind forever and I repeatedly asked them if I was going to be okay. Luckily my eye had been shut VERY tightly and it didn't take long for the cool water to wipe away the cream. To this day I've still never felt any pain from my icy hot injury, discounting HUGE embarrassment. Washing off my face in the bathroom I also noticed the very disgusting brown dissolved sucker floating around in my mouth. I had been generating so much saliva sucking on that thing that the stick to the sucker had long disappeared and I had been too lazy or too out of it to just throw the gross thing away. For about the next 5 days the roof of my mouth was VERY raw and sore because I had been rubbing the sucker so hard up against it in the midst of my trip. As I looked at myself in the mirror with the disgusting dissolved brown ball in my mouth, my gross looking red left eye, and my irritated scarlet flushed cheeks I sobered up considerably.  \r\n\r\nAfter just 2 or 3 minutes in the bathroom I calmed down and returned to the bedroom to just quietly lay down on the bed, forget about my stupid behavior, and enjoy the party. Minutes, maybe hours passed and I laid there just enjoying the scenes and the people talking around me while I kept silent in my own uninterrupted universe until I noticed P squatted close to the floor with his eyes closed not moving. I brought this to the attention of K and M and we quickly moved him to the bathroom. There all of us (aside from A who just watched the scene from the bed) took turns slapping his face and praying he'd regain consciousness. I remember standing helpless and terrified as K lifted up his eyelids to display lifeless white marbles and pulled the sucker from his mouth so he could not choke and hopefully speak. The whole scene was eerily similar to the episode of Real World Hawaii where Ruthie has alcohol poisoning and has to go the hospital. \r\n\r\nFinally we removed P's shirt and G put a cold wet towel on his back and dumped water on his face bringing him slowly back to life. Within ten minutes P was totally revived and ready to have fun again. The frightening part of this whole thing is that none of us know what caused P to freak out so bad. G, a very experienced ecstacy user and raver, later remarked he had NEVER seen anyone have a reaction like that to e and just thought that P had epilepsy and the seizure was caused by the strobe lights in A's room. Perhaps even scarier is the fact that P has no recollection of the entire thing, it's a total blackout, and an hour after the whole thing he was asking G if he could buy another pill. We still don't know what caused P's blackout, if it was a medical condition or just a bad pill. Another scary moment was when S and A were on the bed waving their cigarettes like glow sticks and accidentally burned each other, and had to be told by M that their skin was bubbling. \r\n\r\nAbout midnight G, K, and J left again to take J home. They returned to A's house about an hour later, with a terrifying account of almost flipping G's car over on the icy dark country road, with the car up on two wheels at one point. Slowly, the drug began fading away, getting fainter and fainter each time I gazed at the clock. About 4:00 AM, K and G went home for the night. The rest of stayed at A's house until the morning. While all of us found our bodies rather tired our minds were still wide awake and it was impossible to sleep. For those last few hours P, A, and I rested on P's bed with S close by in a chair. We hugged and touched but tried not to talk too much as that interfered with our thinking. M laid by herself on the floor and that was very pleasing to those of us up by the bed. We just didn't really care for the effect that e has on our friend M, causing her to talk endlessly and redundantly about herself repeating banal uninteresting stories we had heard at least five times already. For example, M informed us all for the eighth time at least that she was such an amazing child that it only took her two weeks to potty train for fear that she would ruin her strawberry shortcake underwear. Several times I wondered aloud 'Why did she just say that, OUT LOUD?' and my friends, as annoyed as I, often yelled at her to be quiet. \r\n\r\n About 5:30 AM S and P left A's house to get to the kid's house they told their parents they'd be staying at before sunrise. After about 15 minutes of hugging and saying heartfelt goodbyes they left me, A, and M to finally retire for the night. Only able to sleep about 3 and a half hours with my arm pressed firmly over my face to keep my eyes shut, I woke up amazingly rested. This alert feeling didn't last much longer than the car ride home but sleep still didn't come very easy at home on the couch. I laid there watching television, as it was the only way I could get my mind off thinking about the crazy night before, and about 12 retired to my bedroom to sleep about six hours until my angry mother woke me for dinner. A bit tired for the next few days I was eventually able to catch up on sleep. When I decide to do ecstacy again, if I decide to do ecstacy again, I plan to take a very long nap before I go out for the evening.  \r\n\r\n Despite the overall pleasantness I am not able to totally forget the night's darker moments. Looking back I have to grimace at the thought of actually for a second touching my crush's armpit and in the midst of caressing his face wiping snot from his nose but at the time nothing felt more right, and any digusting impropriety became exceedly hilarious. \r\n\r\nThere were a few unexpected other sensory treats that ecstacy provided me with as well. Being a rather introverted shy person yet very interested in the behavior of others, I enjoy observing and found ecstacy to be very beneficial and compatible with this activity. After the drug was wearing off a little my friend A asked me if I was enjoying the experience and commented how I was very quiet and just kept saying 'Whoa!' as I laid there in the bed comfortable not to move. Not curled up in a fetal position but it was more like my body was sleeping but my mind was awake. I don't recall any sort of intense colors or hallucinations one might associate with LSD or shrooms but watching my friend S dance was one of the most beautiful things I've ever seen. His shaggy brown hair was loosely wound into about 20 dreadlocks and flew wildly as he moved to the rhythm. Seemingly in time with the beat, the strobe light provided an interesting still frame effect. It seemed like the whole time I was watching my friend dance in slow motion, as if I was watching an old black and white movie one frame at a time. His shadow was also rather breathtaking with the pointy strands waving and bouncing away from his silhouette, also seemingly synchronized with the music. A second unexpected treat came when we knocked over a glass of water onto the floor. My senses were so amazed and pleased by the chilling pool of water amidst the the furry soft carpet that I suggested spilling more water on A's carpet. Thankfully the others involved expressed a bit more restraint than I and convinced me against ruining her floor.\r\n\r\n Finally, there was one last thing that troubled me about my first experience with ecstacy. The guy who got us the pills, G, told my friend A that ecstacy was addictive. He also told her that there was heroin in the pills. I have to wonder about things that G says, however, because he also swears he is addicted to acid when most people agree that LSD is NOT addictive. And, my other very experienced drug using friend who even though he told me not to use ecstacy, told me it was NOT addictive and pointed out that even if there really was heroin in the pill, the amount of heroin would not be enough to do anything. I suppose this confusion and basic lack of information just proves to me why the War Against Drugs is such an awful thing. Because what those just say no campaigns and D.A.R.E. t-shirts are fighting against are not the drugs themselves, but information about drugs. Real, honest information that sites like erowid.org provide. Thanks whoever might read this. Stay healthy and have fun! \r\n\r\nSo to take inventory of the evening...\r\nThe Good-\r\n  - the orgy bliss\r\n  - the most pleasant feeling of my life\r\n  - closeness with friends\r\n  - the sensory treats\r\n  - satisfied curiosity\r\n  - lost inhibitions\r\n\r\nThe Bad\r\n  - i made an ass out of myself\r\n  - i saw a friend lose consciousness\r\n  - the guy who got us pills told us they had heroin in them\r\n  - two of my friends believe they're addicted \r\n  - i accidentally stepped in K's puke\r\n  - S and A got cigarette burn scars on their hands\r\n  - sick feeling and unable to sleep the next day  \r\n  - $30\r\n\r\nIs it worth it?\r\nYOU DECIDE.\n\n\n\n\n\nExp Year: 2000ExpID: 12\nGender: Female \nAge at time of experience: Not Given \nPublished: May 30, 2000Views: 1,958\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}