{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t 1 glass\n\t\t oral\n\t\t Datura\n\t\t (tea)\n\t\t\n\n\n\n\n\nThis is my experience with the Datura or Angel Trumpets as we call them.\r\n\r\nA few years back I had heard of the Angel Trumpet. A few persons I had known had done this and overdosed. But me being very curious told some friends and they went and picked some flowers. We boiled them and made a few gallons of them. We then mixed the juices diluted with a little water with tea or koolaid. We would drink it by the cup. It was the weirdest thing I had ever experienced. \r\n\r\nI was sitting in my room after I had done it, I then started hallucinating. I saw a monster come at me with a spike sticking out of its head. I saw a huge bird trying to peck my eyes out. I saw millions of cockroaches pouring out of my bathroom wall. I saw a alien when me and some of my friends walked to the corner store. I was having conversations with people who were not at my house and we were in a whole nother setting for example at school. I dont remember half of the things that happened.\r\n\r\nMy brother and his friends said one night when I did it they came in the house and saw me pouring coffee and hot boiling water and milk and sugar all over my kitchen floor. They asked me what I was doing and I replyed making coffee. I do not even remember this happening. When drinking this after a while it gave me the worst cottonmouth imaginable. My throat was so dry that it actually hurt.\r\n\r\nWe were only about 14 or 15 when we had discovered this. As a joke we made this guy drink 32 ounces of the angel trumpets. [Erowid Note : _Please_ don't dose others without their knowledge. This is extremely dangerous and uncool.  While this situation ended ok, it could have turned out much worse.] He was at our house his father came and picked him up. Next thing we know his father called my parents and said that the guy on the angel trumpets walked back to our house and he came looking for him and found him passed out in our front yard. He then brought him to the hospital which is near my house and he had overdosed. He came out of it though. I talked to him a few weeks later and he said that he saw a lot of the same things I had seen. Insects, he said I was in his room at the hospital talking to him amongst many other things. \r\n\r\nI really would not suggest doing this. Its really visual with all of the things you see but it can be so dangerous. You dont know what you are doing or where\r\nyou are. It is very frightening when you think about it.  Also if you do too much you can overdose like a few of the people I knew who did it, and if not you can end up making coffee on the floor! Or doing some other stupid things. I would stick to Pot or drugs you can control. For this you cannot control. \n\n\n\n\n\nExp Year: 2000ExpID: 28\nGender: Not Specified \nAge at time of experience: Not Given \nPublished: May 31, 2000Views: 9,471\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}