{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t 0.5 glasses\n\t\t oral\n\t\t Datura\n\t\t (tea)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   145 lb\n         \n\t\n\n\n\n\n\nI was at my friend's house and decided to try out angel trumpets.  I had heard of where a tree was and went and got two flowers, a bud of a flower, and 5 or 10 leaves.  I put about 2 cups of water in a pot and boiled all the shit for about 20 minutes.  I stained out the solids.  What was left was a yellowish liquid.  There was only a glass left now, and I drank a bit more than half of it.  Half an hour later I got kind of sleepy, and after that I the worst fucking cotton mouth of my life.  I felt kind of dizzy, and started getting a little confused.  All of the sudden I had to take a piss, but it was the hardest thing ever.  It took me about 20 minutes to finish taking the piss.  After that it was a big fucking rollercoaster ride.  \r\n\r\nI did not know what day it was.  I asked my friend if it's 'today, yesterday, or tomorrow?'  I could swear that I had cups, pencils, or shit like that in my hand, but when I went to use them they were gone.  I kept seeing people that weren't there, and when they were gone I asked where they went.  About three hours later I decided to walk to my friend J's house.  I was walking down the road talking to him, but he wasn't there.  That was when the wierdest shit happened.  I looked at the wall by the sidewalk and saw my friend walking towards me.  He stepped out the wall and I asked whats up.  He looked at me, turned his head once or twice, and then melted back in the wall.  I was amazed.  A couple steps later I heard him call me, turned around and yelled what?  He looked at me turned around and then disappeared into the wall.  \r\n\r\nAfter that I saw something on the ground.  It was a cat.  I went up to pet it, and it melted into a sprinkler head.  I saw the same cat about 5 more times, and each time it was different shit.  I got realy confused, but kept on walking.  All of the sudden I heard a scooter and it pulled up besides me.  It was my friend Lil'B.  He said wassup and then I said wassup and then I was redy to ask him for a ride and he vaporized into the air.  This was pretty wierd.  About twenty yards later was the scariest visual.  My dad appeared in front of me.  I stopped moving.  He asked me what the fuck I was on.  I got real scared, held my breath, and closed my eyes for 3 seconds.  When I opened them he was gone.  \r\n\r\nThe rest of the night i kept seeing people and animals that weren't there and kept thinking I was in different places.  I've done shrooms, I've done acid, I've done mescaline, and I've done Dramamine.  This shit was definitely the craziest.\n\n\n\n\n\nExp Year: 2000ExpID: 29\nGender: Not Specified \nAge at time of experience: Not Given \nPublished: May 31, 2000Views: 4,854\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}