{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t 600 mg\n\t\t oral\n\t\t DXM\n\t\t (pill / tablet)\n\t\t\n\t\t\n\t\t  \n\t\t 250 mg\n\t\t oral\n\t\t DXM\n\t\t (liquid)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   150 lb\n         \n\t\n\n\n\n\nSomething to do with a Chandelier?\r\n\r\nI have had three or four previous DXM experiences, but I wanted to try a higher dose so to get to the third plateau out of curiosity. So, after work, I got 600 mg in pills and about 250 mg in syrup around 10:20 pm. I was a little nervous at first because I didnt know what to expect, but it would turn out to be way different than I ever imagined To try and catch some of my thoughts, I left wordpad open on my computer and managed to crawl onto my computer chair every once and a while and type what I was thinking or whatever. Im going to post exactly what it is I wrote and, in some parts, attempt to translate. In between the journal entries Ill fill in everything that was happening as much as I can remember. Youll notice the change.\r\n\r\n11:20 pm - So far, things seem a little more.. twisty. Just a second ago my computer tower started lowering by itself it seemed.. I am definitely beginning to enter the first plateau. It's been roughly about an hour since I took it all. I'm watching some Family Guy to get me in a great mood. It's odd, the episode seems slightly different than all the other times I've seen it.. Colors, rooms, they all seem.. odd. My only concern is having enough energy to stay awake. We'll see! I hope the Full Throttle was good enough.\r\n\r\nLuckily, that energy drink would be good enough to get me where I wanted to go. I spent the time waiting for the effects by reading up on more DXM reports and watching Family Guy, as I mentioned before.\r\n\r\n11:30 pm - Feeling immediate-memory loss. \r\n\r\nAnd this type of memory loss would continue through the night, though it was no more severe than smoking a lot of cannabis in my opinion. It was more disruptive in regards to time perception than it was to blatant loss of memory.\r\n\r\n11:40 - First plateau is here strong.. I'm beginning to feel real heavy.. I'm going to get some music going.\r\n\r\nAt this point, I basically crawled into my bed and began listening to music. I was deep in thought and kind of just waited for it to come. I was trying to prepare myself.\r\n\r\n12:00 - In the second plateau. Enjoyed some music on my bed and such.. Feeling a little shaky. Tingly. Sounds seem exaggerated and echoed.. Framey.. I was in my own world on my bed for a while before coming back.\r\n\r\nIndeed, at this point it was definitely still second plateau, evidenced by the ability to come back. Though, even still it was different. I got more easily caught up in another world. But my grammar and typing accuracy is an obvious sign I wasnt far-gone yet.\r\n\r\n12:06 - Very odd 6 minutes.. Felt like a lifetime. I have a sudden sense of awareness and clarity and happiness.. I don't know why. It's like I was lost somewhere and popped back here.. It ain't even over yet.. Feels like they're people about.\r\n\r\nHeh, it definitely wasnt over, it was just beginning. At this point, it was definitely getting stronger. Time seemed to inch along unusually slow. Reality was getting farther away, but I still knew what was going on. It was odd, I constantly felt like other people were there - coworkers, friends, managers, parents.. It wasnt scary though, because, oddly enough, I wondered if I shouldve had like a sitter, but feeling like all these other people were there gave me comfort. As bizarre as it sounds, it was true. What Ive come to believe is that my thoughts  which were becoming my reality  began to be personified by people I knew. \r\n\r\n12:13 - Threshhoolldd... . ,mmamaarirmnta,l.,ater\r\n\r\nI would translate the second part if I could, heheh. I have no idea what I was trying to say except I felt like I was at the threshold to the third plateau. Its really hard to say exactly when things happened through the night, but I believe it is here where I felt like third plateau was coming on. This whole part is relatively vague in my memory. Why that entry seems so mixed up and yet the next one clear I have no idea. Maybe I just got lucky with the keys on the keyboard, or perhaps had the ability to type still, but decided to be silly because I was high as hell. Who knows.. Its like Id be totally gone, though, in another world, but then Id realize where I was and clarity would flood my thoughts, as I tried to explain briefly in the next entry.\r\n\r\n12,20 - Waves of understanding? It's weird.. I don't seem to hear the music anymore.. It sounds scrambled\r\n\r\nThis was, indeed, odd.. I forgot I even had music playing. Its like it was there, but it really wasnt. It was like I would hear certain notes, but theyd be disconnected from the song and make no sense. It was during this time I laid on my back and looked at the ceiling. I had some weird thoughts about tickets and gaining entrance to something.. My fan was blowing my window curtains about and it seemed extremely strange. Then, while on my back, it felt like someone took my heart out. It didnt worry me, though, in fact, it made me smile because I felt like I had entered third plateau. \r\n\r\nThe exact time when I entered third plateau and when I exited arent very clear. Its  hard to tell. But, to test myself during the trip, I looked at the overhead light in my room and tried to figure out what it was. I didnt know. It was like I knew what it kind of was, but I could never figure out exactly what it was. For instance, I thought to myself, .. is it a chandelier? and, of course, it definitely was not. I couldnt even realize it was a luminous object  a mere lightbulb. I felt like my ceiling was far, far away. The waves of understanding basically meant like every once and a while reality would seem visible and Id venture out of a train of thought. It was during these waves where Id usually manage to type stuff in the journal.\r\n\r\nIts interesting, though, because looking back it is relatively obvious I was in the third plateau, but during the actual trip I was so messed up that I didnt even realize I was in third plateau until it ended later. I just didnt think about it, I suppose.\r\n\r\nmy bed feels like a RIDE.. WEEEEEE!!!!! omg, how fun! WEIERD>\r\n\r\nYeah, so I have no idea if I simply turned over, left and came back, or what, but I ended up on my stomach on my bed. There was one point where I felt like I could not move at all. I felt paralyzed. I wasnt worried at all, because I expected this somewhat. This moment is probably when I felt in the third plateau the most. See, its like I would want to move, and Id think okay, time to stand, but Id have no idea how to do it. Thought processes simply did not work. Eventually, Id forget that I didnt know how to stand and my body would switch to something like autopilot and Id be able to move without thinking. The only way I can explain it is like this, its like I'm in a chair and decide to get up, but I make no physical effort to stand and am left only thinking about standing. Ultimately  to accomplish anything - I simply cant think about what I'm doing, I just have to do it. Or not move.\r\n\r\nSize perception was screwed to hell, as well. The wrinkles on my bed seemed huge, and I felt like my body was curled over them due to their massiveness (even though the wrinkles were by my hand). I was just in deep thought. I think at one point during this I felt slightly ill, but I never got even close to vomiting. Its vague, but whenever Id think of some sort of problem, Id eventually forget about it and get caught up in a new thought process. Curled over the wrinkles, I still felt paralyzed. I think that the paralyzation ended when I felt like my bed was flying. See, my computer desk is next to my bed, so when I laid down, I would see behind my desk. Behind the desk wasnt behind the desk though, it was a cliff where I could fly. It seemed like a huge expanse, not just a dusty nook or cranny. I also remember looking at my mattress and seeing the patterns stretch, which would turn out to be the only real hallucigenic thing Id see. I would feel like I was sliding backwards in my bed and expected to fall off at any moment, only to realize I hadnt moved. It felt insane, and I enjoyed it.\r\n\r\nI believe somewhere around this time I went to the bathroom, which was very odd. Whenever Id stand, I felt like I was floating over my shoulders and my body was really, really short. I walked extremely strange (as is normal for DXM, obviously), and stood at my door for a few minutes staring at my doorknob. The doorknob and the door seemed cartoon-like. Its funny, actually, because I stared at the doorknob not quite sure what to do. Due to my memory loss, Id forget that I had forgotten how to open a door and Id simply go through automatically. So, as I was saying, my body decided to leave my room. As I shut the door behind me, I entered the dark hallway and was a little shocked. I felt like I had left an entire world behind.\r\n\r\nI entered the bathroom. One note I want to make is that I never made a conscious effort to go to the bathroom. My body did stuff and my mind is forced to go along. It was extremely hard to pee, by the way. I couldnt do it. But, when I thought about it, I didnt think I needed to go anyways. I think my body thought it was time for me to go, but I didnt actually have to. So, Id have to walk back and enter in my room again. Whenever Id re-enter my room, it always felt amazing. I always felt like I was rejoining all my friends, entering a fun world. Id plop on my bed and get caught up in thought again. My room was a huge expanse.\r\n\r\n12:40 - Slip and slide? we? moving bed carpet... weird stuff.. \r\n\r\nThis entry basically was saying like how I felt I was sliding on my bed and my bed was flying. The we? was a question to myself of how I felt like I wasnt the only one in the room, even though I was. I had a lot of weird sensations on my bed. Sometimes, I would feel like someone was stretching me out, while at other times itd feel like I was twisting and compressing. At one point, I felt like I was an accordion being stretched and compressed. It felt really, really good. My legs would often feel stuck together and heavy, like a board. My bed sometimes would feel like it was beginning to fly. When I looked at my bed, I didnt see a bed, I saw where I needed to be to be comfortable. However, in the end, I knew it was a bed, which was one of the few things I could actually recognize. Its almost like when I looked at things, I didnt know what they were, only what I needed them for. It was hard to type.. If I looked at the keyboard and thought on how to type, I would have no idea what I needed to do even though I thought looking at it helped. If I just let myself go with it  act and not think - I managed to get some thoughts out. \r\n\r\n12:50 - It feels like none of this bas actha,lly jappenenedit's so swierd... sinking.. I forgwet I qrotwe her5e :) immmediate memmorary going away and scuhholy shit, I,m next to my bed.. bblarg...Everything is repeating itself\r\n\r\nThe first one I actually have to translate. It feels like none of this has actually happened. Its so weird.. It feels like Im sinking.. I keep forgetting that I really did write stuff on here. My immediate memory is going away and such. . Holy shit, Im next to my bed. Blaahhh.. Everything feels as though its repeating itself. Basically, all this is saying is that, due to my immediate memory loss, it kept feeling like nothing I had done before actually happened. Id take another trip to the bathroom, forget about it, and realize that I had gone there while on my bed. I kept feeling like I didnt actually write on this. Also, it was a shock to me that I was next to my bed, for Id forget leaving my bed in the first place. My bed seemed like a separate place. That process seemed to occur several times, which fulfilled the effect of déjà vu.\r\n\r\n1:15 - insanely disconnnectected.. feels rellly coool.... iwerd..almost see myself move abnd stufff.......WIERD.\r\n\\\r\n\r\nI feel insanely disconnected. It feels really cool, and weird.. Its like I see myself move and stuff. WEIRD. This was, indeed, very strange. I got up from my bed, and it almost seemed like I saw myself get up from the bed. I felt like I saw my face and entire body sit in my computer chair before I actually got there. Its like my mind was left on my bed and it had to catch up. Extremely strange. I was still confused, but I was starting to get a little better grasp of reality. \r\n\r\nIn fact, I think its around this time I came back to the second plateau. During the trip I didnt really think so, but I believe looking back I can put the pieces together. I do remember one bit of panic. I was on my bed with my eyes closed on my pillow  probably one of the only times the entire night I had my eyes closed  my heart all of a sudden raced like mad, and I felt a little panic-y. It was like I was thrust back through a tunnel, violently tossed back into reality. All of a sudden, I opened my eyes and realized everything was alright. I think that was my brain resuming the sensation of the heartbeat through my system, which seemed shocking at the time. Its almost like I blacked out for a second, Im not even sure how long I was panic-ed. Reality still seemed far off, though. However, it was now a really high second-plateau experience instead of third. \r\n\r\n1:40: wierd.. numb.. I have no idea where I was.. Bathroom.. Wierd shit,... AMAZING. FUCKING AW#ESEOME. I a mpeake\r\n\r\nNow, in this entry I managed to go to the bathroom and actually use it. It took like ten minutes. It was odd, every time I went to the bathroom and stood over the toilet, it felt like the bowl was going to swallow my legs. I said, I feel weird and numb. I have no idea where I was.. Wait, no, I went to the bathroom. Thats some weird shit. AMAZING. FUCKING AWESOME. I am peaking. During the trip, I thought I was peaking, but looking back, it has all the signs of coming back- from the third plateau. I think I only thought I was peaking because I began to get a grasp on reality and actually realize what on earth was going on. I began to hear the music that had been playing the entire time again. \r\n\r\nL\r\nTHIS IS SOME WIERD FCKIN SHIT\r\n\r\nBasically, the rest was all upper second plateau seeing things type stuff  feeling extremely high. I dont really remember much else except I was trying to go to sleep at this point. It took weeks before I could fully appreciate and understand what had all happened. The funny thing was is that I actually went to bed kind of disappointed, feeling as though I didnt make it and going to bed would cause me to miss something. I know now this wasnt the case, but I was so messed that I couldnt realize that.\r\n\r\nIn summation, third plateau was very intriguing. I do want to do it again sometime, because I feel as though I lost something this time in having my eyes open. I almost always enjoy stuff more with my eyes closed, but I cant remember many times where I actually had them closed throughout the trip until I was trying to go to sleep, but that was after the third plateau. The most interesting parts I felt were being on my bed and just the physical sensations \r\n\r\n-=-\r\n\r\nIts now been about a month since. Basically, an hour after I took all of the DXM, I hit first and second plateau. I felt myself slip into third plateau after that, but I was so disconnected from the world that it took me a while to actually realize what was going on. I kept waiting for third plateau, unable to realize I was already there. I think one reason I didnt think I hit third plateau at the time was because I had perceived the effects listed in reports differently than they turned out. I was right enough about the effects to not get freaked out at all, but it was still way different than I expected. See, when I read things like chaotic blindness, I invisioned a weak form of literal, physical blindness. That wasnt the case at all. Sure, your physical vision isnt like it is when youre sober, but in the end it was more of a mental blindness, a block in my head it seems. Its like my eyes see the image, but thats it. I see it. I dont know what it is, what it does, or why its there  at least not in my thought process. My body still knows whats going on, but then again I'm pretty disconnected...\r\n\r\nI cannot remember my thoughts very well, but its like all the chatter in my brain was personified by people I knew, which explains why I felt like I was surrounded by people. Sometimes, Id move from my chair to my bed, but still feel like someone was sitting in the chair. Its like there was a huge mass of people discussing things above me, though not actually comprehending much of it at all.\r\n\r\nReality was extremely distant. For the most part, it wasnt necessarily that I couldnt ever think of where I was, it was more like it simply didnt occur to me that I was in my room on DXM. My room seemed like a world, and it seemed huge. Its like reality was floating above me and I was somewhere else.. Now, Id explain it like this. Sober, we have reality around us and our thoughts in the back of our head. DXM switches the two around in third plateau. First and second plateau can cause you to be fargone, but in the end you can usually know where you are if you open your eyes. However, in third plateau, your thoughts become reality and reality becomes that distant thing in the back of your head. The reality you live in retreats to the far reaches of your mind, not totally absent, but no where near your understanding or realization.\r\n\r\nUltimately, I found it to be an incredible experience, but it isnt one thats for everyone. One thing that helped me tremendously was reading up on third plateau before I did it. Therefore, all the weird stuff that happened to me didnt happen as a surprise, and I was ready for it. It is extremely dissociative, and that can really freak some people out. In my opinion (my being the key word, many people may not feel this way), I think the dissociative feeling from cannabis is scarier than DXMs, but it could be different for you.\n\n\n\n\n\nExp Year: 2007ExpID: 62834\nGender: Male \nAge at time of experience: Not Given \nPublished: Dec 8, 2015Views: 506\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}