{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t 1 \n\t\t oral\n\t\t LSD\n\t\t (blotter / tab)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   145 lb\n         \n\t\n\n\n\n\nBackground:\r\nI'm an 18 year old high school senior. Minor experience with cannabis and alcohol. No major experience with psychoactives beyond those, and none at all with LSD. Purchase five hits of LSD on blotter paper, approx. 5cm square, plain. My friend J tells me that this is 'strong acid', citing that he had tripped for twenty three hours on two hits. I couldn't determine the truthfulness of his statement, but I had no personal experience with the drug, so I resolved to take a single hit for my first experience.\r\n\r\nT + 00:00 - Roughly 4:00 PM\r\nI took out my blotter paper, detached a single dose and stuck it on my tongue. Moved it around a bit, and walked into the movie Across The Universe with my friend K. She had resolved to sit for me while I trip. Movie starts, no noticeable effects.\r\n\r\nT + 01:00 \r\nI start to connect with the movie on a really deep emotional level. Now, I had never seen the movie before, but based on other similar movies, I doubt I would have ever cried had I not been on LSD. The drug seemed to amplify my emotions past the normal barriers. The highs and lows of a regular emotional roller coaster did not limit the highs and lows I could goto on LSD. No noticeable visual or physical effects. \r\n\r\nT + ~01:45\r\nI begin getting tingling sensations in my feet and lower back. Interesting to note was the fact that they didn't happen unless I concentrated on the area in question. Unless I was conciously thinking about moving my foot or adjusting my body in the chair, I didn't feel anything. No visual effects. Still had major emotional connection to the actors on screen. \r\n\r\nT + 02:30\r\nExit the movie thinking 'That was a really good movie'. I vocalize these thoughts to K, who agrees. This is her second time to see the movie, and she thinks it is even better this time around. We get in K's car and drive for a while. I begin to have faint trails in my vision. For instance, my mind gives my hand a command to move, but it has a two second delay before the hand moves. Sometimes, this delay works the other way around, and I find my body moving before my mind tells it to. I also become intensely talkative. K and I have a most fascinating conversation about music. \r\n\r\nT + 03:00 - Roughly 7:00 PM\r\nWe pull up at a park and get out to talk. At this point, I think it is fair to say I had a minor freak out. The physical aspect of the drug, namely the tingling sensation in the lower back and feet, spreads to my entire body. If I even look at a part of my body, I feel tingles that shouldn't happen, like seeing something that doesn't exist naturally. Oddly enough, this doesn't happen with anything else I look at, although I experience constant trails no matter what I'm looking at. \r\n\r\nT + 03:15 \r\nI have what I called a moment of clarity. K will probably remember that phrase for the rest of her life because I probably said it a hundred million times. During this moment of clarity I realize that there are three distinct effects of this drug. One, is the physical high. The tingling sensation in my body that isn't natural. Two, is the visual aspects. Right now, all I'm experiencing is trails and slight fuzziness, but this expands later in the trip. Three, most importantly, is the mental aspect. I felt like if I wanted to, I could sit down and prove General Relativity. The mental capacity of my mind seemed to expand tenfold. I was thinking a mile a minute, jumping from conclusion to conclusion in a manner only a Mentat could. I felt as though this aspect of the drug would lead me to enlightenment, nirvana, heaven or some other ethereal place. Not from the innate properties of the drug, but from the sense that my mind could accomplish anything I wanted. This third aspect of the drug undoubtedly took prominence throughout the night. I continue to discuss life with K, having new insight on topics that we traditionally just went in circles about.\r\n\r\nT + 03:45.\r\nAround this time, I am extremely grateful that K is with me. She has provided topics for me to think about, which I wouldn't have otherwise been able to think about. Around this time I get the sense that I have to, in a sense, 'fight' the first two aspects of the drug to have the mental clarity that I want. If I relax my guard for even a second, the physical body high takes over and my mental capacity suffers. Around this time, a strange character shows up at our park. A car pulls up and he gets out, walking around, smoking his cigarette. Then the car drives away. He continues to wonder around the park, nonchalantly getting closer and closer to us, while trying to appear not to. We get a little spooked and head over to the car and drive away, talking all the time.\r\n\r\nT + 04:30 \r\nWe exit the car at a grocery store. I have no idea why we're at a grocery store, but we are. I said something to K to the tune of 'I need to get out of the car because I need to stop vibrating'. Her car was a diesel. Anyway, we walk around sprouts for a while, then go sit on the hood of her car. A weird woman pulls up next to us and sits in her car talking on the phone. We get spooked again and head out. \r\n\r\nT + 05:00 - Roughly 9:00 PM\r\nWe end up at a convenience store that is closed. We sit and talk, and I come to the conclusion that K is the most beautiful girl I've ever met. Not for her physical appearance, although she is very pretty, but for her mind. For some reason, it is even more evident to me in this altered state that she has the mind of a Mensa member and isn't afraid to use it. K gets out to talk to her parents, as she doesn't have a set curfew and needs to find out when to be home. She gets back in, informs me that I'm a 'tard' and starts the car. I suspect that her conversation with her mother involved more than just asking when she should be home.\r\n\r\nT + 06:00\r\nWe show up at a Chic-fil-a and go inside. They've got an hour before close, so we buy some food and sit down. I felt that a lighted place would be a good change up from parks and weird parking lots. K starts eating, but I refrain. This is odd, because she is eating one of my favorite foods, and I'm very hungry. I only feel this hunger in an odd, detached way, not at all like normal hunger. We sit and talk for the better part of an hour, until the restaurant closes. \r\n\r\nT + 07:00 - Roughly 11:00 PM\r\nWe drive and drive. I notice that when we're in K's hometown, she seems more likely to ask me questions that mean something. I also get the sense that I can tell what she wants to learn based on the questions she is asking, although we had agreed that the questions not be that way. We find our way to a baseball field in a park. This is a good compromise, as it is lit up, but not trying to sell us anything. We continue to discuss life, but much more calm. \r\n\r\nT + 08:15 \r\nWe pull up at the QT where I had left my car. I have an enlightening conversation with the convenience store clerks, in which they told me that as long as I wasn't sleeping in their parking lot, they didn't care what I did. K goes home, and I drive my car back to my house. I found that this was entirely safe, as I was not experiencing any hallucinations or visions, and the trails had subsided to the point where they were indistinguishable from weariness 'trails' that happen when you're tired.\r\n\r\n[Erowid Note: \nDriving while intoxicated, tripping, or extremely sleep deprived is dangerous and irresponsible because it endangers other people. Don't do it!]\r\n\r\nT + 09:00 - 1:00 AM\r\nI arrive back at home, eager to get some rest. I hop into bed, turn out the lights, only to find that my eyes are visualizing things without my permission. I come to the conclusion that, in the absence of mental exertion, the other aspects of the drug takes over, and the visual in particular. I turn on some music and try to make the best of it. I begin visualizing the things described in the songs I'm listening to. \r\n\r\nT + 12:15 - 3:15 AM\r\nBy this point I had almost dozed off even through the hallucinations. However, my phone, lying on the bed next to me, begins to vibrate, and I pick it up and talk to my friend J. I relate to him the concept that this is the most powerful experience of my life, and he agrees. However, as we continue to discuss the drug, I come to realize that he doesn't take it for the mental experience, he takes it for the visual experience and the physical experience. I feel profoundly moved that even within the community of acid users, there are people that don't understand its capabilities. However, I cannot articulate my thoughts to J, so I finish the conversation and call K.\r\n\r\nT + 14:00 - 5:00 AM\r\nI finish another enlightening conversation with K and go to sleep.\r\n\r\nConclusions:\r\nWhere to begin. Well, first I believe this is probably the most powerful psychoactive drugs out there. Not because of its sheer potency (although gram for gram its the most powerful thing I know of) but because of its mental aspects. I've found that most drugs are used for the physical aspects; the feeling it has on your body. LSD is entirely different. Although it has that component as well, the main thing, at least in my mind, is the mental aspect. The increased awareness of those around you. The awareness of connections that weren't visible before, and the lightening speed at which those connections are made. These things cannot be granted by any other drug I'm aware of. \r\n\r\nHowever, I feel that LSD could be extremely dangerous. If, for instance, one trips with other people that are also tripping, a negative spiral could occur. The lightening fast connections that this drug inspires can easily lead down a path to depressive thoughts. \r\n\r\nIn addition, the mere smell of food was somewhat overwhelming, and trying to eat peanut butter was disastrous.\n\n\n\n\n\nExp Year: 2007ExpID: 67150\nGender: Male \nAge at time of experience: 18 \nPublished: Dec 7, 2015Views: 537\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n",
  "doses": [
    "1 oral LSD (blotter / tab)"
  ]
}