{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t 0.5 tablets\n\t\t oral\n\t\t MDMA\n\t\t (pill / tablet)\n\t\t\n\n\n\n\n\nSunday night at a friend's party, I tried E for the first time. My boyfriend rolls quite often and wanted me to try it also. I had been thinking about it and after researching it decided to try it. I only took a half though because I had read somewhere that it was a good idea to only do half your first time. I am really glad I only took half. I took it at about 1am and then went to a room to smoke a few blunts w/ some friends. It seems like it only took about 20 minutes before the pill took effect. The only thing I remember is sitting on the bed and starting to rub my arms and head and that it feel really good. \r\n\r\nThen someone else started to massage me. I think. I really can't remember who, but I think my boyfriend did first. It wouldn't have been really cool, but when ever someone touched me it was sooo intense that I couldn't really think. The next thing I remember is my boyfriend being on top of me massaging my whole body. I was really into it. But then I wigged out. I got up and started telling everyone not to leave me alone w/ him. And not to let me sleep w/ him. I am a virgin and I want to wait til I am married, so that is why I was friggin out. The rest of the night I stayed w/ other people and really didn't stay alone w/ him until I felt I could control myself. Which took about 5 hours til I could think if someone touched me. It still felt good, but I could function. I am not sure if I will ever do E again. I would like too, but I can't until I can trust myself to not put myself in a situation to sleep w/ someone. Everyone at the party looked after me, but I should have told them what the deal was before I took the pill. I will know that if there is a next time though. So my advice to everyone out there, do the research, roll w/ people you trust, and trust yourself. \r\n\r\nEverybody get your roll on!  :)>\n\n\n\n\n\nExp Year: 2000ExpID: 68\nGender: Female \nAge at time of experience: Not Given \nPublished: Oct 9, 2000Views: 4,072\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}