{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t 4 seeds\n\t\t insufflated\n\t\t Anadenanthera colubrina\n\t\t (ground / crushed)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   192 lb\n         \n\t\n\n\n\n\nI used Cebil seeds a little over a week ago and I feel inclined to write this trip report, as my experience was so extremely profound, unlike any I have ever had, that I cannot keep it to myself.  I also think the method of preparation may be of use to others.\r\n\r\nFirst up, all things being relative I should disclose where I am at in terms of drug/psychedelic/visionary experience. \r\n\r\nMarijuana  moderately for a year about thirteen years ago and off and on the past three years, usually months apart.  Even when I have done it a few times in a week I hallucinate significantly and the experience is quite psychedelic and valuable.\r\n\r\nHawaiian Baby Woodrose  Ive done them about a dozen or more times over the past three years.  I can eat six scraped seeds on an empty stomach with no problem.  Once at a dozen my stomach was a little heavy for the first couple hours but well worth the visuals and mental judo.  Heeyah!\r\n\r\nBooze  four beers or so in a single sitting sometimes once a week, usually once or twice a month, depending on access to marijuana, in which I dont bother with drinking.\r\n\r\nLifetime vomits  3, once on vodka Caesars (shudder), twice from food poisoning.  I have a pretty sturdy stomach.\r\n\r\nI lucid dream on average several times a months and have had amazing fever induced hallucinations while awake.\r\n\r\nOK, sorry for the life story, now to the Cebil Seeds\r\n\r\nI got three grams of Cebil Seeds for $4.50, this seemed to contain about twenty four seeds. \r\n\r\nPreparation:\r\n\r\n-I took four seeds, placed them in a frying pan on low/medium heat.  After a few minutes they popped open, I scraped off the shells and threw them out. \r\n \r\n-I then ground the seeds up in a coffee grinder.  \r\n\r\n-Next I added a third baking soda and placed it in the grinder and ground it up again, mixing the two ingredients into a very fine powder.\r\n\r\n (I would have preferred lime powder as that seems to be the traditional method but I could not find any locally.  I have read on wikipedia that people have had limited success with baking soda but I think that may be due to improper preparation because it sure worked for me.  Holy hand grenades it sure worked for me.)\r\n\r\n-I then poured the powder into a small cup and added water.  I was initially hoping to add a little less water than I did, trying to make a paste but in the end I think it was good to have a little too much than a little too little.  I mixed this up very thoroughly and it became a drippy sludge.\r\n.\r\n-Since I now had sludge rather than a doughy paste I just poured it onto the frying pan and set the element to the lowest possible setting.  Within a few minutes a lot of the moisture evaporated and I found myself often pushing the sludge and smearing it around.  In a few more minutes the water was evaporated and what was left was like very dry coffee grounds.  I am no chemist but I think this step may have been important.\r\n\r\n-I placed the grounds in the grinder and reground it into a very very fine powder.\r\n\r\n-pouring the powder out onto a plate I then found that I had two modest lines.  \r\n\r\nThe Trip!\r\n\r\nMindset: even though I was rather stressed and tired as of late (also getting over a sinus cold) I was feeling quite strong, flexible and content with being alive.  Ive had a good perspective lately despite challenges in life and a steady run of adrenaline.  My hope was that Cebil seeds would offer a small window into how I may really be feeling and if I was diluting myself in any way.  Part of me was also hoping for an escape.  I think I got it all with this one.\r\n\r\nI emptied out the contents of a ballpoint pen and snuffed either line up either nostril.  \r\n\r\nNote: I had not had anything to eat for five hours.\r\n\r\nNot really knowing what to expect I then lay down on the bed and turned the TV on to a cartoon.  Unlike many of the other reports I read the slight burning sensation of it in my nostrils was fine, even enjoyable, if that makes any sense.  Maybe getting over my sinus cold it was just nice to have a different sensation, heh.  I could feel it dripping down my throat a bit and while the taste was not appetizing in a food sense, something about the warm drip simply felt right; like a sense that this must be good medicine.  \r\n\r\nMy nostrils were completely plugged and it seemed within a minute my face got very warm and in less than two minutes colors began to get very warm as well.  Within five minutes everything had shifted dramatically and the faces on the cartoon were so abstract and startling as if I were almost seeing faces for the first time, not understanding what a face really was.   I have no idea what a face is, no one does and we all have them.  We are a complete mystery even to ourselves.  OK, in retrospect not the most profound of ideas but the simple absolute factness of it struck home and I could feel my everyday world was probably going to be slipping away very soon.  I already thought that this was unlike MJ or Baby Woodrose in that things were quite quickly and with little effort very visual already.\r\n\r\nGo get the audio recorder. I said to myself.  Bolting off the bed I went to my den and grabbed the audio recorder and started recording.  I sat for a moment at my desk and the visual composition of everything I saw was absolutely perfect and felt very generated.     The colors popped out and there was a fabric of intricate normally invisible line work overlaid over everything, seemingly connecting everything as well.  All was one and connected and my sense of displacement in the world (or ego) seemed to be pushed aside or was at least swinging in and out of my current state.\r\n\r\nOver the next hour I recorded myself talking and singing (poorly cause I suck at it, but it felt good to do none the less) and found myself very consciously breathing and working my body and mind feeling and doing and simply dancing in and out of whatever muse struck.  I now realize that this has been a very rare thing for me, to be able to take a psychedelic and completely go with it.  Since my wife is very anti-drug I have had to maintain composure in the past while hiding it or doing it in somewhat public places (parks etc.), which I always realized really does have a profound effect on the outcome and content of the trip.  Anyway, it was a rare evening where I was free to explore and go with the flow.\r\n\r\nThe peak hit at about forty minutes and while thinking and dancing to myself (mentally and sometimes physically) I recall a moment where I had thought something which made me feel a little uncomfortable or upset and then I quickly realized this was simply something I had constructed in my mind, a sort of mechanism of pseudo-logic which for whatever reason I could pop on myself to alter my mood or physiology, even if it was a negative feeling it was a tool or mechanism that was constructed and simply not real.  We use these all the time to trigger good and bad feelings or simply because we have been trained to.\r\n\r\nAt this point I laughed to myself at how transparent and obvious this self illusionary trickery we impose on ourselves is, be they socially implanted or based on our developmental experiences growing up or on the contracts we make with life and it was at that exact moment it seemed (even visually) that another entity passed into and through me and my laughter was at once trigged by this entity that seemed to be in on the joke and the entity was also manifested by my laughter.  It seemed like a non-linear moment of consciousness that I was exposed to in that a key aspect of the fabric of being was revealed.  I had manifested it and it had caused me to react.  What was this moment of who I was?\r\n\r\nFrom this point I could perceive all of reality as a sea of entities with consciousness throughout at different frequencies and scales.  Individual consciousness does come to a self-observant point but is also manifest by layers of other conscious points or fields, which we could see as entities.  For all intents and purposes life was seen as an infinite layering or strata of minds/souls/spirits/Gods in a seemingly fluid conscious and subconscious ballet.  Life seems more than eternal with absolute and relative statements all being true.  In a linguistically cosmic sense an untrue statement is impossible to make for in some way it is relevant and this binds all things.\r\n\r\nAfter two hours I was back to Earth.  Wow.  When I though that four seeds cost me roughly a dollar  wow.  Not that money is any sort of issue, it just seemed like an amazing secret of some sort.   Normally that would have been it for me for the day if not for the week or month but as I mentioned it is rare that I get a free evening to myself so I decided to repeat the process an hour later.  \r\n\r\nTrip #2\r\n\r\nThis time I did it an hour after eating a sandwich and I felt a little heavy in the stomach at the beginning but it went away.  Particularly at the twenty five minute mark in which I realized that I had a ton of mucous in my nose, so much so that there was no way I could be absorbing this anymore so I blew my nose and thought, I may as well clean it out with some salt water nasal mist (oh yah, if you try this get some salt water nasal mist, very handy for cleaning out the out nose after).  Anyway, even with cleaning it out of my nose at twenty five minutes this second trip was just as strong if not stronger than the first so I think that I probably absorbed everything I ever would have so I would be confident that cleaning it out at this point is OK and you will still continue to trip and with less discomfort in the old nose.  Anyway, probably best to do it without any food in you as like I say I have a pretty steady stomach.\r\n\r\nThe first hour of the trip was very much the same intense experience and while the open-eyed visuals were certainly there I often found myself eyes closed and singing navigating very abstract ethereal hypnagogic states.\r\n\r\nThe last hour however was less about the internal/external cosmic world and much more about the external/internal everyday world.  All my problems/challenges/hopes and family/friends/co-workers were all I could think about.  I realized very innately that I must love everyone stronger than I have, particularly the women in my life, my wife, my mother and mother in law.  I was crying and laughing hard with ecstasy, joy and sadness.  My brother in law who I cared a lot about recently passed away unexpectedly and I could closely feel his presence and the impact his passing had on everyone.  I quickly and most aggressively began to get everything in order so to speak.  I made many personal contracts with myself and in the last hour even set up a lot of meetings and appointments with people that I felt I should connect/reconnect with.  This second trip really was the perfect compliment to the first in that it reinforced the importance of the everyday earthen social experience as well as the cosmic big picture.  The distance between these two perspectives in life may be great and you can easily lose yourself in either so the key of course is to develop both of them in tandem and make real connections between them.\r\n\r\nJust because I experience some sense of profound mystery in an altered state does not minimize the relationships I have with people in everyday states, be they crazy cosmic tripper or completely sober/straight materialist.  The completely down to earth everyday relationships are just as sacred and to be cherished.  If they are not sacred to ones self, one should do the work to make them so, as all of life is to be cherished.\n\n\n\n\n\nExp Year: 2007ExpID: 70151\nGender: Male \nAge at time of experience: Not Given \nPublished: May 13, 2015Views: 3,037\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}