{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t 2 hits\n\t\t smoked\n\t\t Salvia divinorum\n\t\t (extract)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   155 lb\n         \n\t\n\n\n\n\nThis was my first experience with Salvia, and my first experience with any type of mind altering substance. I learned as much as possible about Salvia before hand, and thought I knew what to expect. I was wrong...\r\n\r\nI purchased two versions of dried, crushed leaves from my local head shop, one 10x, and one 20x strength with an 80 milligram standardized extraction. That evening, my boyfriend and I sat in our living room, and packed the bowl of a small hand-held pipe with the 10x salvia, approx. 1/10 of a gram. I took a strong hit and immediately felt a sense of serenity. Nothing exciting or interesting happened; I felt in control and aware of the situation during the entire experience. At this point, I asked my boyfriend what is all the hype about. Honestly, I felt a bit let down having mostly read about experiences boarding on spiritual and out of body. \r\n\r\nA few hours later, I asked my boyfriend to prepare a bowl (same amount as the 10x) with the 20x strength, and it is at this point that I believe I made the biggest mistake. I underestimated the power of salvia, and based upon my earlier experience, I was cocky and over confident regarding my ability to handle it. based upon my earlier experience, I was cocky and over confident regarding my ability to handle it. \r\n\r\nI promptly lit the bowl and took two very hard hits. I recall looking at the table and placing the pipe and lighter down (thankfully) and that is it, I was gone. \r\n\r\nIn what felt like an instant, I was sitting in a room, in front of what appeared to be a dissolving screen. The images are indescribable and kept changing, and then I heard my boyfriend's voice and saw his face, only his face. He kept repeating It's ok, relax and he seemed to be beckoning me to come with him. It is then that I noticed others around me but I could not really see them I just knew that they were there. I felt embarrassed for some unknown reason, as if something was happening to me, but I did not know what. Why was my boyfriend telling me that everything is ok, where are we going, I do not want to go, all these people are watching me, what happened to me. OH MY GOD, no I cannot go there. In my 32 years of life, I have never experienced anything remotely close to this, it felt so damn real.\r\n\r\nI felt trapped in this place for what seemed to be a very long time, and then slowly I see my coffee table come back into view. It is then that I become aware of where I am, and what I had done; my head is in my hands, and I am repeatedly saying.. Oh my god, oh my god I never want to touch this stuff again.\r\n\r\nMy boyfriend went on to tell me that I went into a trance-like state and I began laughing, and saying things that he could not decipher. I sat on the couch, with both of my arms extended out in front of me, with my wrists and hands pointed up, as if I were holding something. Twice I got up and seemingly tried to leave, to where I do not know, and this is when he was telling me to relax and comfort me. For those of you who believe that a sitter is not necessary please think twice. My boyfriend told me that my first attempt at standing up was so violent that I pushed the couch out of position. During my second attempt, I nearly fell onto the coffee table and finally ended up sitting on his lap with my arms in the same extended position. \r\n\r\nI now realize that his well-meant attempts to comfort me only served to scare me, as I truly believed that something bad had happened to me. After my experience was over, I was sweating profusely, to the extent that I initially thought that I had lost control of my bladder. \r\n\r\nInitially, when I learned that the experience only lasts a few minutes, I was disappointed, but no longer. I am positive that had the experience lasted any longer than it did, I would have lost control and perhaps hurt myself or my boyfriend.\r\n\r\nWill I try Salvia again, I am not sure. Truthfully, I am afraid of whatever is going on in the deepest trenches of my mind. \r\n\r\nI still have a considerable amount of the salvia left, and this brings me to a second word of warning to beginners, please take the time to learn how much you should consume in one sitting. Luckily, I learned that a SMALL bit will take you there. Also, laughing on the outside ( as viewed by your sitter) does NOT mean that you are laughing on the inside, believe me I was not laughing in my head, I was scared. laughing on the outside ( as viewed by your sitter) does NOT mean that you are laughing on the inside, believe me I was not laughing in my head, I was scared.\r\n\r\nI do not wish for my experience to discourage those wishing to try salvia, I only hope that it serves to inform you of the importance of research, taking the advice of those who use the substance regularly, and most of all DO NOT UNDERESTIMATE THE POWER OF THIS SUBSTANCE.\r\n\r\nBest wishes\n\n\n\n\n\nExp Year: 2008ExpID: 70688\nGender: Female \nAge at time of experience: Not Given \nPublished: Dec 11, 2015Views: 547\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n",
  "doses": [
    "2 hits smoked Salvia divinorum (extract)"
  ]
}