{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t 1.5 carts.\n\t\t inhaled\n\t\t Nitrous Oxide\n\t\t (gas)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   140 lb\n         \n\t\n\n\n\n\nNot before this experience would I have ever entertained the notion of achieving what can only be called a 'religious experience' from something such as nitrous oxide.  In the past I had used the gas as means to surf the bizarre, to fracture my ordinary perceptions for the sake of amusement.  This time, however, the experience was so overwhelming that I felt compelled to share it with others.  I'm surprised and delighted to find that I'm not alone on this one!\r\n\r\nIt was the second evening camping with a good friend of mine.  While searching for insect repellent, he happened across three nitrous oxide chargers, a cracker, and some balloons.  Our eyes popped open upon discovering this, and we quickly decided to hop aboard some nitrous rockets.  We discharged all three whippets in to three separate balloons, and kicked off the event by inhaling half of the third balloon each, and then exhaling in to a pair of reservoir balloons before taking in the two full balloons.  This ensured that the three chargers were evenly dosed between the two of us.  \r\n\r\nThe experience began with the usual lightheadedness and 'wah wah' sensations familiar to N2O.  The urge to giggle appeared, but we both resisted it for want of retaining a maximum volume of the gas.  Then, something changed.  Over the car stereo a song was playing which had a certain crescendo that seemed to synchronize itself with the building intensity of the N2O.  It wasn't just the intensity of the music that was increasing, though, it was the intensity of its *meaning* that took on a spectacular burgeoning dimension.  The music conveyed a kind of 'suchness', which caused my heart to overflow.  My surroundings began to dematerialize, and I seemed to merge seamlessly with a faintly glowing plain of yellowish off-white reality, which pulsed with microscopic perforations of blazing colour.  My thoughts seemed to impact this bizarre landscape in the same way the wind dances across a field of tall grass: there was no longer a determinable separation between mental action and mental experience; it was like some sort of karmic short-circuit.\r\n\r\nMy mind began to race with succinct and matter-of-fact explanations for the condition of life on this planet.  My internal dialog dissolved and gave way to a clamoring reel of mental pictures, which seemed to contain in each frame an increasingly sophisticated crystallization of the whole spectra of phenomena in the universe.  It was as though the past ten years of philosophical musings on these subjects had become compressed in to a tiny time-canister:  a fitting metaphor for the compressed gas I just inhaled.  I began to realize with profound gratitude that suffering and pain are not genuine experiences, and that they are experiences which carry on in dependence upon attachment to equally insubstantial experiences that are regarded as pleasant.  The whole scope of human experience, its traumas and its triumphs, seemed to congeal behind my closed eyelids in the form of a spectacular painting, which took on the shape of an oriental style dragon, the full meaning of which had been imagined in to existence by the vast and untapped majesty of collective human potential.  \r\n\r\nThe appearance of this moved my spirit on a profound level, and when I began to return to ordinary space I discovered that my mouth was wide open with gleeful laughter, but that my eyes were tightly shut, squeezing tears of despair down my cheeks.  Somehow, I was holding in my consciousness the experience of profound and ecstatic joy, as well as utter despondency, at the exact same time.  Instead of feeling paradoxical, it felt entirely appropriate.  I felt radiant, as though shimmering with immutable joy and completeness, yet simultaneously surrounded by a limitless black expanse of endless poverty.\r\n\r\nToday, I'm still struggling to absorb the experience.  Reading over this report, I feel I've accomplished little more than to belittle the experience with the conceit of vocabulary.  When attempting to communicate the full impact of this experience to others, my mouth opens in silence, and I discover that I'm attempting to speak with my chest.  Perhaps this is a good indication of how unexpectedly meaningful this encounter with N2O was for me.\r\n\r\nBlessings,\r\n\r\nNog\n\n\n\n\n\nExp Year: 2008ExpID: 72840\nGender: Male \nAge at time of experience: Not Given \nPublished: Jul 30, 2015Views: 1,935\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}