{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t 1 hit\n\t\t sublingual\n\t\t LSD\n\t\t (blotter / tab)\n\t\t\n\t\t\n\t\t   T+ 2:00\n\t\t   repeated\n\t\t smoked\n\t\t Cannabis\n\t\t (plant material)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   100 lb\n         \n\t\n\n\n\n\nOverview:\r\n\r\nIn the past year, I have experimented with LSD and shrooms (among other drugs) quite often. I am currently 17, but I started using drugs when I was 13. The most recent experimentation I did with LSD was yesterday, while I was visiting my boyfriends college over Yom Kippur break. We had several tabs left over from the last time we did LSD, and we split them so that my boyfriend took approximately twice the amount that I did (because he is considerably larger than I am). Regardless of having taken much less LSD than he did, I definitely tripped harder, because I am young, female, and I weigh just under 100 pounds, so drugs affect me very strongly. \r\n\r\nTo be safe, we made sure that we werent using any other drugs or medications at the time. Neither of us were on any medications or pills. We were both in very positive moods, having spent a lot of time together, just relaxing and hanging around the college. We knew that the tabs were definitely LSD because we had previously taken some from the same batch.\r\n\r\nWe have each done LSD 5 times prior to this experience, along with 5 trips on shrooms, and several experiments with DXM and salvia. The only foods we ate during the trip were cupcakes and skittles, which we ate at around 11pm (during the beginning of the comedown). The body-related effects we felt were an increased sensitivity to light, an inability to focus our eyes, slight dizziness, slight difficulty walking, twitching (only for me), and insensitivity to cold temperatures. The cognition-related effects that we felt included improved mood, thought patterns that were very different from normal, short-term memory loss, an increased sense of interest and insight, and increased sexual arousal. \r\n\r\n------\r\n\r\nExperience:\r\n\r\n\tWe put the tabs under our tongues at 2:35pm and sat around watching TV as we waited for the effects to begin. The first distinct effect that I noticed was that when I looked up at the textured ceiling, I immediately saw the bumps on the ceiling begin to swirl and darken to form faces and kaleidoscope-like patterns that twisted and turned. I also began to hear the sounds from outside begin to swirl and bubble in a dream-like way. \r\n\r\nThe way I experience LSD, all the effects are ones that would normally evoke fear or paranoia. For example, every time I do LSD, I hear this strong, constant background noise that gets louder and softer in dreamlike waves. This constant noise is made up of multiple sirens, car alarms, fire alarms, and other types of alarming noises. These noises dont make me paranoid or scared on LSD, however, because despite these noises, I tend to feel very calm, with an overall sense of curiosity about these sounds, rather than fear of them. Another paranoid effect that LSD seems to have is the constant visuals of anguished, screaming faces.\r\n\r\nWhen I look at clouds, ceilings, hair, sheets, or any object with more than just a blank surface, I begin to see millions and millions of faces that are constantly moving around and changing. The faces are never smiling, however. They are in constant pain. The faces are swirling around each other with their mouths open, looking as if they are dead or dying. When I look at clouds, specifically, the faces tend to look more like skulls, corpses, and ghosts that are all attached and piled on top of one another, each screaming silently. This again doesnt bother me or cause me to have a bad trip, but I always find it interesting that LSD seems to be designed to scare the person who takes it.\r\n\r\nAnother interesting thing about the faces I see on acid is that a lot of the time they mimic the facial expressions that I make at them. As I stared at the textured ceiling in my boyfriends dorm room, I made many different facial expressions  from happiness to pain to anger  and saw that the faces tended to copy these expressions by changing their mouths from open to closed or their eyes from small to large. The only expression they didnt mimic was happiness. The faces I see tend to only have an emotional range that goes from neutral to pain. However, when I looked over at my boyfriend, who has long curly hair, I saw that he had multiple faces clinging to his hair. When he smiled at me, it seemed as if all the faces did too, however the smiles werent really visible, and the faces seemed instead to be sending out a positive emotional wave, rather than giving visible smiles. \r\n\r\nAnother characteristic of my LSD trips (that distinguishes them from psilocybin trips, for me) is that they gives me the urgent feeling that I need to explain the universe and the meaning of life. Though my thoughts rarely reach a conclusion on the reasons for the universe, I feel like I have discovered many things about life that I wouldnt have thought of without the help of LSD.  Though my thoughts rarely reach a conclusion on the reasons for the universe, I feel like I have discovered many things about life that I wouldnt have thought of without the help of LSD. \r\n\r\n\n\r\nMy boyfriend and I smoked a bowl, and then sat around watching TV and brainstorming for a while. Watching TV on LSD is one of the most amazing and confusing things to do. First of all, on LSD, it is almost impossible to see the actors as real people in a real situation, as you would normally. Instead, you see the actors reading the lines that they memorized from a script, and moving around in ways that they had rehearsed many times. Instead of seeing the emotions that they are trying to portray in relation to the TV show, I see the emotions that they feel while reading the script lines, and how they feel being at work as an actor. Commercials also seem completely ridiculous in the same way, because the manipulation involved in marketing products becomes so noticeably obvious.\r\n\r\n\tEventually, my boyfriend and I decided to go outside and take a walk around the lake. It took us almost 2 hours to get outside because we kept forgetting that we wanted to go outside, and it took me forever to put socks and shoes on, as this process took an immense amount of effort and concentration. I could feel the LSD beginning to peak as we tried to go outside. \r\n\r\nAn interesting thing about LSD is that since I have done it many times, I am always prepared for the effects, and as such, I can compensate for them. For example, I have learned how to walk normally while on acid, whereas the first time I did acid, I was unable to walk unless I was following someone else and copying how they walked. When I stood up to walk for the first time on this LSD trip, I found that the walk was quite similar to the robo-walk created by DXM, however it was very much less intense and I still had complete control over my movements. \r\n\r\nOnce we finally did make our way outside (around 6pm), we walked down to the lake and sat on a bench near the edge. Its the beginning of autumn, and the trees were extremely beautiful that day. They were all sorts of different colors and shapes, and the weeping willows that gently touched the surface of the water made the view look like the most perfect painting ever. A pair of ducks swam in the center of the lake, and another pair flew overhead, which added to the perfection of the scenery. \r\n\r\nI wanted to stay right there forever, watching the stunningly picturesque scenery. The water was perfectly calm and created a flawless reflection of the trees surrounding the lake. I wanted to stay right there forever, watching the stunningly picturesque scenery. The water was perfectly calm and created a flawless reflection of the trees surrounding the lake. At this point I began to think about water, and how it is extremely similar to air. This made me start to feel the heaviness and thickness of air, and I got up from the bench to see how air felt to move around in. I realized that the dust particles in the air are just like the sediments in water, and this connection made the world seem a lot more purposeful. \r\n\r\nFarther down along the edge of the lake, a woman began banging a pot on the rail of a bridge. Immediately, I began tapping my foot to the beat of the noise she was making. This was completely involuntary, and seemed perfectly natural. During the entire trip, there was this constant noise that was made up of the sounds of other people, cars, animals, and a background noise that my mind had put together from noises I could not distinguish. I could feel this noise, and I could move my hands through the air to control and change the noise. However, at the same time that my hands were controlling the noise, they were also just going with the flow of it, creating a perfect balance between having my hands control the sounds while also letting my mind take control of my hands. (This had also happened to me once before on a shrooms trip, where it had been more intense, and instead of going with the flow of the noise, the noise controlled my hands and moved them with it). \r\n\r\nWe got up from the bench and continued walking around the perimeter of the lake. We passed by several other groups of people who were sitting by the edge of the lake. Typically, when I pass by a group of people, I barely notice them or think about them. \r\n\r\nHowever, on LSD, any small encounter or interaction with another unknown person is a very big deal. LSD makes me unable to act normally in even the smallest social situations, because I am suddenly unable to understand what other people are feeling or thinking. However, on LSD, any small encounter or interaction with another unknown person is a very big deal. LSD makes me unable to act normally in even the smallest social situations, because I am suddenly unable to understand what other people are feeling or thinking. On LSD, I never know where to look when I am passing by a person, or if they know Im on LSD, or if theyre thinking about me, or what Ill say to them if they start a conversation with me. When this happens, my heart immediately starts to beat faster and my thoughts become even more jumbled and confused than they were to begin with, and as a result I get scared and paranoid, though I can never reason out a true cause for this paranoia. \r\n\r\n\tOnce we got back to the dorm room, we both talked about how other people immediately make us intensely nervous. While discussing this, I realized that communications between people (and animals) are very strange, and almost meaningless. This is because one person is never able to truly communicate his or her thoughts and feelings to another person. The best a person can do is to describe these thoughts with the limited amount of words that languages offer. In addition to this, people all respond differently to different situations and stimuli, and one person will never be able to understand exactly how another person reacts or feels. We are alone in our own minds... weird. We are also alone inside ourselves, and no matter how physically close you get to a person, you will always still be two separate beings. \r\n\r\nI continued thinking about minds and thoughts, and I started thinking about free will. I came to the conclusion that free will is not anything at all, and that there is not even the possibility for such a thing. If we had free will, this would mean that our actions and decisions are not controlled by reason and cause. As a result, there would be an effect (whatever action I did using free will) without a cause, meaning that cause and effect would no longer be related. Our brains prevent this free will, thankfully, so that we dont go around doing random things for no reason. Brains are computers, composed of even smaller computers (neurons), which are then composed of even smaller computers (atoms), and so on. Because of this, there is always cause and effect, and there can be no effect without a cause, and therefore we cannot just do things randomly and without a reason. Looking back on this thought, it seems fairly rational, because my view of humans is that we are very complex computers, as opposed to being the magical free-willed beings that many people think we are. \r\n\r\nWe smoked another bowl and turned on the TV again, to MTV, which was playing Paris Hiltons My New BFF. We discussed this show in great depth, and realized that the interactions between the people on this show was so deep and complicated that it was extremely difficult to understand how people can interact with each other so easily. \r\n\r\nWe decided to turn off the TV, and I let my mind wander for a bit. I started thinking about food, and how strange it was that our natural tendency was to put other objects inside of ourselves (eating). This seemed even stranger when I realized that the objects we eat are the objects that we are composed of. So, essentially, we are composed of non-living material, because that is what we eat. This made me realize that we are no different from solid, inanimate objects like beds, chairs and apples, because we are made up of the same elements (carbon, oxygen, etc) This made me realize that we are no different from solid, inanimate objects like beds, chairs and apples, because we are made up of the same elements (carbon, oxygen, etc). What I concluded from all this brainstorming was that since we are made up of non-living material, we are therefore also non-living and that there is no such thing as being alive. Since humans are able to move and think and have free-will, people have this strange idea that we are significantly different (and much more important) than objects in the world around us. Unfortunately for them, we are really just the same as the inanimate beds and chairs, and that eventually we will also become inanimate. \r\n\r\nFor a very brief moment, I got the strangest, scariest feeling that I was trapped inside life, inside my body, inside this universe, and that there was nothing I could do to escape from it. It was the same feeling that people often get when they think too much about death and become afraid of the fact that death is inevitable, and that theres nothing they can do about it (except to accept it). Fortunately, this feeling lasted only for a second or two, and didnt ruin my trip. \r\n\r\nFrom my experiences with LSD, and from what I know about it, I can tell that LSD does not create or invent new things. Instead, it just works to intensify the amount of sensory input that I receive from the world. From what I understand, the visuals that I experience on LSD appear to move because my eyes are constantly moving over the surface on which I see these visuals. Since my pupils are dilated and my eyes are unable to come together to focus on any one object, I am unable to keep my eyes still (or my body still), and therefore my eyes continuously wander back and forth across the ceiling, creating these patterns and faces that are constantly shifting and changing. \r\n\r\nAt one point during the trip, I got up from the bed to look at a Jimi Hendrix poster hanging on the wall. This poster was done in a Buddhist-style, featuring Jimi Hendrix in the center, with Buddhist deities next to him and behind him. Their arms also extended out from behind him, and altogether, this image became an intense optical illusion. The arms appeared to move, and the faces all took on a personality of their own. I began to notice details in the poster than I hadnt noticed before. My boyfriend said that he had also only noticed these details while tripping on shrooms. \r\n\r\nLSD makes sex about a million times better, to the point where it feels like a cocaine rush, but without the crash or the cravings. LSD makes sex about a million times better, to the point where it feels like a cocaine rush, but without the crash or the cravings. We had sex several times, often while we were brainstorming and sitting around in the dorm room. I recall one time we had sex, which was probably during the peak of our trips. It felt exactly like the super-pleasure rush that other people describe while doing cocaine. It was almost too intense and too much to handle. I didnt even know that was possible. However, what is really awesome about sex on LSD is that afterwards, you arent left craving more or feeling emotionally low or depressed. \r\n\r\nMany times during this trip, I also found that I could not keep my body still. There was a period of about 5 to 10 minutes when my facial muscles began twitching excessively, which made my facial expressions change rapidly. Later on, I realized that my legs had been vibrating for a while, while also twitching occasionally. I noticed this constant twitch especially at night (around 3am), when my boyfriend went to sleep. I tried to go to sleep at the same time, but my trip was far from being over, so I tossed and turned and twitched and fussed, and it was impossible to get to sleep. I remember looking at the clock at 5:22am. At this point I was still not physically tired, and my eyes were still wide open and un-blinking. \r\n\r\nHowever, my mind was tired of being bombarded with intense pulses of sensory input, so there was this huge conflict between the energy I felt physically, and the fatigue I felt in my mind. I experienced the effects of this mental fatigue for several days afterwards, in the form of minor headaches (however this could also have been the result of not having slept correctly for about 6 days in a row). I think I may have gotten to sleep by around 6:30am. Therefore, my trip lasted from approximately 3pm to 6am: 16 hours. \r\n\r\n--------\r\n\r\nRetrospection:\r\n\r\n\tThis was definitely one of the most intense trips Ive ever had, and I definitely discovered a lot more about life than I had on any other trip. What LSD does best for me is that it always makes me a lot more curious and observant about the world and about myself. It makes me think about things that we all overlook because they are so familiar to us: Things like eating, breathing, and existing. These discoveries that I make about my life stay with me, and I continue thinking about them for a long time after the trip. With each new LSD trip, I rediscover things that I forgot about. On the Shulgin Scale, this would definitely get a +++, though at times I could see my trip starting to head towards a ++++ on this scale.\r\n\r\nI have also finally figured out how to do an LSD trip the right way. This right way includes being away from people (such as parents) who will want to know where I am at all different times of the day. It also include doing LSD with someone I trust (my boyfriend), and letting other people (his roommates) know that we are doing drugs.\n\n\n\n\n\nExp Year: 2008ExpID: 74570\nGender: Female \nAge at time of experience: Not Given \nPublished: Sep 1, 2015Views: 3,138\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}