{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t   \n\t\t oral\n\t\t Morning Glory\n\t\t (extract)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   69 kg\n         \n\t\n\n\n\n\nSome information about myself first. I've been a weekly cannabis smoker for the last half year. This is the first time I use a true psychedelic drug. I'm twenty years old, studying at the university (chemical engineering). I enjoy philosophy, and I feel particularly attracted to Nietzsche's life-affirming philosophy and to existentialism in general.\r\n\r\nI read about the use of morning glory seeds, mostly in the MG vault. I got my seeds from an established supplier of (legal) psychoactive materials. The advised dose is 3 to 5g. \r\n\r\nI decided to do a cold water extraction. The seeds weighed 4.00g +/- 0.01g. They were ground in an electric coffee grinder, to a powdery/chunky consistency. This was put in a glass beaker with approx. 200ml distilled water. This mixture was magnetically stirred for 12 hours, airtight and away from light. Temperature: 22°C. The resulting dark brown liquid was found to be filtered only with great difficulty (at normal and reduced pressure), and so it was instead allowed to settle and the liquid was decanted, separating it from (most of) the seed mush. The filtrate was stored in a glass bottle and kept in the fridge until the next day.\r\n\r\nPrior to the experience, I went out with friends, but I moderated my consumption of alcohol so as to be as clean as possible the next day. Going to bed at 4.30 a.m., waking up at 9 because friend J., who stayed at my place that night, had to go. Despite a mere 4 ½ hours of sleep, I felt awake enough, eager to start the day. I wondered what I would experience during the trip. For example, as an atheist, becoming one with God would be a rather troubling experience. But the package says it gives a 'natural' trip, so I'm confident. They say psychedelics reveal your inner psyche  I consider myself happy and joyful, but am I the same deep inside?\r\n\r\nI drank the potion around 11 a.m (on a empty stomach). It tasted quite 'nutty' or 'earthly', not totally  disgusting, but the aftertaste was irritating my throat/back of my mouth. Almost retched after the last sip. Washed with some fruit juice. I went for a short walk around the block to get a hit of fresh air. Got back, put on some Pink Floyd and surfed a little on the internet. \r\n\r\nAt T+0.30 there was definitely something going on; getting dreamy. A slight nausea sets in, no actual vomiting reflexes, but some uprisings of unpleasant nausea.\r\nAround T+1: a state of the mind best described as very peaceful, dreamy, elated-euphoric, Pink Floyd is getting greater and greater. \r\nT+1.30: I can certainly eat now. Warmed up some lasagna in the micro wave. Tasted truly delicious, it was an extraordinary meal, a feast for all my senses. \r\nT+2: (Pink Floyd still playing) Went outside on the terrace, sat down in a relaxing position, looking at the green and the surroundings. Things started to get a little wavy, like ripplings on the surface of certain objects. I felt totally comfortable, very dreamy with a stony feeling, absolute peacefulness, a continuous smile, everything is perfect :-). A very nice and powerful radiating feeling in my upper chest.\r\n\r\nI felt like I could handle this trip, and went outside, towards a park a couple of yards away from my home. It was exciting to go out like this, I couldn't hide a big smile, had to hold back so as to not laugh out loud at the cars waiting for the traffic lights. \r\n\r\nThe walk in the park was utterly beautiful. I was struck by the splendour, the sheer beautifulness of these trees, bushes, flowers, etc. -- what a magic environment! It was a Sunday afternoon by the way, and there were big shows/activities in other parts of the town, so it was very quiet here. I walked across the entire park, profoundly enjoying the beauty of my surroundings, deeply moved, almost had to weep. I picked up a yellow flower growing along the side of the road, I looked at it endlessly while sitting on a bench. What a brilliant colour! All these details! \r\n\r\nI had a nice view from that place (T+3.45 or something)  all kinds of trees, a pond, geometrically trimmed bushes, pillars, flower beds with humming bees. The sea of green before me undulates slightly, and the bushes seem to breathe. The sky is filled with marvelous clouds, moving surrealistically over my head. I perceived my surroundings on a very surreal way, everything seemed somewhat strange/surreal, or in two dimensions. I feel extremely happy, this is just great. I feel totally comfortable on this planet Earth. I had some interesting thoughts, like that in fact I'm intensely connected with everything, because with the Coulomb attraction force, every charged particle feels every other charged particle. This interaction might get extremely small with increasing distance, but nonetheless it's always non-zero!\r\n\r\nWhen I continued to walk, it was like every sight was worth to be pictured on a great artist's canvas. I also noticed I was able to focus on my entire field of view, and not just my central line of sight. I decided to return home when it started to rain slightly, but when I almost got home, it seemed not to rain anymore, and walked some more in the city, admiring the architecture, the river, ... \r\n\r\nT+5: back home, still feeling greatly elated, peaceful, trippy. Listened to some more Pink Floyd (which became utterly amazing, godly, simply divine; magnificent music, totally compatible with the state of mind I was in). Watched a bit of the movie Microcosmos, which is essentially a close-up recording of miniature creatures of the earth, like copulating ladybirds. I was struck with awe for this very micro-cosmos. Some slight visuals were still present, like flowing movements in the parquet, or a hamster breathing/blowing in his poster. \r\n\r\nT+6.30: becoming tired/stoned, but relaxed. The peak was certainly over, I noticed, but a delightful afterglow sets in. I did some surfing on the web, text is slightly moving, but I can read. \r\nT+9: tired, sleepy, going to bed.\r\n\r\nDay after: no unpleasant after-effects; a calm, serene, happy mood. Flawless day at work. \r\n\r\nReflection:\r\nAs I said, this was my first experience with psychedelic drugs, and I consider this an extremely nice introduction. Beautiful, intense, but not overwhelming. A true entheogen. To be repeated. \r\n\r\nI'm an engineer student, and so I have a very analytical/scientific mind. Perceiving the world with a mind at large, a more aesthetic mind, was a great experience.  The initial nausea was not difficult to handle, I'm glad for that. Using a common dose of a psychedelic drug for the first time, without a sitter, might have been not a good idea, but I was confident, the more because the company describes its effects (for the given dose) as a mild, natural trip. I intended to just go with the flow, and that way everything went right.\n\n\n\n\n\nExp Year: 2009ExpID: 80262\nGender: Male \nAge at time of experience: Not Given \nPublished: Oct 1, 2015Views: 1,330\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}