{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t   \n\t\t insufflated\n\t\t Heroin\n\t\t (daily)\n\t\t\n\t\t\n\t\t  \n\t\t   \n\t\t insufflated\n\t\t Pharms - Oxycodone\n\t\t (daily)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   167 lb\n         \n\t\n\n\n\n\nHeroin Monster\r\n\r\nFor years, I was doing oxycotin daily. I loved the feeling that no matter what was happening, it didnt bring me down. You couldve told me that my mother had just died and I wouldnt have cried. \r\n\r\nHowever, the greatness of the high didnt sustain. After a while, I was using just to feel normal.  Basically, using the logic of a rational mind, I was spending roughly $150 ($30 a pill) daily just so I wouldnt get sick.  I basically went through my entire retirement fund to pay for my habit.\r\n\r\nThen I was hit with a new revelation  snorting the oxycotin. I was talking to a woman who, when I went to score some oxy, would ask me to get her a couple pills. We became friends only in the sense that drugs mattered. Other than that, we had absolutely nothing in common (unfortunately, my wife didnt grasp that fact because she continuously accused me of all sorts of stuff). This woman, one day, indicated to me that she snorted them. She would crush the pill, breaking the time release aspect, and snort away. So I tried it and was instantly in love.  That was when my habit went from 2 or 3 per day to 5 or 6 (80 milligram tablets).  \r\n\r\nSnorting gives a more intense feeling, but it doesnt sustain as much as eating the pills. After about 4 years of using, I came to my senses and mandated that I needed to quit using. I tried several times and found myself experiencing the most unpleasant physical pounding my body has ever experienced. I have always been one to deal with pain  I mean, while getting one of my tattoos, I actually fell asleep.  But I soon learned that not only had my body changed, so had my mental faculties. Therefore, the demon takes a solid grip of one and, in a sense, punishes one, if they try to break free.\r\n\r\nThen I found myself in a vicious cycle. I would quit and sometimes get through the agonizing days of withdrawals, but when I was feeling better, my weak mind would always justify doing some more since I wasnt physically addicted any longer.  All I needed to do was not indulge in a daily habit.  Using once a week or once every couple of weeks seemed promising. Hey, it was win-win for me because I could continue to use recreationally, I would experience the high that I used to experience, and I wouldnt have to ever worry about physical withdrawals ever again.  What more can a junkie ask for? \r\n\r\nAnyway, the most clean time I put together in the 4 or 5 years of using was 6 days and then I was using daily again. The lesson here is that an addict uses moderation to convince oneself that one is in control.   However, to a junkie, moderation is just a word  and a tortuous one at that.\r\n\r\nI must admit, when I began snorting oxycotin everything changed in my household. Prior to that, I would just pop a pill and wash it down with a beer. No eyebrows were really raised. Once I began the ritual of chopping up the pill and snorting it, my wife and my children totally viewed me as one with a problem. And once I snorted, I never again ate another pill. So there I was, chopping and snorting away and my drug use became a main topic of discussion for the majority of the day  and please dont allow the way I phrase it here to make the reader believe that we sat around the table and discussed my problem. It was more screaming and degrading.\r\n\r\nGetting my pills was never a problem.  I would just run over to Newark, NJ where I knew several people from which I could get the pills.   However, one day, and this is the first time in 4 years, I had absolutely no way to score. Everyone was out. I began to panic because I didnt know what to do and I knew that sickness waited for me. However, I was on one of the corners over in Newark and the guy suggested I buy some diesel (slang for heroin). I was like, No way. Then he convinced me that it would help me get through the night until the next day rolled around and my pills would probably become available again. Taking his advice, I bought 3 bags and went on my way.\r\n\r\nUsing pain killers, to me, didnt carry such a negative stigma. However, I was now sitting at my desk with three bags of dope staring me right in the face.  At first I was reluctant, but then I convinced myself that it would only be for tonight. Accordingly, I grabbed the picture that I always used to chop up the pills and I dumped one of the bags on to it.  Using my razor, I shaped a nice-sized line and I quickly snorted it up. I didnt expect much because I knew that oxy and heroin are similar. I figured that it would just give me a little more of the same. Was I wrong! After I snorted that first line, within 15 seconds, the high I was feeling was extremely intense. It was the most beautiful feeling I had ever experienced. My mind and body went totally numb and my mood was so mellow. From that moment on, I never even touched an oxycotin since  and that was 5 months ago. I was in love.\r\n\r\nPrior to using heroin, I was making a run to Newark either every day or every other day. Once I was introduced to heroin, I found myself making 4 or 5 runs to Newark daily. I would go in the morning and pick up 6 bags of dope and by lunchtime I was out and needed to go back. I found myself totally engrossed in a world where only one thing mattered. I would wake up and scam to get my fix and when I was ready again, some more scamming was in order and so on and so on. Using oxy, even though dangerous at the levels I was using, did afford me some sort of life. On the other hand, the heroin demon didnt want to share me with anyone.\r\n\r\nI love my wife so much and when times arose where she threatened to leave me due to my drug usage, I just pointed to the door. My children as well lost out on my attention and concern as well. My whole life revolved around the heroin.\r\n\r\nI became desperate to quit. I mean if your entire focus in life is concerned with obtaining drugs and using those drugs, then you arent living any kind of life  especially when there are those that love you. I became despondent and started to believe that my family would be in a much better situation if I were to just eliminate myself. I have tried suicide 4 different times: twice with hanging; once I did ten bags of heroin, but I guess my tolerance was just too high; and once with a helium tank. The helium tank method I learned doing research on the internet. They use it for euthanasia. It is supposedly painless and quick. I went to the local party store and rented a helium tank and fabricated a hose from a garden hose and then I found a large plastic bag to fit over my head. That day, I waited for my wife to go to work so I could be home alone and I began implementing the method as outlined on the internet. Eventually I passed out, but I guess the seal wasnt tight enough because some time later I came to with the most annoying voice. I took it as a sign that it just wasnt my time and decided to give it a go to quit.\r\n \r\nWhat I decided to do was to just quit cold turkey. However on the second day, I was lying on the floor in my bathroom because the vomiting and diarrhea was never-ending. I would struggle to the refrigerator to get a glass of something to drink and within seconds, I would vomit it back out. Eventually I wound up in the emergency room where they had me hooked to an IV where they administered so many different drugs through it. I ended up sleeping all day in the emergency room until they woke me up and moved me to the detox section.\r\n\r\nEver since then, Ive spent four different times in detox. First of all, detox, to me, was like a vacation. I didnt have to hustle around looking for a means to get drugs and then get the drugs. I could just sit there and watch television and enjoy conversation with a bunch of other junkies. However, when I got out, 2 days later I scored some more dope and used. I found myself in detox 3 more times since then, but when I got out, within a few days, I would be right back where I started.\r\n\r\nToday I am continually fighting this battle. It is monopolizing my time when that time should be utilized more properly by providing for my family and being the father and husband Im suppose to be.  The devil worked his way totally in my life and has continually fucked me in my ass. Heroin is a dead end street and if you ever come to that intersection just drive by because if you turn down that road you will gain a new perspective on human nature because you will learn, rather quickly, about the disgusting things of which human nature is capable.\r\n\r\nI wish I never messed with drugs in the first place. My entire endeavor started when I went to the dentist and I was prescribed Vicodin for the pain. I never turned back since then as my problem started with one Vicodin on Friday and Saturday night and is now at least a bundle of heroin every day.\n\n\n\n\n\nExp Year: 2009ExpID: 81200\nGender: Male \nAge at time of experience: 39 \nPublished: Nov 16, 2015Views: 938\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n",
  "doses": [
    "insufflated Heroin (daily)",
    "insufflated Pharms - Oxycodone (daily)"
  ]
}