{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t 30 seeds\n\t\t oral\n\t\t Morning Glory\n\t\t (tea)\n\t\t\n\t\t\n\t\t   T+ 0:00\n\t\t 1000 mg\n\t\t oral\n\t\t Vitamin C\n\t\t (pill / tablet)\n\t\t\n\t\t\n\t\t   T+ 1:00\n\t\t 45 seeds\n\t\t oral\n\t\t Morning Glory\n\t\t (tea)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   300 lb\n         \n\t\n\n\n\n\n300 Heavenly Blue Morning Glory seeds from an online retailer (marketed as untreated and viable) were carefully counted out. The seeds were rinsed briefly in tap water. They were placed in about half a cup of filtered water, and left to soften in a refrigerator for about 2 hours. The water was set aside and the seeds were crushed using a mortar and pestle. The crushed seeds were then combined with the water from before and additional filtered water, adding up to a total volume of 1 liter. This mixture was placed in an opaque pitcher, and left, again in the refrigerator to brew for 6 hours. Before consumption, the fluid was filtered through a very fine sieve. An attempt to use a paper coffee filter was abandoned because it was far too slow. A speckled grey and brown pulp was filtered out and discarded.\r\n\r\n0:00  I swallowed 1000 mg vitamin C. Im unsure if this makes any difference, but Id seen it suggested and it seemed pretty low-risk. I then drink approximately 100 mL (30 seeds worth) of the filtered liquid. It tastes mildly unpleasant, with a very earthy aftertaste. The liquid is murky and brown, something like muddy tea.\r\n\r\n0:30  I am unsure if Im feeling anything yet. My movement is slightly more fluid and I like to keep moving. These could be related or coincidental.\r\n\r\n1:00  I decide to drink the other 150 mL (45 seeds worth) Ive allotted for myself. At some point I can no longer stand the taste (the liquid is now room temperature) and I dilute it with diet cola. The taste disappears. I dont know if this destroyed the active ingredient or not. Qualitatively, my experience is not much different from 0:30.\r\n\r\n1:30  Im at a plus one now (Shulgin scale.) There is definitely an effect. Time is getting a little distorted. I generally feel unusually pleasant. I describe this to my roommates as stoned plus. I start to grill a sandwich for dinner, and forget about it. My attempt to salvage it creates a further mess  I fail to think through each action. Eventually I eat it.\r\n\r\n1:50  I prefer to keep my eyes closed, although when I start talking to somebody I always open them.\r\n\r\n2:10  I put in a movie I think Id enjoy to watch, but am rather uninterested by it. It seems to be progressing too slowly.\r\n\r\n2:20  I retreat to my bed and play some music I found for this event described as psytrance (not a genre I knew about previously.) With eyes closed, I connect very deeply with the music. It seems like just the right tempo. I like to move (especially my feet) in rhythm with it, but prefer to keep my eyes closed. My roommate comes in to check on me, I am still able to have a coherent conversation with her, although Id prefer to be focused on the music again. I approached this experience with a very open mind, and I think that if I had approached it with a closed mind, I could be less than stoned at this point. That said, Im quite enjoying the experience and decide to dive back in. I think this qualifies as a plus two.\r\n\r\n3:10 (estimated)  I fall asleep while listening to the music. This is not much later than when I would ordinarily sleep. My dreams are easier to remember and much less complex than usual. On multiple occasions, I wake up and try to find people who were in the dreams (they all took place in my room) for a few moments before integrating the dream. This process was somewhat frustrating.\r\n\r\n11:10  I wake up, seemingly at baseline. Much like after consuming large amounts of cannabis, I have an unusually optimistic mood, but Im otherwise baseline. This mood persisted for most of the day.\r\n\r\nFor me, the effects were notable and unmistakable, but I can see how someone approaching this with a closed mind or in a more hostile environment might have recognized no effects. I consumed the seeds in an experimental, not a social mindset, which I am confident amplified the effects.\r\n\r\nI experienced none of the nausea I had been warned about. I also never experienced any visual distortion. Overall this seems to have been a very mild dose. The experience as a whole was quite pleasant. I plan to try this again, with incrementally larger doses.\n\n\n\n\n\nExp Year: 2009ExpID: 81301\nGender: Male \nAge at time of experience: 18 \nPublished: Sep 27, 2015Views: 900\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}