{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t 10 hits\n\t\t vaporized\n\t\t Cannabis\n\t\t  \n\t\t\n\t\t\n\t\t  \n\t\t 1 cart.\n\t\t inhaled\n\t\t Nitrous Oxide\n\t\t (gas)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   160 lb\n         \n\t\n\n\n\n\nI have been enjoying nitrous oxide for a number of months now, but mostly in the company of many friends, or at parties. I had not learned to 'crack' the nitrous cartridges, and figuring it was about time, I went to my local smoke shop and purchased a 'cracker', balloon, and a box of 50 cartridges.\r\n\r\nMy first few attempts were failures, but finally by the fourth cartridge I successfully filled the balloon with the precious gas. I waited for the balloon to thaw out, twisted the top and unscrewed it from the cracker. As I inhaled and held the gas in my lungs, I began to feel a tingly sensation moving throughout my body. My vision also began to blur slightly, the objects sitting on my desk began to shift. I exhaled after about ten seconds, breathed a few more breaths of air, then inhaled the other half of the balloon. I closed my eyes and began to focus on the images that were quickly flashing through my mind. At this point, the music blaring through my headphones became very apparent. I felt as if my entire body was functioning to the beat of the psy-trance I was enjoying. The abstract symbols and designs within my mind flowed to the rhythm of the synthesizer and changed with every few beats. I began to settle into my 'trip' feeling quite comfortable with the closed eye visuals I was experiencing, then all at once, they began to fade and I started to come back to reality. I opened my eyes and enjoyed the tingling sensation for what seemed like a few more minutes, then that too finally faded. I made the decision that I would enjoy some more nitrous later on in the evening when my roommate returned from class...\r\n\r\nIt was around 8pm and I was sitting patiently in my roommate's room, waiting for her vaporizer to heat up so we could enjoy some herb. After about 10 minutes of enjoying the herb, and feeling rather high, we decided it was time to enjoy a 'whip it'. I cracked the first one and handed her the balloon. Knowing that having someone observe you while you 'trip' with nitrous can sometimes hinder the experience, I leaned back on her bed, closed my eyes and enjoyed the music and the general altered thought processes I was experiencing due to the pot.\r\n\r\nAfter a couple of minutes, my roommate finally exclaimed, 'That was so fucking awesome!!'\r\n\r\n'I know, right?', I replied as she handed me the balloon. I cracked the next cartridge , took a deep breath, exhaled, and then began to inhale the contents of the balloon. I stopped at the halfway point, and closed my eyes as I held my breath. I've always enjoyed the effects of nitrous more under the influence of marijuana or alcohol. It seems like the already altered state of consciousness really makes the nitrous experience much more intense, this time was a perfect example to back that claim.\r\n\r\nOnce again, the tingly feeling rushed throughout my body, and within seconds the abstract designs entered my mind again. Along with these images, my thoughts began to wonder. The music played a major role in how quickly my thoughts would wander. 'I love floating within the universe of the self', I remember thinking to myself. The images continued flashing, moving again to the music.\r\n\r\nAfter what seemed like five or so minutes, although I'm sure it was no more than one, I opened my eyes and realized I still had half of the balloon's contents to inhale. I inhaled the rest, closed my eyes and began to experience one of the most intense trips of my life....\r\n\r\nI suddenly felt as if I were falling backwards in slow motion. I pictured myself falling through space, over and over again, as if a video had been looped to repeat. Visuals began to flash in my mind at what seemed like the speed of light, I felt terror creeping up my spine as I watched what looked like a ghost or celestial being on fire, move rapidly in the pattern of an infinity symbol. I was deeply terrified of this being and the pattern it was moving in. I felt a deep sense of understanding as I watched the being, as if it were sharing its omniscient knowledge with me. Then suddenly it seemed as if everything came to a sudden halt. I was sure I heard a voice in my head scream 'WATCH OUT!!!!', as an image of a triangular road sign flashed through my mind rapidly.\r\n\r\nI opened my eyes and gasped for air, realizing I had not exhaled the gas yet, wondering how long it had been since I last had inhaled oxygen. It was also at this point that the falling feeling reoccurred. I also felt that I was able to predict every event that was happening in the room, the sound of the music, my roommates expressions, my thoughts, everything. Astonished, I realized that my perception of reality must have completely changed while I was floating through space. I could feel my body twitching and moving as if I were a machine. I tried to vocalize my thoughts to my roommate, but I could not form my thoughts into words. I robotically leaned back in the bed, in a series of twitching motions.\r\n\r\nFinally, after a few minutes I began to return to reality. I was relieved that I could move my limbs fluidly again. I slewed a few profanities together to try to explain the trip to my roommate, but was still too astonished to vocalize clearly.\r\n\r\nWhile the experience was overly intense, and quite terrifying, it was truly amazing. As an experienced psychedelic user, I have to admit that nitrous oxide is one of the most intense substances that I've tried. Each trip is incredibly different, and while this experience was obviously dangerous and has taught me that I need to try to be more aware of my body, it was truly educational. I know I will probably never encounter that fiery celestial being again, or feel its knowledge flowing through my body like I did on this particular evening.\n\n\n\n\n\nExp Year: 2009ExpID: 83852\nGender: Female \nAge at time of experience: 19 \nPublished: Jul 26, 2015Views: 1,165\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}