{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t 7 seeds\n\t\t oral\n\t\t H.B. Woodrose\n\t\t (extract)\n\t\t\n\t\t\n\t\t   T+ 3:20\n\t\t   \n\t\t smoked\n\t\t Damiana\n\t\t  \n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   64 kg\n         \n\t\n\n\n\n\nTo start out with my background, I am an 18 year old male-to-female transsexual. I have previous experience with a other psychedelic drugs including LSD, Mescaline, LSA, Weed and JWH-018 as well as about ten previous trips with LSH. The previous trips could be comparable to a mixture of LSD and MDMA.\r\n\r\nI began preparing the LSH (or LAH) by grinding up 14 Hawaiian Baby Woodrose seeds into as fine a powder as possible. I then placed the powder in a cup of water and added cut up fresh peppermint leaves (due to  their acetaldehyde content), as well as citric acid to achieve a pH around 4. The mixture was then overnight in the fridge, out of the light, filtered the next day and consumed by my girlfriend and I. We each drank half the mixture. My girlfriend also took mescaline.\r\n\r\nI was quite stressed the week before the trip, having just moved out from my parents place with my girlfriend, started university. At the time I was feeling quite panicky and upset. The day of consumption was on the weekend. My girlfriend and I planned on watching 'Alice in Wonderland 3D' in the cinema while tripping (the version with Johnny Depp). Prior to consumption we were both relaxed, and looking forward to the experience.\r\n\r\nT+0:00 Subtle, but difficult to place sensation was experienced almost immediately after ingestion. We then ate a vegeburger and a choc top each from burger king (we suspect this delayed the effect of the LSH).\r\n\r\nT+0:30 Waiting in the cinema lobby, colours became more vivid, with the effect increasing slowly over time. I was still eating my vegeburger, but a light stimulation meant I was unable to finish it. I knew more food would make me nauseous.\r\n\r\nT+1:00 The movie began. During the movie the experience did not seem to change much. The sense of vividness persisted, It felt like a weak LSH trip, based on previous experience. We had bought some snacks  for the movie, but I did not \r\n\r\nT+2:40 Tactile sensations were disturbed. We had been eating cheetos, and the remains on my fingers gave a feeling of rawness and grittiness. There was a feeling as if my possessions and I were disordered and dirty compared to the rest of the physical environment, a feeling similar to what I have felt on LSD.\r\n\r\nT+2:50 We left the theatre. As we started walking a sensation of floatiness and euphoria became noticeable. Empathogenic effects were felt, and a need to talk arose. Over the next half hour on the way home these effects increased.\r\n\r\nT+3:20 As we arrived home there was a stimulating body load similar to LSA, but far weaker and far more pleasant. It was around 11pm at night, and we went out to sit at our balcony and smoke a small quantity of damiana and greater celandine, which produced a weak sedating, relaxed feeling. The effects from the smoke were overridden by the LSH, but it was enough to negate the already weak body load, and create a more relaxed tone to the trip. As we were sitting outside I began to notice fairly strong closed eye visuals. The visual noise I normally see when my eyes are closed, made up of red, green and blue dots, grew far more intense and trippy in an extremely short period of time. The dots became far brighter, larger, and the spaces between the dots became a deep black mixed with smudges of a dark green. The dots grouped in threes in a triangular, rotating pattern, and the blackness seemed to radiate in a smudging fashion. This increased in intensity until the visuals were stronger than my perception of my surroundings. The need to talk was almost unstoppable. In retrospect it would not have been good to have been peaking in the movie theatre, as we would not be able to act normally at all. \r\n\r\nIn previous trips there was frequently a sense of rotation, for instance, we'd be sitting on a coach [bus] and it would feel as if we were rotating onto the ceiling. As we were talking non-stop (mostly about the visuals) we suddenly had a sensation that I had collided with my girlfriend, as if my mind had been launched at her. My 'mind' then began to rotate forward. Without telling my girlfriend she told me it felt like I had just collided with her, and that she was traveling backwards, while rotating head over heels.\r\n\r\nT+4:00 Time at this point was dilated. What seemed at least an hour was only about 20-30 minutes. As we were coming up it felt as if the LSH were catapulting us into an intense trip at an incredible speed. \r\n\r\nWe went to lie down in our bed to ride it out. It was not an unpleasant frightening intensity, as I have experienced on large doses of mescaline or LSD. However, the physical sensation of my heartbeat became quite unsettling, and I had a bit of difficulty standing. This is something that happens to me on mescaline quite often, and sometimes even on weed, where I fear my heart is beating too fast, when in reality it is not. After a short time this feeling became more manageable. \r\n\r\nAt this point in the trip we both experienced a great boost in creativity. I've always been good with words, but I began spouting poetry of a quality and rate not achievable while sober. The effect was so profound that I began to test it, speaking on and on, trying to reach a point where I had to pause and think of what to say, yet the words did not stop, and were filled with descriptive language and constant rhyme. My girlfriend and I had a sudden urge to make music with our mouths in harmony, improvising and creating music with our mouths. We normally do this, but we were able to mesh far better than normal, and the music we were making was very good. There was the same drive for making music/poetry as there was to talk. There was  also elements of a psychic connection. There was the same drive for making music/poetry as there was to talk. There was  also elements of a psychic connection. For about 10 minutes we lay down and took turns to describe our changing visuals, a face made of dots, a ship sailing on a sea of shells under a sunset, and found that often our visuals would be exactly the same at any given time. We have experienced such shared feelings and images on mescaline previously.\r\n\r\nT+5:00 We looked at the clock at this point, and were very surprised at how little time had passed. We went outside again, and around this point was hit by a massive surge of euphoria. The sensation was as if an incredibly powerful beam of energy had slammed into us, filling us with a level of bliss I had never experienced before, and certainly never with such a sense of calmness, tranquility, and clear-mindedness. This was certainly the peak of the trip. There was no need in either of our minds, no desire, we were simply existing, and were completely at peace with everything. This sensation was characterised by a flood of insight into numerous matters, ranging from the intellectual, such as my insight into the mechanics of organic chemistry, to the direct knowledge of certain philosophical concepts, such as realising that whatever happens isn't changed by how we feel about it, and that therefore there is no reason to feel negatively about anything, and no need to feel anything but the bliss and contentedness that we were feeling. There was a sense of non-duality between concepts of existence and non-existence. A deep, intimate connection was felt with the universe and beyond. I turned my attention to humans and all of their faults, like anger jealousy and sadness. Without any sense of betterness, judgement or pride I felt a loving sorrow and pity for the ways these ways they created their own misery. Surprisingly the visuals were less strong at this point then they were when we were coming up.\r\n\r\nT+6:30 At this point we were both coming down. The feeling was entirely pleasant. The euphoria slowly diminished, leaving an afterglow of happiness, and the visuals faded away. My girlfriend went to sleep, and after spending a few minutes to reflect on my own I joined her. Sleeping was not difficult at all, in fact with previous experiences with lower doses we were able to sleep at the peak of our trips. \r\n\r\nMy overall impression of the trip were overwhelmingly positive. I can hardly wait to try a similar dose or even larger again. This was easily the best trip I have ever had, though not the most intense. Based on my own experience I would quantify the experience as a ++++ on the shulgin scale. The lasting value of the insights I gathered seem similar to LSD, in that they tend to fade slightly over time without effort involved in keeping them. Either way LSH is a drug I see a lot of potential in.\n\n\n\n\n\nExp Year: 2010ExpID: 84266\nGender: Not Specified \nAge at time of experience: 18 \nPublished: Dec 1, 2015Views: 760\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n",
  "doses": [
    "T+ 0:00 7 seeds oral H.B. Woodrose (extract)",
    "T+ 3:20 smoked Damiana"
  ]
}