{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t 3 g\n\t\t oral\n\t\t Morning Glory\n\t\t (extract)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   142 lb\n         \n\t\n\n\n\n\n1. Method\r\n\r\nAbout 800 'hermetically treated' Heavenly Blue Morning Glory seeds thoroughly washed, dried and ground to a powder.  25.9g seed material added to 91% isopropyl alcohol.  Solution let to sit in an airtight container for two days, agitating regularly but not frequently (a total of about 4 times over the two days.)  Solution filtered, dark urine-colored liquid allowed to evaporate.  3.0g dark brown-colored extract scraped off of pie pan.  Fasted for five hours prior to ingestion.  Ingested with a glass of orange juice - no chewing.\r\n\r\n2. Mindset & Setting\r\n\r\nCalm and sober.  No regular medications.  Took 4.8g of ground, unprocessed Morning Glory seed material two days prior to no effect.  Energized from light but invigorating work earlier in the day.  Dosage taken at home 30 minutes prior to seeing a film at the theater.  Was driven to and from the theater by a friend so I had no obligations other than to appear marginally sober and get in and out of the theater.  The film was a comedy, one which I had seen before but my friend had not.  I was there to be company and my friend had no problem that I was experimenting with entheogenics, if he was a bit good-heartedly jealous that I didn't save any for him.  The day is absolutely beautiful, completely perfect in every way, soon to draw to a close under a magnificent sunset.\r\n\r\n3. Experience report\r\n\r\nT+ 0:20 - Leaving to go see a movie in the theater.\r\nT+ 0:22 - Slight vasoconstriction in the ankle and thigh.\r\nT+ 0:31 - The line was incredibly long inside the theater so we decided that we should split up and whoever could get to the front of a line first would purchase the tickets.  I chose to go outside and try the self-serve ticket machine, which had the shortest line.  After waiting about 10 minutes in line behind a string of people who were really quite slow at operating the machine, I gave it a go and, conscientious of all the people in line behind me, made an effort to go quickly and got my tickets faster than anyone before me had, despite never having used the machine before.  No loss of motor control, no euphoria, no psychoactivity, nothing.\r\n\r\nT+ ~2:00 - After an hour of no effects, I want to get some refreshments and so purchase a tub of popcorn, Reese's Cups and a Dr. Pepper.  No nausea observed from any of the three.\r\n\r\nT+ 2:53 - No effects observed whatsoever.  Noticeable vasoconstriction in the vein below my right jaw - sensitive to the touch, very minor pain.\r\n\r\nT+ 3:39 - Still no effects.  Experiment safely assumed over.\r\n\r\n4. Synopsis\r\n\r\nGraeme scale rating: 0\r\n\r\nOver a course of almost 4 hours, no effects were noticed whatsoever.  Either my extraction process was bunk or I didn't receive a high enough dose...  Perhaps the seeds are at fault.  I may try this again with untreated, organically grown seeds from a reputable entheogenic retailer.  Until then, my isopropyl alcohol extraction process has been shown ineffective.\r\n\r\nPerhaps I should try a high dosage of morning glory seeds without any extraction.  I have an aversion to nausea, however, and this method doesn't seem very appealing to me.  I might as well huff glue instead of risking the side effects of consuming ergot alkaloids.  I should establish a baseline, no-extraction threshold for Morning Glory LSA, however, because until then I have no baseline against which to measure the effectiveness of my extraction.\r\n\r\nBut come on, 25.9g of seed material - 800 ground seeds - didn't do anything?  Very disappointing.  I'm inclined to blame my extraction process.\n\n\n\n\n\nExp Year: 2010ExpID: 85056\nGender: Male \nAge at time of experience: 18 \nPublished: Oct 18, 2015Views: 815\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}