{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t 3 g\n\t\t oral\n\t\t Mushrooms\n\t\t \n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   125 lb\n         \n\t\n\n\n\n\nMy spiritual experience came to a climax after ingesting 3 g of psilocybin mushrooms. After a period of nausea and disorientation I began to see visual distortions. This was pleasant and relatively entertaining; however the trip became increasingly more intense. I began to feel as though time had ceased to progress in a linear fashion, but rather had folded in on itself, creating a series of loops. I found that as I focused on pleasant or unpleasant thoughts and sensations their emotionality and experience would spiral into increasing intensity and that I could steer my trip by choosing where to place my awareness.\r\n\r\nEventually I lost this ability to control the experience and instead I found myself experiencing a death of myself or my ego. The present reality would fade, and I would fall into a world within my mind of fleeting symbolism and powerful emotions; then one by one my attachments to who I am, where Ive been, what my world iswould cease to be my own. I would suddenly fall back into a bizarre reality in which nothing was familiar yet this distance was not frightening. Instead this disassociation was as though I could look at the world with the fresh eyes of an infant. Nothing held its previously attached meanings or habits. The very act moving my jaw, taking a step, interacting with people and manipulating my environment was fascinating. I was imbued with heightened sensitivity to my own biological processes and the multitude of steps that make it possible to reach for a glass of water and a take a sip. I was free of my previously held habits, schemas, and prejudices. Then I would fall away and once again be born into this alien world that was not my own.\r\n\r\nI generally held the position as the responsible one among my more reckless friends, and on this occasion I had made it very clear to the group that this was going to be my first trip and that I could not act as trip sitter. Instead another friend, well call him Michael, assumed the role. He chose to remain sober and was trained as an EMT and lifeguard. This would have worked out wellexcept for his inexperience with drug culture. Another friend, who well call Josh, got heavily absorbed into his trip and tumbled off the couch on which he had been lying. He claimed that he was fine, and that he had just been trippin out, but Michael was convinced that Josh had suffered a seizure and was increasingly alarmed at the other symptoms that are generally considered normal side effects such as dilated pupils, cold clammy hands, and difficulty articulating full coherent thoughts. \r\n\r\nJosh came from a conservative Muslim family and was simply horrified at the thought that he might be found out by the trip to the ER. Michael, rather than approaching him calmly instead induced a death trip, in which he convinced Josh that he was dying and that he shouldnt put this type of guilt on his friends. Josh looked to me for help convincing Michael that he was indeed ok and that everything was normal. He asked me How do I look? Im ok right? I responded, Im really not in any state to be telling you what normal is. At the time I looked at him and he had turned purple and had started to inflate as though he were being puffed up as like a balloon. Then when I denied his request he suddenly looked as though someone had pricked him and let all the air out. His skin turned a dirty olive green and looked like a flaccid piece of rubberwhich then began to drip and run over the couch like melting wax. Much fighting ensued and eventually Josh was carried out kicking and screaming by two other men. *Note* It turned out that he was perfectly fine after being examined at the hospital.\r\n\r\nI sat there contemplating my role in what had just happened. I felt responsible for my friend's situation. By sending him to the hospital we may have ruined his life. Then again we may have saved it. For the first time in my life, I stayed completely out of it, not taking action one way or the other. I was simply in no condition to interfere and I had explicitly given up my responsibility before the whole event started. With the level of dissociation that psilocybin induced, I came to understand fully something that I had been struggling with for many years. My ego was absent, and therefore being the savior in times of crisis was no longer a part of my self-concept. I came to understand that I am not responsible for all the bad things that happen because I didnt stop them. Sometimes things are beyond my control. I cant save everyone everywhereand that fact was ok. \r\n\r\nThrough my cyclical thoughts I came to that stunning realization over and over, again until it transformed into a sort of buzzing acceptance. I felt uplifted having surrendered my irrational need for control. I felt as though I had been raised up by something beyond myself, I felt comforted as I floated on and through waves of cosmic consciousness, and being grazed ever so lightly by that which is. I felt a profound feeling of acceptance that I had never experienced before despite the bizarre sights I was witnessing. It was the Fourth of July, and there were fabulous explosions overhead. I had at this point no concept of language so the human-like figures buzzing around me appeared to be speaking alien tongues. I marveled at this situation as I lay in the middle of a small clearing. After the sky finished its dance, the traffic swarmed. I could not grasp why everyone was so agitated and hurried. The honking and yelling was roaring, yet I felt as though I was in my own globe of peace. I wished that other people could put away their preoccupations with the future and come take a rest with me and relish in the beautiful night. \r\n\r\nIn my second trip I had taken only 2 g of psilocybin and had been having a very light pleasant trip. I was not having the intense sensation of dying and being born again, nor did I experience as deep of an experience of dissociation. I had been hanging out and talking with some friends when I became absorbed in the tapestries and art that surrounded me. Luckily everyone found zoning out in the middle of a conversation normal and no one called me back. I then felt the sensation of slowly being sucked into a vortex. My vision became distorted and I faded out. When I came to, I felt as though I was inextricably a part of everything that has been, is, and ever will be. I felt my existence as though it was a thread being woven into an enormous tapestry of space-time that was infinite in all regards. I lost my sense of singularity and instead experienced a profound sense of interconnectedness. I came to understand that all separation, all beginnings and endings are nothing more than illusions created by a binary mind struggling to cope with the complexities of survival. I realized that I was no different that the many things that created the bed I was lying on. Everything time, blankets, people, rocks, stars, and lamps were all different states and patterns of the same essential substance.\r\n\r\nOn my fourth trip I was sitting on a couch with in my friends living room. In the middle of a conversation I felt my edges become warm and begin to blur. Soon I felt as though the couch's four wooden legs were legs of my own and I could feel them resting on the hard wooden floor. Then the sensation began to creep to extend to the entire floor and it was as though I could feel the furniture sitting on me and peoples feet as they walked. Although the sensation did not spread any further, I felt intensely grounded, as though my physical being was not truly separate from the rest of the world. I felt what is commonly described as being one with the Universe.\r\n\r\nI recently had my first spiritual experience within the confines of a holy place. I was attending a church service in Barasa, Haiti and during the singing of hymns I was awestruck at the levels of faith within the room. The energy was tangible and people participated with all of their hearts. This ceremony was in stark contrast to the Catholic masses I had been familiar with as a child, masses in which the solemn readings of a priest were met with the robotic recitations of the audience. Instead the room was filled with passionate proclamations about hope, and I watched as this simple building served as a sanctuary for the community to build faith in a better tomorrow. After the mass I joined the young girls dancing to homemade drums. I got lost in the fun of it all and truly drew strength from this experience.\r\n\r\nI continue to meditate on a regular basis and I experience revelations or moments of peace and interconnectedness in everyday life albeit not as intensely. Occasionally I experience them during meditation, but more often these explicit revelations are triggered by extremely small things. Sometimes it is a particularly puffy cloud on a sunny day or the sight of a vine climbing its way up a trees trunk. Other times it is when a smile is met by a stranger with a recognition and acknowledgment that is normally absent in our routine interactions. I understand that I have the ability to control my reality by being choosy about what I choose to take in and what attitude I choose to take concerning every day events. I can pay attention to what is beautiful, what is painful, and what task is at hand. When I find myself lost in a critical anxious loop in which I am making no progress, I consciously bring myself back to the present and practice being mindful of breath and thought. I have much greater control over my emotionality and experience in the world. I feel more guided and more purposeful. I must admit that the feelings of being a piece of the cosmic consciousness, being one with the universe, feeling grounded, and having the ability to draw strength from positive communities has not left me and allow me to live my life in a deeper way.\n\n\n\n\n\nExp Year: 2008ExpID: 88484\nGender: Female \nAge at time of experience: 20 \nPublished: May 4, 2015Views: 5,179\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n",
  "doses": [
    "3 g oral Mushrooms"
  ]
}