{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t 50 ug\n\t\t buccal\n\t\t Pharms - Fentanyl\n\t\t (patch)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   140 lb\n         \n\t\n\n\n\n\nFentanyl is extremely dangerous, and is severely underestimated by recreational drug users. Through this experience I can truly say I will never touch the stuff again as I almost lost my life to it one night. I hope this will serve as a warning to anyone who is thinking of using it recreationally. If you need to use a strong opiate (which I don't recommend anyway), you're better off doing Heroin, believe it or not, it is far safer.\r\n\r\nFirst a little background story:\r\n\r\nI gained access to a ton (30+) of generic Fentanyl patches (no gel) ranging from 75ug/hr/72hrs to 100ug/hr/72hrs a few months ago as well as 200+ Dilaudid (Hydromorphone)ranging from 2mg to 8mg. I started using the Dilaudid daily (mostly eating them, although I shot them a couple times and would occasionally snort one). I quickly developed a tolerance, and when I was at my peak of taking them I was taking close to 50mg a night to achieve my high. I stayed away from the Fentanyl for the most part, the Dilaudid being my drug of choice, but would occasionally cut a patch and place a piece under my tongue, achieving a very strong high (I found placing the patch on my skin achieved no euphoria, only a cold painkilling feeling). After a couple months of going on like this, I realized that I definitely had a problem, and it was affecting all aspects of my life. I decided to kick.\r\n\r\nI slowly weaned myself off the Dilaudid, working down from six 8mg pills a night to one 4mg pill a night, and then dropped them cold turkey. I experienced minor withdrawal symptoms, nothing terrible. I got rid of my remaining stash, as to not have any drug around to tempt me.\r\n\r\nA month later I found a stray Fentanyl patch in my car, and decided since hey, I'd been clean for a month, might as well give it one more try, for old times sake and to celebrate the fact that I didn't need opiates anymore (a stupid guise for the fact that I was still extremely enabled to them, and although I wasn't physically addicted anymore, I was to a strong degree still mentally addicted).\r\n\r\nThe experience:\r\n\r\nIt was Friday night, my room-mates were out on the town partying, I stayed home as I was too broke to go out, and decided to throw my own little party. It was about 11pm when I cut the 100ug patch in half, and cut that half into three smaller strips. I placed one under my tongue, and one on each side of my mouth against the inside of my cheeks. I remember the initial rush, it felt great, and then nothing, I promptly passed out with the strips still in my mouth from what I can guess was about 10 minutes after I put them in.\r\n\r\n[Erowid Note: \nBecause opiate use can lead to significant tolerance (requiring higher doses for the same effects), the dose used by a first time user is significantly smaller than that used by a regular user. It can be extremely dangerous to choose ones dose on the basis of the amount taken by someone else. Overdoses of opiates can be fatal.]\r\n\r\nI somehow came to on my couch at 9am, in a way I can only describe as a drowning victim gaining consciousness. I vaguely remember a strong hallucination (no details) shocking me awake. I was gasping for air, clutching my chest, and immediately realized that the strips were still in my mouth. I frantically ripped them out, and had a vague realization that they had been pumping Fentanyl directly into my blood stream (and in turn almost instantly my brain) for ten hours. \r\n\r\nI was gasping for air, as my throat had swollen almost completely shut, my tongue was swollen as well, adding to my difficulty breathing and I felt like a small child was sitting on my chest. I was half blind, and almost entirely deaf, except for a sharp ringing sound in my ears. I instantly had to throw up. I lept up off the couch and fell over right away. I couldn't stand, I had no motor skills. \r\n\r\nThe bathroom being too far, I managed to drag myself on my hands and knees to the front door. I flung it open and spilled out onto my front steps, projectile vomiting and gasping for air in the Sunday morning sunlight. I lay on my front steps for who knows how long, throwing up and gasping for air until I finally gathered enough energy to go inside. I crawled inside still on my hands an knees, grabbed a pot from the kitchen and crawled my way down the hall towards my room, stopping in the middle to throw up in the pot. I shut myself in my room and dragged myself onto my bed. \r\n\r\nBecause I was still so high at this point, and being aware that I had seriously damaged myself, I remember worrying that if I fell asleep again I might not get so lucky again and not wake up, or that I might throw up again, and drown in it if I was laying on my back. I spent the next three hours lying on my side facing the pot, semi-conscious, trying to keep myself awake, hallucinating  and throwing up into it every 10 minutes (after the first three times it was just straight bile). I finally got out of bed around noon, threw up again and managed to stumble into the living room to find my roommate sitting there.\r\n\r\n'I fucked myself up real bad last night'. I barely managed to whisper.\r\n\r\n'I know.' He said. 'We got home from the bar last night at 2am and you were barely breathing and blue, and when we tried to clear your airway your jaw was clamped shut, we kept an eye on you for a couple hours, but you didn't stop breathing entirely so we left you'. I had to ask him to repeat this about four times because I still could barely hear.\r\n\r\nWhy they didn't call an ambulance I don't know, although they had no idea what I had done, so I couldn't really blame them.\r\n\r\nI told him my fears of falling asleep and he offered to stay with me while I rested on the couch and that he would keep an eye on me. I spent the next 24 hours in hell, the obvious detox effects. I couldnt keep water down that whole day, I spent it on the couch passing in and out of consciousness, throwing up, my body was so sore I felt I'd been hit by a freight train. Everything hurt. I had hallucinations, horrible muscle spasms, a feeling like my lungs were filled with fluid, like someone had punched me in the gut and I was bleeding internally, hot and cold sweats, a screaming headache, unbelievably sensitive to light. \r\n\r\nIt was literally the sickest I've ever been in my life. I spent a restless night in bed waking up every half an hour to horrible, disturbing hallucinations, my bed soaked with sweat, and to throw up/dry heave intermittently. The next day I could finally keep down water, and my hearing returned 50%. I still couldn't eat food even if my stomach would permit (which it wouldn't anyway), because my tongue was still swollen, my tastebuds were ruined, and my throat was still partially closed up. \r\n\r\nI am a chain-smoker and I couldn't even have a cigarette. I tried to smoke a joint, took one hit and instantly felt poisoned, my lungs screaming in pain. I was too weak to even make a bowel movement (although I desperately had to, adding to the discomfort). I spent another horrible day pretty much sleeping on the couch, and then another restless night. \r\n\r\nOn the third day my hearing had almost entirely returned and I was able to eat a little food, but it tasted absolutely terrible and was hard to swallow. It took four days until I was finally well enough to actually leave the house, and after a full week I was pretty much back to normal, although I felt like a new-born child, my body being through such stress and shock, it had completely reset itself.\r\n\r\nI don't know why I woke up that morning after the OD, I am almost positive that I shouldn't have, and I am so thankful that I did. I assume that my opiate tolerance was what saved me. I didn't go to the hospital because I knew the danger was over, although in hindsight I probably should have. \r\n\r\nAfter the fact I read a few reports of people dying the exact same way, passing out with strips in their mouth, and not waking up. I got extremely lucky, and the only thing that I can think of, is it wasn't my time to go. I swore I would never touch Fentanyl again, and promptly threw out the other half of the patch out. \r\n\r\nThis is an EXTREMELY dangerous drug, DO NOT mess with it, it is far to dangerous for recreational use, it is too easy to misjudge the dosage (also extremely dependent on opiate tolerance), and the slightest mistake WILL kill you. You'll be lucky if you escape with your life like I did.\r\n\r\nHappy trails guys and be safe.\n\n\n\n\n\nExp Year: 2010ExpID: 88664\nGender: Male \nAge at time of experience: 21 \nPublished: Sep 18, 2014Views: 13,391\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n",
  "doses": [
    "50 ug buccal Pharms - Fentanyl (patch)"
  ]
}