{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t 30 mg\n\t\t insufflated\n\t\t Ketamine\n\t\t (powder / crystals)\n\t\t\n\t\t\n\t\t   T+ 0:10\n\t\t 26 mg\n\t\t insufflated\n\t\t Ketamine\n\t\t (powder / crystals)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   128 lb\n         \n\t\n\n\n\n\nT+0.00: ~30 mg Ketamine insufflated\r\nT+0.10: ~26 mg Ketamine insufflated (56 mg total)\r\n\r\nAge: 18\r\nWeight: 128 lbs\r\nGender: Male\r\nPrior substance use: Started doing drugs 7 months ago. Marijuana, Alcohol, Kratom, Nitrous, Shrooms, DMT, Salvia, Vicodin, Acid (likely not LSD), 4-Aco-DMT. I had smoked marijuana last night. \r\n\r\nI had weighed out 56 mg of very pure Ketamine earlier in the night. I cut it up with a razor and split it into four relatively similar piles. I was using a straw to snort it. I havent eaten for ~2.5 hours. The reason for this trip is because I have never experience K before, I wanted to feel the odd shift in gravity most people felt. I would like to start low and work up to a K-Hole (depending on how this feels, I might just jump in after that). I used a piece of straw approximately 3 inches long two snort it. My plan is to snort about half and then wait until 10 minutes pass before I snort the rest. I would be doing this with people around but I couldnt find a time and place to do it tonight so I decided to just do it alone. \r\n\r\n12.28 (T+0.00): Snorted ~15 mg of Ketamine in each nostril. It stung for a second but I cant feel it now (T+0.01). \r\n\r\nT+0.06: I would say Im feeling it just the tiniest bit, It feels like a few beers. I can taste the drip a bit, it not as bad as the regular taste. \r\n\r\nT+0.10: Its hard to describe right now. I just feel spacey. Snorted the rest and went to my bed to lie down.\r\n\r\n[Everything from here on out was written the next day] Getting to the bed was surprisingly hard, I felt unsure on my feet. I turned off the lights and propped myself up because lying flat on my back felt a bit off. Rolling over to put my glasses on the bedside table didnt feel that great. Without my glasses most anything I look at looks like some sort of blob. \r\n\r\nGetting the headphones to my head was hard and I managed to put on some Flaming Lips (Yoshimi Battles the Pink Robots). The music was significantly deeper than usual, it tickled my brain and I could pick out all the individual instruments. With my eyes closed I noticed no visuals at first but gradually felt as if I was looking at myself from far away, I was just a small mass floating in nothing. This was interesting and every once in a while I would open my eyes and move around a bit. \r\n\r\n\tA slight movement in my head produced a pronounced movement in vision. I really had no idea where my body was, I could move things and it felt as if they were flowing through some alternate universe. The left headphone felt like it was on my face even though it wasnt. Moving my arms made them feel like I was floating, sitting up just made me feel very off balanced, a bit dizzy but not nauseas. Waving a light in front of my eyes was kinda cool; it made different colors than the usual red. Reading a text message or changing the song was a bit difficult because the looking at the text made me feel a bit nauseas. I get carsick when I read so I feel like a Dramamine (Dimenhydrinate) could fix this too. \r\n \r\n\tWith my eyes open the blinking red light on my computer screen seemed to call out to me like a beacon while simultaneously moving further away. This was neat but less interesting than with my eyes closed. With my eyes closed and the music off I felt lonely, so I didnt experiment with that all too much. \r\n\r\n\tThroughout the entire experience I was focused on breathing in and out like I have been taught in yoga. I was doing this because I wanted to make sure that I didnt choke on vomit or anything like that. I would have been surprised if I had thrown up but the breathing was very relaxing. There was a bit of drip, but it was still manageable. Everything was a little bit numb, my lips, my arms, my feet. \r\n\r\n\tAfter about 30 minutes of lying on my bed I couldnt visualize myself from far away anymore. At T+0.50 I called my friend to tell him about my experience, talking was a bit hard. I had one headphone pressed to one ear and the phone to the other, with this set up and my eyes closed my mind was split into two and I felt as if I could understand both ears at the same time. The balance issues remained for a while. At T+1.10 I got up to go to the bathroom, walking was alright but it moving around felt like I had just woken up. I went back to room and sat in front of the computer to write this up but the brightness of the screen and my room was too much and I just went back to go lay down (T+1.20). After that I fell asleep a little bit later, still feeling a bit tipsy. I slept very well and woke up feeling a bit warm and fuzzy. \r\n\r\n\tOverall I would describe it as the dissociation of nitrous, with out the euphoria, plus a few drinks. Music was very interesting. Ill try again, probably K-Hole, but this wouldnt be something I would do incredibly frequently, I certainly enjoy Shrooms, DMT and 4-Aco-DMT more.\n\n\n\n\n\nExp Year: 2011ExpID: 89549\nGender: Male \nAge at time of experience: 18 \nPublished: Aug 4, 2015Views: 3,233\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n",
  "doses": [
    "T+ 0:00 30 mg insufflated Ketamine (powder / crystals)",
    "T+ 0:10 26 mg insufflated Ketamine (powder / crystals)"
  ]
}