{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t   \n\t\t  \n\t\t Pharmaceuticals\n\t\t (daily)\n\t\t\n\t\t\n\t\t   T+ 2:00\n\t\t 1 g\n\t\t oral\n\t\t Kratom\n\t\t (extract)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   363 lb\n         \n\t\n\n\n\n\no\tDescription of mindset & setting\r\n\r\nI had a whole Sunday to kill; no plans and nothing that *had* to be done. I live by myself in a one bedroom apartment in a beautiful complex, overlooking a duck pond with fountains and a waterfall.\r\n\r\nI usually drink about half of a fifth of hard liquor every day, and more on Saturdays. Ive been looking for an alternative to replace that, since thats a lot of calories and has resulted in a lot of excess weight. (not to mention myriads of other negative effects of drinking that much)\r\n\r\no\tDetails of any preparations made for the experience\r\nI Googled around about Kratom quite a bit before making my first purchase; naturally finding [website] and reading most of the Kratom content. I also wanted to make sure I started at a low dose and had nothing pressing to do, just in case it caused me anxiety (like marijuana does, which is why I cant use that).\r\n\r\no\tDosage & timing information\r\n\r\nThe helpful folks over at the BBB forum recommended I start with 1 gram, since I bought what was described by the vendor as pretty powerful stuff (full spectrum isolate extract).\r\n\r\nI had no way to measure it, but since I bought a 4 gram pouch of it, I just dumped it onto a plate and used a knife to separate it into 4 roughly equal piles. The powder was extremely fine. I spooned roughly a gram of it into a glass of lemonade and stirred it up. It was quickly obvious that this stuff does NOT mix well at all. So I had to pour it into a shaker cup, put the lid on, and shake it vigorously for about 30 seconds, before chugging it all at once. The taste wasnt good, but didnt gag me or anything. Next time I might experiment with some different mixers to see what might work better.\r\n\r\nT + 30 minutes: There is definitely a stimulant effect going on, kind of like coffee. I got up from surfing the net and ended up cleaning my kitchen and tidying up the living room. \r\n\r\nT + 1 hour: After finishing my cleaning, I sat back down at the computer and feel great! I havent had vicodin in a while, but this is almost exactly what vicodin used to feel like. I loved that stuff - makes me feel relaxed and happy, slightly euphoric. Some nice mellow tunes would definitely be welcome right now. This is definitely peaceful stuff. \r\n\r\nT + 1.5 hours: The effects are starting to subside slowly. I ended up just sitting out on my patio for a while, enjoying the view and the sunny weather, perfectly content. I dont usually do that very often, and realized that I should take time to relax and appreciate beauty more often.\r\n\r\nI had been worried that 1 gram wouldnt do anything for me, since everyone else reports using a lot more than that, but then again  I did buy some extra strong stuff, and its always better to start low and work up to one's comfort level, rather than overdoing it. 1 gram of this stuff turns out to be very effective for me. My head feels muddy, I feel a little bit slow and sleepy, and actually a little bit horny to be perfectly honest! Although thats not surprising, since I read there was some similarity to yohimbine. \r\n\r\no\tNotes on prescription or over-the-counter medications, herbs or supplements that were being taken at the time of the experience.\r\n\r\nI currently take lisinopril and hydrochlorothiazide to control high blood pressure, and sertraline (Zoloft) as an SSRI antidepressant. I had taken my daily dose of these roughly 2 hours prior to ingestion of the Kratom.\r\n\r\no\tConclusion:\r\n\r\nI dont know if this is going to work to replace alcohol, but well see. Overall, thumbs up! Stimulant effect at first like coffee, and then a couple hours of vicodin-like relaxation and bliss.\n\n\n\n\n\nExp Year: 2010ExpID: 90524\nGender: Male \nAge at time of experience: 35 \nPublished: Mar 1, 2015Views: 5,688\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n",
  "doses": [
    "T+ 0:00 Pharmaceuticals (daily)",
    "T+ 2:00 1 g oral Kratom (extract)"
  ]
}