{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t 50 mg\n\t\t oral\n\t\t Pharms - Cyclizine\n\t\t  \n\t\t\n\t\t\n\t\t   T+ 1:00\n\t\t 400 mg\n\t\t oral\n\t\t Mescaline\n\t\t (powder / crystals)\n\t\t\n\n\n\n\n [Erowid Note: \nDriving while intoxicated, tripping, or extremely sleep deprived is dangerous and irresponsible because it endangers other people. Don't do it!]  In the event of a challenging situation (approaching car simultaneous with a horseback rider on the right) the car was brought nearly to a stand-still to permit the unsolvable problem resolve. The overall effort was unpleasant, as one was forced to withdraw from the effects of the drug (adrenalin?) and there was perhaps a 15-20 minute period afterward required for the effectiveness to again take control. One prefers to observe, not participate in the surrounding world. One occasion, while descending a rather steep path, I chose to reverse my direction, and executed a turn and climb, on loose and steep dirt, with completely sober ability. It would seem that in the event of necessary action or self-defense - one could and would master nearly full coordination. During the intoxication phase, there is some speech distortion (similar to alcohol). This effect seemed to last well into the recovery stage.\n\nThere is complete recall of all experiences and thoughts, after the drug has been dissipated. The feeling of comfort, introspection, and tranquility that remains afterwards may indeed have an effect days after the treatment. There is complete recall of all experiences and thoughts, after the drug has been dissipated. The feeling of comfort, introspection, and tranquility that remains afterwards may indeed have an effect days after the treatment.\n\nMENTAL COORDINATION\n\nHere there is a considerable distortion. Philosophical problems seem to admit simple and rather obvious solutions. One does not wish to dwell for long on any one concept, however. It is possible to discuss ones thoughts with the observer, but it seems that the observer is merely tolerating your ideas, but does not follow your reasoning. It is preferable to consider them quietly. There was observed an extraordinary dissociation of mind and body. One can look out over the land-scape and travel along the line of sight. The body takes care of itself as far as moving is concerned. To swing ones eyes around the horizon makes one giddy, due to the rapid motion. The body seems incidental while the mind is borne on the line of sight, but the basic sympathy for it (detached) requires that you do not allow it to come to harm. Self-harm is a real possibility however, through inadvertent walking into hazardous areas. It also is very difficult to concentrate on outside conversations. Ones now thoughts and observations are too extreme and important - one tends instead to stare at the speaker - his colors, expressions, details.\n\nMENTAL ATTITUDE\n\nOne of the most startling effects of this drug is the extreme empathy felt for all small things - a stone, a flower, an insect. I believe that it would be impossible to harm anything during the effect, and to commit an overt harmful or painful act upon anyone or anything is beyond ones capabilities. One cannot pluck a flower - and even to walk upon a gravel path requires one to pick his footing carefully to avoid hurting or disturbing stones. One tends to feel extremely conspicuous in a large group of people, although according to the observer, ones behavior is quite proper although a little cautious or reserved. As to mental motivation one is content to observe at length, to contemplate nature in detail, and so to be somewhat recluse, withdrawn, and unsociable.\n\nGENERAL COMMENTS\n\nThe overall effect is very pleasant - the desire is strong to repeat the experience on both smaller doses (to perhaps permit one to be alone in safety) and on larger doses. Also to repeat the experience under a variety of external stimuli - with music available for contemplation - at the beach - at night. There is complete recall of all experiences and thoughts, after the drug has been dissipated. The feeling of comfort, introspection, and tranquility that remains afterwards may indeed have an effect days after the treatment. One feels that this feeling may be prolonged and further enjoyed upon repeated usages. Such a change would be most desirable in many personalities - and may bespeak a therapeutic value for the drug in cases of anxiety and tension.\n\n\n\n\n\nExp Year: 1960ExpID: 92361\nGender: Male \nAge at time of experience: 35 \nPublished: Aug 11, 2011Views: 33,527\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n",
  "doses": [
    "T+ 0:00 50 mg oral Pharms - Cyclizine",
    "T+ 1:00 400 mg oral Mescaline (powder / crystals)"
  ]
}