{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t   \n\t\t oral\n\t\t Kratom\n\t\t \n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   168 lb\n         \n\t\n\n\n\n\nI have been experimenting with Kratom on and off for about 2 months now and have come to some conclusions. To avoid using specific brand names which I guess the regional names are considered I will just refer to them by the red vein and white vein varieties, taken in powdered leaf form.\r\n\r\nSupposedly the red vein and white vein varieties produce different effects; the white purportedly is more euphoric while the red is more sedative. In my experience the effects of the two are indistinguishable. Ive tried the two separately and mixed. The desired effect seems to be more dose dependent than anything. \r\nIve also taken Kratom in both a tea form and more recently in 000 capsules which I capsuled myself. I was driven to use capsules because, unlike the red vein, the white vein Kratoms bitterness was unbearable to me.\r\n\r\nIn a 3-4 gram dose, the effects are not very noticeable, maybe mild stimulation but not much else.\r\n\r\nAt 5-7 grams, a mild short lived stimulation hits. This probably lasts around 20-40 minutes. Music sound slightly better and I became content with everything. After the stimulation wears off the sedating effect kicked in and I experienced hours of relaxation. I also experienced very restful sleep and woke up feeling great.\r\n\r\nAt 9+ grams things got interesting, and not necessarily in a good way. Excessive Kratom intake produces a type of intoxication I have not really experience before. It produces a motor impairment quite similar to alcohol. I found myself stumbling around trying to get to a restroom. For some reason it also seemed to make urination more difficult. Surprisingly I felt no nausea. \r\n\r\nInternally, the thinking process is not impaired like alcohol, but at the same time seems to be rapid and jumping from thought to thought. This quite oddly, carried over into sleep, if you can call it that. When I tried sleeping, I never really entered into what can be considered a real sleep. My eyes would be closed and I would be in a trancelike state. Anything I thought about I would dream about, but it would only last a brief moment because quickly my mind would jump to a different thought. I could also wake up at any point in time. Needless to say, the quality of sleep was poor and the next day I experienced what I would call a Kratom hangover. No nausea, but I felt sluggish and unable to think clearly. Thankfully eating some food and some caffeine helped greatly. One of the more common side effects of Kratom is constipation which I also experience after use. (It threw off my regularity, haha)\r\n\r\nIn conclusion, I dont see Kratom as a particularly addictive substance, but it is quite a potent legal substance. Its a decent way to wind down the week but can be hard to get down depending on the type.\n\n\n\n\n\nExp Year: 2011ExpID: 93994\nGender: Male \nAge at time of experience: 22 \nPublished: Aug 7, 2015Views: 2,292\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n",
  "doses": [
    "oral Kratom"
  ]
}