{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t   \n\t\t smoked\n\t\t Cannabis\n\t\t (plant material)\n\t\t\n\t\t\n\t\t   T+ 0:00\n\t\t 6.3 g\n\t\t oral\n\t\t Cacti\n\t\t (capsule)\n\t\t\n\t\t\n\t\t   T+ 0:20\n\t\t 6.3 g\n\t\t oral\n\t\t Cacti\n\t\t (capsule)\n\t\t\n\t\t\n\t\t   T+ 0:40\n\t\t 6.3 g\n\t\t oral\n\t\t Cacti\n\t\t (capsule)\n\t\t\n\t\t\n\t\t   T+ 1:45\n\t\t   \n\t\t smoked\n\t\t Cannabis\n\t\t (plant material)\n\t\t\n\t\t\n\t\t   T+ 15:00\n\t\t 2 tablets\n\t\t oral\n\t\t Valerian\n\t\t (pill / tablet)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   150 lb\n         \n\t\n\n\n\n\nOne drop in an Ocean of Light\r\n\r\nSetup:  32 years old, 150 lbs.  I take no medications or supplements.  I am pretty darned experienced with psychedelics, but this one was a real eye opener.  I've tripped on Salvia, LSD, LSA, Shrooms, 4-AcO-DMT, 2C-B, 2C-C, 2C-D, 2C-E, 2C-I, 2C-P and 2C-T-2, and I've dabbled a bit with DMT and DPT...nothing breakthrough yet, but I like to start low and work my way up.  I had the Cactus sitting around when I became involved with research chemicals, and it seemed a chore to eat so much material when there were so many other things to experience.  Well, that and I discovered that rectal administration of 2C-Xs provides me with a much cleaner, more visual, less stimulating experience, particularly 2C-E, which is weird and uncomfortable to me physically when I eat it.  Rectally, I find 2C-E to be the drug MDMA wishes it were with visuals that makes Acid seem OK by comparison.  7 mg rectal 2C-E allows me to experience deep emotional connections to persons and ideas, and there are moments when the future comes alive like a memory, like I'm having a memory of something that hasn't happened yet, all with perfectly clear-headed euphoria and no body load other than an increasingly speedy Comedown.  In my opinion, this makes MDMA seem like a two dimensional stimulant by comparison.  This is important, because the visuals and the euphoria of the Cactus are strikingly similar to rectally administered 2C-E...at least in my brain!\r\n\r\nSet:  This was not my first experience with the Cactus...I believe I took 15 grams (though I could have been 20...that was before I kept a Trip Log, which is something I highly recommend).  I am pretty sensitive to Alerts and Come Ons, and I mistook the Come On for the Plateau (having never experienced Mescaline, I didn't know what to expect...now I do).  After being dreamy for a while, I decided to kick things up with 10 mg of 2C-I and 200 mg Methalone (I find Methalone and 2C-I to be an amazing combination with lots of texture animation and other visuals), however I ended up getting incredibly spun; a very pure speed with little to no psychedelic activity and no visuals.  I'm guessing that was around the 2 to 3 hour mark.  That being said, I had no idea what to expect, other than a vague dreaminess.  I was in a good mood, and had planned to trip first thing in the morning the night before.  My first experience gave me no nausea or body load at all, so there was no fear in my mind about sickness.  I've only puked twice on psychedelics...once on Shrooms from the taste and once on Robotussin (of course).  Of all my trips, I have only had three difficult experiences:  Two panic attacks induced by being so high as to think myself dead/afraid of permanent damage (once on what must have been 400+ mics of LSD, and the other on 2C-I (weird, I know) and Honey Oil, and I will say, it was a drug interaction with the Honey Oil that did it...it was just as intense as the Acid experience (I never underestimate THC, especially on psychedelics) and one instance of a profound psychological attack (20 mg 4-AcO-DMT).  I have since learned that Valerian Root Extract is an excellent Trip Killer, and I have used it to turn off a full blown overdose (25 mg 2C-C rectal).  It is always on hand.  Other than that, I tend to trip alone, unless I know I need a sitter, or if someone else actually has the day off for once!  \r\n\r\nSetting:  A walk to the park on a drizzling winter's morn for the Come On, back to the safety of my apartment for the Peak (Thank God!).\r\n\r\nAdministration:  This is the way to do it guys!  At 8 am, on an empty stomach, I took 25 grams of dried, ground material in 33 veggie gel caps.  I took them in 3 groups of 11 caps in 20 minute intervals to allow my stomach to process the material.  Many people complain that extracts or liquid preparations taste bitter, but I find that the dried material is sweet and somewhat tasty, to tell the truth.  My guess is a lot of people puke on Cactus because they're chugging down throatfuls of bitter slime, much like the way I puked on Shrooms.  I find a good Come On really enhances my sense of smell and taste, and that can sometimes make me nauseous (like a chemical public restroom stench that wouldn't leave my mind, stomach or nose alone while coming up on 40 mg 2C-D...I didn't puke, but it was gross).  Obviously, there is little to no taste involved with the caps, and taking all those pills requires a lot of water, and I always like being well hydrated for the Come On.  From what I've learned, Cactus tends to be little more than fiber, Mescaline and a whopping dose of vitamin C, so it's actually a pretty healthy breakfast.  I'm guessing the stuff swells in your stomach, because it feels like a full meal when consumed.  I thought staggering the dose would expand the Peak, but little did I realize the course the drug would take.  The Peak came once at +4hr.  You could almost set your watch to it.  \r\n\r\nFor my own Trip Log, I've subdivided the Shulgin Scale into different categories. H=Head, B=Body, M=Mental, V=Visual, A=Auditory, S=Synaesthesia.  This is neither positive nor negative...a B+3 could be a warm Cocaine fuzziness or a shower of pins and needles...its Quantity, not Quality.  I also like to use +1/2 increments...that's just me...\r\n\r\nTimeline:\r\n0hr = 8 am\r\n15m = Alert\r\n40m = H+1/2, B+1/2\r\n1hr = H+1, B+1\r\n1hr to 2 hr 30 m = Slow build to H+2, B+2, V+1\r\n2 hr 45m = H+2, B+2, V+2\r\n3hr = H+3, B+3, V+2, S+1\r\n3hr 5m = H+3, B+3, V+2 1/2, S+2\r\n3hr 15m = H+3, B+3, V+3, S+2 1/2 \r\n3hr 20m = H+3, B+3 1/2, V+3 1/2, S+3\r\n4hr = H+3, B+4, V+3 1/2, S+4\r\n4hr 10m = H+2 1/2, B+3, M+1, V+2, S+1\r\n4hr 30m = H+2, B+2, M+3, V+1\r\n6hr = H+1, B+1, M+2\r\n7hr = H+1/2, B+1/2, M+1/2\r\n10 hr 30m  17h = B+1/2\r\n \r\nSubjective Experience:  I woke up nice and early feeling rather spunky, so I decided that at 8 am I would start eating the caps after a couple knife hits of Chronic.  I had laid them out in piles the night before so all I had to do was grab a glass of water and start swallowing.  I could feel the first caps bursting, bringing an alert pretty early on.  Taking a break in between swallow sessions gave me and my stomach a rest, and may well have alleviated any potential Mescaline nausea by creating a slow build up to full absorption.  I dig Dr. Shulgin's idea of sipping slowly to avoid shocking the system.  After about 40 minutes I was full of Cactus and water.  Took a couple pisses and a shower while the alert built to a dreamy +1 around 9 am.\r\n\r\nThe first phase of the Trip was dreamy and relaxed.  Several tense muscle groups loosened, and I think it had a good decongestant effect, which is something I get from a lot of 2C-Xs, but it was not nearly as forced and dehydrating as 2C-D or 2C-T-2.  There was the usual Phenethylamine smile, yet once again, not as forced as 2C-D or 2C-I.  In fact, it was as natural as the plant itself.  Mother Nature sure knows how to assemble molecules.  After my shower, I decided to take a walk to the park to allow things to set in.  While I was walking there was very little mental activity, more of just a heady-goodness.  The head-sensations seemed to come in very slow waves beginning with a floaty sort of head rush which would settle into a deep dreamy sensation.  The body was comfortable, relaxed and euphoric.  This was punctuated by brief moments of sobriety.  Everything was just right in the world, and I felt no need to smoke any pot...which is a little unusual for me.  \r\n\r\nAfter about 40 minutes of walking (didn't bring a watch) I arrived at the park.  I needed to piss again, not really because of the Cactus, but because of all the water.  As I was entering the park I noticed a sign which stated that the Nature Reserve at the park was a sacred Native American site...something I had never realized before, but could totally understand.  It is a beautiful place!  I found a secluded spot to piss, and when I did, I could smell the Cactus quite clearly.  That was kind of neat, in a weird way...I also like the stuff, 'cause when I burp it tastes like perfume.  Anyhoo...I found some beautiful boulders to stand beside while I gave concentrating on visuals a shot.  There was some texture animation, but just barely.  It moved slowly, and I was rather disappointed at the relatively weak level I was at at this point (H+2, B+2, V+1).  But I still felt pretty damn good, and something in the stone and the Spirit of the Shamans reminded me that a website described the Peak as coming at 4hr, and that I wouldn't want to be in public when that happened.  I decided to head home, and very little else happened until I got there.\r\n\r\nNow I was ready for a knife hit.  The highs matched perfectly, and I smoked several knifers through the course of the Peak.  At first it seemed like the Chronic was potentiating the Cactus, though in retrospect, very little of the Peak effects had anything to do with Marijuana.  This was around 10:45 am.  \r\n\r\nAll of a sudden, around 11 am, it felt as if I had suddenly Come On to five hits of blotter Acid.  Textures began animating, and this animation tended to speed up as the Peak progressed.  I was surprised that there were no iridescent glowing colors...Yeah, well, all I had to do was wait...there was still an hour to go until the Real Peak.  Soon after the animation began, the body high began to change characteristics.  While it was still euphoric, spatial perceptions became angular and would shift in unusual ways.  This angular idea would become more  synaesthetically linked to depth perception and body sensations as the Peak approached.  The body sensations were very similar to 2C-E, though these I would describe as more immobile, sturdy or straight, whereas 2C-E I would describe as fun house or accordion like, being a lot more rubbery and faster moving.  There were still punctuating moments of sobriety, but these came closer together and shorter, as if the entire Trip were a series of Ripples flowing backwards towards the Point of Contact.\r\n\r\nBy 11:05 am I could tell this was going to be a classic trip, which it turned out to be.  The visuals were driven by music (Mercury Rev is always a great choice!), and the animation kept increasing in speed and profundity.  By 11:15 the visuals had reached an Acid like intensity, but were unique in their own right.  The flow of the animation was not as fluid as LSD, but the types of motion were unlike anything I've seen before.  At that point the visuals had little in common with 2C-E, but by 11:20 a wide variety of 2C-E type miniature visuals began to occur.  For instance, I have a rug with different colors and leaf patterns on it, and the red portions in particular began to contain tiny strobing red dots which were moving much faster than the surrounding animation.  These would create different vortexes and spirals...I found much of the geometry to be circular.  Rectal 2C-E, on the other hand, I find will stretch textures into a mist from which similar miniature vortexes and spirals will form, but the strobing dots tend to be an iridescent black, if that makes any sense.  Then my eyes will usually begin a strange pattern of focusing and unfocusing in which these objects will become three dimensional streams of light emanating from the center of my visual field.  This did not happen on the Cactus. Whereas Wikipedia states that most people find 2C-E colorful (which it is, don't get me wrong) and Mescaline to be geometric, I found the opposite to be true.  Its miniatures were far more colorful, and suddenly any blank surface, particularly white, became infused with all sorts of rainbow-swapping fractal patterns, but I did not find the geometry to be particularly well defined, and not as fast and misty as 2C-E.\r\n\r\nAround this time I noticed that whenever I would write, the motion of my hand would break apart the blue letters in my ledger into vivid red and yellow in jerky sort of way.  I also got this effect every time I turned my head...any straight line would appear to have yellow and red afterimages, though this was not particularly well defined either.  To quote my log:  As I write things wiggle and jump colorfully.  Around this time the body sensation and synaesthesia began to jump in waves between +3 and +3 1/2, and I stopped writing and concentrated on enjoying the fry.  My log describes this period best:  Very colorful, very gentle, extremely interesting.\r\n\r\nAround 12 pm I Peaked.  The Ripples coalesced in reverse and the Point of Contact was realized.  This was odd in that it didn't seem so profound when it was happening.  I was checking out the visuals, which were now in full force, but it was as if I somehow missed how high I really was...it was incredibly gentle in that respect.  The peak itself was a solitary moment in time, and the level of body sensations and  synaesthesia were an incredible +4, though I didn't realize it then.  Any white surface seemed somewhere between indigo and ultraviolet and would erupt in a multitude of colorful gestures.  It wasn't until 12:10 that I realized how high I had been.  My log reads:  What a brilliant and brief moment...It quickly moves into a more reflective mood.  Perfectly clean and amazing.  A perfect 10!  It all hinges around that point frozen in time...I'm still reeling from the quality.  \r\n\r\nAfter the Peak, I quickly came back to the dreamy relaxed state of the come on, but I was still buzzing heavily from the high.  Wikipedia says Mescaline triggers dopamine as well as serotonin, and I will attest to that.  It felt like I had just smoked some crack, but WAY cleaner and more euphoric.  Coke ain't got nothing on this stuff, in my humble opinion.  In fact, the only time I ever came close to puking was AFTER everything had happened.  I was reflecting on how truly high I had just been, and it began to make me nauseous.  In fact, every time I'd think about the trip the day after, I could feel the high again.  For the next two hours or so, my mind raced, and it was consumed with thoughts about the drug.  It took me quite a while to come off it, as it were.  There are very few psychedelics I would classify as an entheogen (I would probably count Acid and Shrooms, but these pale in comparison - to me at least).  This is one of them.  In fact, I think Cactus is my new favorite.\r\n\r\nI didn't really come all the way down until 7 or 8 pm, and I was pretty stimulated for the rest of the night with a speedy body buzz.  I could still feel the stuff for the next day or two.  I took 2 Valarian somewhere between 11 pm and 12 am (I usually only take one as a sleep aid) and I still didn't get to sleep until around 1:30 am.      \r\n\r\nConclusion:  Will I take it again?  Hmmm...let me think...YES!  I imagine I could take more of the stuff, but I really feel no need to go higher with the dose than that.  I feel like I have stumbled onto my Mescaline sweet spot, and I'm not sure I'd want it to get any more intense than it did.  I think this is a great psychedelic for novices and experts alike.  To me, the synaesthesia is nearly total, the body load is non-existent, and there is zero mindfuck involved.  The euphoria is top rate, as are the visuals.  I can see why Mescaline is the standard by which all other psychedelics are judged.  It allowed me to view myself as what I really am:  A singular drop casting Ripples in an Ocean of Light.\n\n\n\n\n\nExp Year: 2011ExpID: 94276\nGender: Male \nAge at time of experience: 32 \nPublished: Dec 11, 2015Views: 146\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}