{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t 100 mg\n\t\t oral\n\t\t 4-Fluoroamphetamine\n\t\t (powder / crystals)\n\t\t\n\t\t\n\t\t   T+ 2:00\n\t\t 1 \n\t\t oral\n\t\t Alcohol\n\t\t  \n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   130 lb\n         \n\t\n\n\n\n\nI am an experienced user of various drugs, particularly stimulants such as phenethylamine derivatives, and have a background in pharmacology.\r\n\r\nI ordered 4-FA (4-Fluroamphetamine, 4-FMP) from a trusted online vendor complete with NMR & IR spectra for review. I have previously ordered other substances from this vendor and purity has been highly consistent. \r\n\r\nAt about 9PM, I ingested roughly 100mg of 4-FA. I proceeded to then get ready for my night out. As I got dressed and ate a quick meal, I began to feel the onset of the chemical. This was between the hours of 9:45 and 10:00. \r\n\r\nAt about 10:25, I noticed a distinct difference in my composure. I was not nervous, but very chatty with my roommate. I was very receptive to music, and extremely focused. This was not unlike previous experiences with amphetamines. I also began to notice a sense of rising glee. The feeling was much like the initial rush of MDMA, but much more mild.\r\n\r\nI left my apartment at 10:45 and went to a nightclub. At 11, I noticed the effects beginning to disappear. Dancing & music was still highly enjoyable, however, after ingesting 1 alcoholic beverage, I began to feel flush in the face. I decided that it was perhaps best to not consume any more alcohol.\r\n\r\nCome down was almost immediate after that. Any lingering sense of euphoria vanished but the speedy effects were still present in 'waves'. Alertness continued throughout the night. Effects other than insomnia are barely noticeable by 5:00AM.\r\n\r\nOverall, an extremely mild compound that could possibly have MDMA like qualities at high doses but it may also increase the unpleasant side effects (fast heart rate, insomnia, etc)\r\n\r\nOverall positive attributes were mild euphoria, hyper focus, and a very social disposition. Negative attributes were lack of sleep, increased heart rate, and a lingering feeling of wanting to redose that night. I think that perhaps that was the most unsettling part of this experience. The strong desire to redose makes me wonder if this drug has a high abuse potential.\n\n\n\n\n\nExp Year: 2012ExpID: 94706\nGender: Male \nAge at time of experience: 23 \nPublished: Jan 29, 2015Views: 5,928\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n",
  "doses": [
    "T+ 0:00 100 mg oral 4-Fluoroamphetamine (powder / crystals)",
    "T+ 2:00 1 oral Alcohol"
  ]
}