{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t   \n\t\t IV\n\t\t Heroin\n\t\t (daily)\n\t\t\n\t\t\n\t\t  \n\t\t   \n\t\t  \n\t\t Pharms - Buprenorphine\n\t\t (daily)\n\t\t\n\t\t\n\t\t  \n\t\t   \n\t\t  \n\t\t Naloxone\n\t\t (daily)\n\t\t\n\t\t\n\t\t  \n\t\t 10 mg\n\t\t  \n\t\t Pharms - Diazepam\n\t\t (daily)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   100 lb\n         \n\t\n\n\n\n\nBACKGROUND:\r\nI've tried most drugs, the majority of which occurred during my experimental teenager years: Alcohol, DXM, meth, cocaine, weed, mushrooms.  By 18, I had been psychologically addicted to DXM for a year and a half, followed by a harsh meth addiction for the next two years.  I had no problem walking away from either one when I had decided enough was enough.  The people I used to smoke and snort lines with what seems like decades ago, however - they're still in the same places, doing the same things... no real friends, highly toxic relationships for those who still have enough human feelings to be in one.  I don't associate with them anymore, but I hear of what's become of them.  They never stopped - meth ruined their lives.  Some of them are dead, others are in prison, most are on their way to one or the other.  I considered myself one of the 'lucky' ones.  In the sense of meth, I suppose I am.  I WAS lucky.  Until opiates served me a large... no, an entire slice of humble pie. I considered myself one of the 'lucky' ones.  In the sense of meth, I suppose I am.  I WAS lucky.  Until opiates served me a large... no, an entire slice of humble pie.  \r\n\r\nThe first time I tried opiates, I was a teenager.  Just two Vicodin, but I hated the feeling and never tried it again.  Fast forward to years later, when I was 20.  My first prescription of Vicodin.  And I found out that I didn't hate the feeling anymore, that I loved it.  Eventually, couldn't function without it.  Of course, Vicodin eventually stopped working, and I moved on to Norco.  I was taking up to 50 mg of hydrocodone per day, sometimes more, when I decided to quit cold turkey.  BAD IDEA.  In retrospect, I could have made it.  But at the time, I didn't make it past the second day before I was begging to be taken to the doctor.  Where he promptly prescribed me MORE Norco (I know that was illegal of him to do so), and his goal was to taper me off.  Obviously, that did not work.  By the time I was up to taking 60 - 120 mg a day, my doctor and I decided it was time to start Suboxone treatment.  It worked like a charm for about a year, and then the side effects started to kick in.  Still, I wanted to stay clean, so I stayed on Suboxone, which I've been on up until now.\r\n\r\nBefore I start, I should note that in retrospect, all of my major drug use (DXM, meth, prescription pills, and now heroin) have boiled down to me trying to self-medicate.  I've always considered myself one of the lucky-unlucky ones.  Lucky, because I've been through a lot of shit - like drug addiction, severe depression, a near fatal assault and concussion, etc. - that most people wouldn't have made it out of.  Obviously, someone is watching over me.  Unlucky, because I've had a large number of traumatic events - sexual abuse as a child, rape, a near fatal assault and concussion, military shit - happen to me that were ALL out of my control.  Lucky to be alive, unlucky to be alive... it's a horrible and mentally painful limbo to be in.  Although I didn't realize it at the time, my major drug use was directly attributed to trying to numb the pain to these traumatic things.  And it worked better than any therapy could have.  And so I would keep doing it, until I was through the worst of whatever trauma had held me prisoner, the drug had served its purpose, and I would walk away. \r\n\r\nI've never been able to fully walk away from opiates though.  Opiates grabbed me by the throat three years ago and they have held a tight grip since.  I don't count being on Suboxone as being clean, since it's an opiate itself, and I've also tried to quit that a few times but to no avail.  The only difference is that it doesn't get me high, so I have nothing to hide my emotions behind.  \r\n\r\nTHE BUILD-UP:\r\nI was doing good on my Suboxone treatment until my friend, we'll call him P, came into my life.  He is the first person I ever met who had done heroin, known anyone who had done heroin, etc.  I hadn't known anyone previously who had any contact with the stuff, and I had always told myself from the first time I ever started experimenting with drugs that heroin and crack were the two things I would NEVER EVER do.  I now hate all stimulants - they worsen my anxiety - but as you can tell from the title, I slipped up on the latter.  \r\n\r\nP was always smoking heroin in my presence.  I didn't look down on him for it, despite my reservations about heroin - really, who was I to judge?  I would just stay far away from the smoke.  This went on for a month or two until curiosity got the best of me, and I tried smoking heroin twice.  I used the logic that since I wasn't IVing it, it was alright.  So I took a few hits, and... it had no effect on me.  None.  It wasn't the Suboxone, since I'm on a very small dose, and P is on it as well at a much higher dose.  So I just assumed I was a freak of nature and probably the only person in the world who heroin didn't affect.  I wrote it off as a waste of time and didn't try it again.  Then P started shooting up in front of me when smoking it wasn't enough for him anymore.  I still felt strongly about using ANY sort of drug via IV, so doing it with him never crossed my mind... although I would watch him, quite fascinated, as he went through the process of cooking it and then shooting it and such.  I wasn't too impressed, since mostly he would sweat a lot and slur his words.  It seemed like being drunk, but worse, and did not look enjoyable to me.  So I continued watching him shoot up.  \r\n\r\nAnd then, recently, life threw me another curveball.  I was assaulted, brutally attacked, and left for dead with a concussion and severe external and internal injuries by someone I had once trusted with my life.  My best friend since high school.  Not a druggie, had her shit together... but she was a mean drunk, and that night, she turned it on me.  I was unconscious the whole time since I had a prior concussion, and so her first blow knocked me out.  I didn't feel a thing.  But the mental trauma that came from that, on so many different levels, is truly way too much to bear for one person.  At the same time, my grandmother was put on hospice and then died in front of me a few weeks later.  That didn't help the state I was in.  I spiraled into a horrible, horrible depression that got deeper and deeper and developed aggravated PTSD.  I began having panic attacks, flashbacks every day, uncontrollable rage and anger that I bottled inside because violence was suddenly repulsive to me, intrusive thoughts.  I was constantly wishing that I had just died what would have been a painful death, that the ambulance had never come, I was angry at the world that I had been given a fucked-up chance to leave the pain behind forever.  Instead I was revived, and the pain came back worse than it had ever been.  I wasn't suicidal, but I wanted to die.  \r\n\r\nI compensated by putting up a large wall between myself and the rest of society and staying at home.  I didn't care anymore, about anything.  I pushed my friends away, I stopped trusting everyone, I kept everything and everyone at arm's length and avoided people like the plague.  I didn't care that my friends list on Facebook was slowly dwindling down from hundreds of friends to being in the double digits.  I had nothing to live for anymore.  Dreams and goals and everything else were distant memories, fairytales that were never meant to come true.  These types of things had happened to me so many times before, but with different people and different circumstances - rape, molestation, being held at gunpoint just because I wouldn't have sex with some crazy cokehead, and now this.  They all had one thing in common: they left me helpless and at the other person's mercy, to do whatever they want to me, feeling like my life was worthless because they were doing with it what they wanted and no one seemed to really care.  It's the worst feeling in the world.  \r\n\r\nAnd now, once again, someone had come in and shattered my world into a million fractured pieces.  But this time it was worse... oh, so much worse... because I had been within an inch of my life, because the realization that my best friend had caused this hit me fast and hard.  Because my grandmother was dying too, and so my situation wasn't given a second thought by anyone in my family.  Because when I needed support the most, no one was there to give it to me.  Because I was broken, but I still had to lean on myself.  Because doing so broke me even further.  Because my grandmother died a few weeks later, and I felt guilty that I was feeling sorry for myself because the same thing had almost happened to me.  Because I missed my grandmother.  Because, because, because...\r\n\r\nI was a shell of a person.  Incapable of any emotion that didn't involve anger or depression or pure apathy.  Yes, I had survived the attack, but I was dead inside.  Still, I held on, because that's what I do: I survive what other people can't.  So many years of mental torture had made me strong and self-reliant.  So when P, the only friend I would still allow myself to see for whatever reason, would shoot up in front of me, it was the same as it had always been.  I watched, fascinated with the process, but I didn't feel compelled to try it myself despite the fact that it hadn't even been three months since the attack.  Besides, I was so against IV'ing any type of drug, especially heroin.  I'd heard enough horror stories and, although I didn't judge P for what he did, I didn't like the stigma that came along with it and refused to be a part of it.  \r\n\r\nAnd the one day, something shifted, and it came out of no where.  P had just finished a shot, and before I could stop myself the words were coming out of my mouth: 'Hey, can you set me up a rig?'  I don't know why, but my suspicions are that I just wanted to FEEL something again.  Something good.  You have to understand how against intravenous drug use I had been for my ENTIRE LIFE to know how profound it was for me to actually allow myself to try it, when I didn't even have much of an interest in heroin.  \r\n\r\nTHE EXPERIENCE:\r\nSo, P set up my shot.  I told him to give me a small one, since it was my first time.  I don't know why, but I couldn't look when he was doing mine, since I had watched him do it so many times.  I looked out the window instead, and the next thing I knew he was unwrapping the tourniquet and saying: 'Alright, you're done.'  I wasn't feeling anything, and I had always thought IV heroin hit you right away.  The words, 'I don't feel anything' had barely escaped my lips when I felt it.  And holy shit, did I feel it.  \r\n\r\nIt was TOO intense, the rush.  But at the same time, it felt GOOD.  Amazing.  Indescribable, even.  Something in the back of my brain knew this was all wrong, I had taken too much, that the look of concern on P's face and his calling a mutual friend of ours (who we will call C) and then making him talk to me - I remember C saying that I needed to get to a hospital, I sounded too fucked up and P said I looked too fucked up - was a bad sign, and a very small part of me was scared... but the devil flowing through my veins cancelled all of that fear out.  Instead, I rode it for all it was worth.  It was as if I had been weighed down by gravity and didn't even realize it until the strings had been cut.  P made me get out of the driver's seat, and it was as if I floated, rather than simply moved over, to the passenger side.  I kept nodding off, and P kept slapping me awake.  He had to go home to his girlfriend, but he didn't want to leave me the way I was.  This was all registering in my brain as very, very bad, but I still didn't care.  Because for the first time in months, I was finally HAPPY.  I was feeling something other than anger and hatred and depression.  I knew that if I died, it would be just as peaceful as if I had died during the attack.  I was floating on a cloud of pure bliss!  \r\n\r\nThe initial rush wore off after a while and was replaced by horrible nausea and the worst double vision I have EVER had in my life.  I couldn't see ANYTHING. The initial rush wore off after a while and was replaced by horrible nausea and the worst double vision I have EVER had in my life.  I couldn't see ANYTHING.  I started to become alarmingly itchy and uncomfortable.  But I was still feeling content.  It had been about an hour, so P decided I was okay and left to go home to his girlfriend while making me promise to call him tomorrow.  I found that I still couldn't see anything other than doubles, so I decided to crash out in my passenger seat.  At that point, I just wanted to sleep.  I woke up a few hours later to a lady pounding on my window and saying I was in her parking spot.  I knew I had to drive home, and that's when the contendedness wore off and I truly felt fear.  I was still seeing double a bit, though not as bad, and now I had to drive?!  My house was an hour away!  \r\n\r\nBut it was either that or have the lady call the cops, and I sure as hell did not want me to see me in the state, so drive I did.  I managed to make it home by slapping myself in the face every two seconds to refocus my vision and wake me up, keeping the window down, and blasting music to keep me more alert.  Still, I found myself swerving quite a bit.  But I made it home without any major problems, and I will NEVER drive that way again... that's for damn sure.  (Note: I DO NOT RECOMMEND DRIVING WHILE THAT HIGHLY INTOXICATED.  It's dangerous to yourself and others.)\r\n\r\nTHE AFTERMATH:\r\nI woke up the next day sweating, highly lethargic, depressed, no appetite, and feeling like shit in general.  The only benefit is that my anxiety didn't resurface, so I was able to skip my daily dose of Valium that day.  I was cursing both heroin and myself all day.  I found my phone, only to discover that I had about a million voicemails from P and C that were growing increasingly urgent, wanting to make sure I was okay.   I called them both back, crashed out again for another few hours, and woke up feeling the same way.  It was a hangover worse than any I've ever had from alcohol.  The entire reason I quit drinking is because I'm so prone to hangovers and I hate them, so I swore to never do heroin again.  Ever.  In my life.  And I couldn't believe that I had actually done it in the first place. \r\n\r\nBut a few days later, I was back in that depressed place and anxious as ever, and I could only think of one thing to solve it - so P and I went to score again.  It's been two weeks, and I've done it about a total of three times.  I know I'm playing with fire, but I feel I can keep this one under control.  It's just a nice pick-me-up now and again when I'm going through a particularly rough patch with my recent traumas.  I'm a survivor, and one thing I take pride in is my strength, so I'm confident that I can avoid addiction.  Before, with other drugs, I was caught off guard.  This time, I know exactly what I'm doing and I'm keeping my guard up.  If anything, it's given me the willpower to finally quit Suboxone, and I have reduced my dosage considerably.  Some days I don't even need to take it.  I later found out that my first dose was what could have been a lethal one for first time users.  Apparently, from the way C and P tell it, I was on the brink of overdose.  From my perspective, I had found Nirvana for an hour.\r\n\r\nSo for better or for worse, heroin has both hurt me and helped me.  I've become a statistic that I always told myself I would never be and I almost overdosed.  But I've also learned what the fuss is about, quenched my curiosity, and found a way to very effectively ease the pain when my mind becomes too unbearable to handle sober.  \r\n\r\nI do not condone self-medicating in any way.  I don't want people to read this and think it's okay.  Not everyone gets off as lucky as I did, and not everyone can handle occasional use.  I wrote this because I felt it was a story worth sharing, hoping people can learn from my mistakes - that self medication can lead to worse things at times and even potential overdose - not to encourage others to do what I did.  It's my life to do what I want with, no one else's.  With that mindset, I have to respect that everyone else has the same right to live their lives the way they want to, and I'm not discouraging people to do what they want either.  But in the spirit of being a decent human being, I am ADVISING people not to do what I've done to feel better.  As I said, not everyone is as lucky.  With drugs like heroin, you truly are gambling with your life.   I guess what it comes down to is this.  One question you have to ask yourself: Is it worth it?\n\n\n\n\n\nExp Year: 2012ExpID: 94957\nGender: Female \nAge at time of experience: 23 \nPublished: Dec 10, 2015Views: 1,024\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}