{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t   \n\t\t  \n\t\t Pharms - Oxycodone\n\t\t (pill / tablet)\n\t\t\n\t\t\n\t\t  \n\t\t   \n\t\t  \n\t\t Pharms - Buprenorphine\n\t\t (pill / tablet)\n\t\t\n\t\t\n\t\t  \n\t\t   \n\t\t  \n\t\t Naloxone\n\t\t (pill / tablet)\n\t\t\n\t\t\n\t\t  \n\t\t   \n\t\t  \n\t\t Heroin\n\t\t (tar / resin)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   110 lb\n         \n\t\n\n\n\n\nYou could say I was 'living the dream,' but it was more of the never-ending nightmare.  I never in my life thought that I would turn into the raging oxy addict that I did.  Never thought that I would now be more than $10K in debt, car-less, friendless, and almost homeless.  These past two years have been one hell of a roller coaster that I wish I could block out from my memory for forever.\r\n\r\nIt all started when I first started dating my now ex-boyfriend 'Chad,' as well as the new semester at school.  A kid named 'Shane' had sat next to me, and in the course of chatting he told me he could get me whatever drug I ever wanted.  I got a kick out of this since at the time the only thing I had done was drink and smoke weed.  I never really had the urge to try anything else.  Too many friends were in rehab, jail, or dead for me to want to.  Later that night I saw Chad and told him this.  Chad told me to ask Shane if I could get pain killers.  Sure enough, Shane could.  \r\n\r\nThat night in Chad's basement, where we usually hung out, he crushed up the 80mg of oxycotin and snorted most of it.  This happened a few nights in a row when Chad started pressuring me to try some.  I was extremely nervous since the last time I was on any pain killers at all was when I was prescribed Vicodin and I ended up throwing up.  So I finally gave in and tried some...it was awesome.\r\n\r\nI just remember this overwhelming warm sensation taking over my body.  All my thoughts and anxiety were totally gone and I was just in this extremely calm and relaxed state of mind.  The second the last bit rushed through my nose I could feel this rush go through my blood and all throughout my body.  When I would stand up my balance was totally off- which I thought was bizarre.  \r\n\r\nAt the time 80mg oxy's were only $40 a piece.  We did them a few nights in a row- I would never do any more than 10mg at a time, if that.  That was enough to get me fucked up.  Chad always did more.  Always wanted to get retarded at night.  I never felt a come down or anything, but Chad always seemed to. His legs would get restless and for whatever reason he couldn't stand it.  \r\n\r\nFast forward a few weeks later...we were doing oxy's nightly at this point.  Chad always kept a little for the next morning, I continued to be fine.  However I did start to feel this restless leg deal after a few weeks and a lot of times of doing them. I don't exactly remember where or when it got to the point that we started to feel the body aches, stomach pains, and everything else that went along with it, but it happened pretty quickly.  My class time with Shane turned into drug runs to his dealer.  He was part of the Crips and literally could get whatever drug he wanted.  It got to the point where I had to do at least an 80 a day to feel normal, slightly messed up.  Chad was doing 2/3 a day (that I knew of).  He was also supporting our habit. He was getting checks from school from being in the National Guard.\r\n\r\nAs the months went on it became harder and harder to find 80mg oxys, and the demand for the drug increased.  Shane couldn't get nearly as much as he used to be able to, and we had to branch out and find more dealers.  The new ones we found were able to get 30mg roxys.  A vacation we took at the end of summer resulting in us bringing over $2000 worth of blues with us.  We ran out on the 3rd day there...\r\n\r\nWhen we returned back that night right from the airport we were off to one of our guys.  At this point we are both scrapping by to support the habit and realize that we need to stop.  Thanks to our one friend we were introduced to 'subs' aka suboxone.  This was a life saver.  Snorted (it's supposed to be taken under the tongue) this a few days in a row and we never felt better. \r\n\r\nWe stayed off of them for a good month or two, and after that just fell downhill, and hard.  I was done with this drug and wanted nothing to do with it. Chad on the other hand, couldn't resist and that is what started all this to begin with.  December of 2010 I turned 23.  Chad suggested we celebrate with a bang, of course.  After that I was on a good 6-10 roxys a day, and that was just to get through the day.  I was no longer ever high, but just felt normal, how you should feel everyday.  For Christmas that year Chad got a really really nice chunk of change from his grandparents.  $23k to be exact.  From January till March that lasted us.  Yes, you read that correctly....twenty three thousand dollars was spent in THREE months.  Sicking isn't it?  Chad had a much worse habit than I did.  He was doing upwards of 20 blues a day.  We made this Shane kid so much fucking money, it makes me sick to my stomach.  This kid was getting each blue for $8 a piece.  He would then sell them for $30 a piece....since we got so much at one time, he cut us a 'deal' and would charge $25 a pill.  We had another guy on back-up, but this piece of shit was so flakey and hot and cold, you couldn't rely on him.\r\n\r\nThere were many days when we would run out, and couldn't get more till that night.  The pain and agony your mind and body go through are like none other.  I would rather slit my own throat, than have to experience withdrawals like these ever again.  Your whole body is ice cold, yet is sweating like none other.  It feels like your muscles are being torn from your bones, and set on fire.  Your legs hurt, everything hurts.  Stomach churns and has stabbing pains all throughout it.  You're constantly in the bathroom either vomiting or shitting your brains out.  You want no food, no water, nothing but a gun to put yourself out of misery.  You can't sleep.  If you are lucky and are able to fall asleep, a good 10 minute nap and you'll be back up again tossing and turning.  I cannot describe how unbearable this pain is.  Anyone that has gone through it knows what I am talking about.  The worst part....after 4 hours of not doing any blues, I would start to come down. \r\n\r\nI had to carry a little 'kit' with me everywhere.  This included a little piece of paper, tiny cut piece of a straw, a card to smooth it out to a little pile/line, and my cell phone to crush it up.  I was snorting these things at home, bathroom's, work, cars, anywhere that I was at the moment when I was coming down.  Public restrooms were the worst! I would do it off the back of the toilet.  Disgusting.  If a piece fell on the floor (when crushing it) you better bet that I picked that shit up and it went right up my nose.\r\n\r\nJune of 2011 things are out of control at this point.  Chad ends up getting a job in Las Vegas as a corrections officer (yes you read that correctly).  We moved out.  I did not want to go.  I wanted my old life back.  My life that wasn't constantly a lie, constantly relying on these little blue devil pills to make me feel normal.  I was also going through a terrible time at home.  My family suspected I was doing this little drug and my relationship with my mom and brothers crumbled.  I no longer had friends, my friends were drug dealers and my boyfriend.  I stole, lied, pawned, whatever I could to get money.  I no longer was paying any of my bills because I couldn't afford it.  Debt collectors called daily.  I also had managed to rack up about $2000 in bank debt.\r\n\r\nChad and I figured out how to scam the bank atm machines. The bank account that I had at the time would cover any bounced checks up to $1500.  Chad always said he would 'pay me back.'  So between my family hating me, debt collectors loving to call me, and me hating my life, Las Vegas seemed like an okay idea.  Blues did not exist out there.  On the strip you can find drug dealers like you can find casinos.  They are everywhere.  We lasted on subs for a little while until we could find more shit.  That shit happened to be heroin.\r\n\r\nThe next 5  months consisted of us getting dope.  Daily.  This stuff made me vomit pretty much everyday.  I never shot it, always smoked it. It comes in this black sticky tar looking crap.  It is so gross.  I always said I would NEVER ever try heroin, and here I am...hooked on it.  My relationship with Chad was no longer a relationship, and to this day I feel like it never was one.  We were always fucked up.  If we fought it was because of drugs or coming down from drugs.  He would threaten to leave me, hit me, he would say the most hurtful things, and it was all because of these blues/dope.  When he got more shit and was happy and not hurting anymore, he was wonderful.  This is when I knew that I needed to go home, and fix everything I had fucked up.\r\n\r\nNovember 2011 I came home to New Jersey.  I came home and was just so upset and still so hooked I ended up being back on blues for a good month.  My cousin sells them, so they were easy enough to get.  I then found subs, and quit.  For good.  \r\n\r\nAs of January 1st, 2012 I have been clean.  I know at the time of this story it isn't for very long, but I will never look back.  I've racked up $2k in bank debt, $7k in credit card debt.  I ended up selling my car FOR CHAD when we were still in Vegas so that we could support our habit.  Thats $6k I owe my grandparents.  I could go on about the people that are trying to sue me, or how I am no longer allowed to have a bank account in my name for 10 years because of all the scamming I've done.  How when I recently had my wisdom teeth out I asked for no pain meds at all, for the ongoing living fear that I would get sick.\r\n\r\nWhen I finally came down from the roxys this is exactly how I did it, and I did not get sick from subs.  I took as much suboxone as I needed day one (half a piece). After that you wait as long as you possibly can before taking anymore.  Take a little less each day/time that you take the subs, until you are down to the tiniest piece you can make.  Do NOT take subs any longer than 7 days.  After 7 days you are then addicted to suboxone and will withdrawal from that.  I suffer from insomnia to begin with (blues were actually the only thing that let me sleep) and for 3 weeks after taking the last bit of sub that I did, I did not sleep once.  I wasn't even tired.  I was up all day, all night, every damn day for 3 weeks.  I fell off the face of the earth from all my (drug) friends.  Haven't hung out with them since.  \r\n\r\nChad and I are done.  He owes me the 6 grand for my car, and is currently back in NJ and back to snorting blues and opanas.  From time to time it breaks my heart, because not only did I sink so much time, effort, money and my everything into Chad, he was also my best friend.  I do not regret anything, for at the time I wanted to do this, and enjoyed doing it. But this is definitely part of my life I haven't told a soul about.  If people ask me if I have ever done pain killers, I usually respond with, 'yeah I have tried them.'  \r\n\r\nIf anyone has any questions or wants to know more, or just needs someone to talk to, please email me.  I was able to turn my life around and get away from this drug.  It is possible.\r\n\r\n[Reported Dose: '3-4 oxy 80mg; 6-10 roxi; 8 bags heroin']\n\n\n\n\n\nExp Year: 20102012ExpID: 94972\nGender: Female \nAge at time of experience: 22 \nPublished: Nov 11, 2015Views: 1,129\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}