{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t 900 mg\n\t\t oral\n\t\t Pharms - Gabapentin\n\t\t (capsule)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   190 lb\n         \n\t\n\n\n\n\nThis is a retrospective on a substance which I've enjoyed frequently over the last three years of my life.\r\n\r\nGabapentin is an odd new drug that is becoming oddly ubiquitous. Two of my family members have gaba scrips for nerve problems. They use it sparingly, and offer me their leftovers, so I use it sparingly as well.\r\n\r\nBut what does it do? This is actually a hard question to answer, which makes the substance seem untrustworthy to some. It can be prescribed for pain, for motor issues like shaky hands, and for psychological issues like anxiety and depression (though I believe this is still uncommon). \r\n\r\nI use it for courage. When I have something to do that I am dreading, I take gabapentin and I just let it happen. I am more in the moment but in a more objective way. I can take fear and frustration and let them roll off me without sticking. It is, for me, an extremely effective tool for treating social anxiety.\r\n\r\nMy typical dose is 600mg - two 300mg capsules. Sometimes I'll take one, and it's still pretty effective. The most I'll take is four or five pills in a day (1200-1500mg), but this is rare. Typically 600-900mg is the perfect dose for me.\r\n\r\nAt these doses, I experience a wide range of effects. The substance reduces anxiety by changing my mindset in a way that's kind of psychedelic. Each moment feels more colorful but also more honest, like I am watching truth play out and understanding the orchestration behind it on a deeper level.\r\n\r\nIt is similar in ways to the effect of marijuana - both drugs give a mild psychedelic sheen to the world, which arouses your curiosity and makes you more interested and involved in whatever you do. And they synergize very well!\r\n\r\nSome have complained about a mind-numbing sensation occurring with frequent and/or heavy use. I do experience a slight mental fog if I take gabapentin several days in a row, and for this reason I try not to take it daily. I restrict my use to maybe 2 or 3 days a week, when I know I'll need it most, and I typically don't feel any zombification while coming down. In fact, I do think gabapentin helps me think, speak, and write more fluently. The one thing it sometimes impairs is my coordination. Take caution if you go for high doses - some people get extremely dizzy on this stuff. I find it improves my coordination early in the high and impairs it somewhat on the comedown, but this has never been a big problem for me.\r\n\r\nSo what is gabapentin? If I had to classify it I would call it a mildly psychedelic relaxant, but hidden somewhere in there is a socially-oriented stimulant quality that's hard to describe but very enjoyable. Singing on gabapentin is fantastic. So is talking. Conversation feels very natural on this drug. I actually take it before work frequently. It makes communication go so smoothly for me, and it never clouds my mind enough to make me say anything I would regret.\r\n\r\nI would recommend this substance with caution - it's strange and unpredictable, and it certainly isn't for everybody. But I think for some people it can create a nice overall feeling of well-being, which includes reduction of anxiety and pain and an enhancement of social drive and creative energy. I wouldn't take it every day, but when used at the right times it can be of great help.\r\n\r\nPS - I have a mild case of Tourette's Syndrome, and this substance effectively reduces tics and makes me feel a whole lot less crazy. To anyone with Tourette's or a similar neurological issue I recommend you give it a try!\n\n\n\n\n\nExp Year: 2012ExpID: 97067\nGender: Male \nAge at time of experience: 25 \nPublished: Sep 17, 2014Views: 21,081\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n",
  "doses": [
    "900 mg oral Pharms - Gabapentin (capsule)"
  ]
}