{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE: T+ 0:00\n\t\t 166 mg\n\t\t oral\n\t\t Methylone\n\t\t (powder / crystals)\n\t\t\n\t\t\n\t\t   T+ 0:00\n\t\t 2 g\n\t\t oral\n\t\t Mushrooms\n\t\t (dried)\n\t\t\n\t\t\n\t\t   T+ 0:00\n\t\t 1 hit\n\t\t oral\n\t\t LSD\n\t\t (blotter / tab)\n\t\t\n\t\t\n\t\t   T+ 0:00\n\t\t 150 mg\n\t\t oral\n\t\t Dimenhydrinate\n\t\t (pill / tablet)\n\t\t\n\t\t\n\t\t   T+ 0:00\n\t\t 1 cig.\n\t\t smoked\n\t\t Cannabis\n\t\t (plant material)\n\t\t\n\t\t\n\t\t   T+ 8:00\n\t\t 1 cig.\n\t\t smoked\n\t\t Cannabis\n\t\t (plant material)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   110 lb\n         \n\t\n\n\n\n\nThe first time I took a combination of psychedelic drugs and ecstasy was at a music festival, for which I wont include the name, but by the bands I include you can figure it out. The experience was by far the best I have had on any drug. The substances I have taken in the past include cannabis, acid, mushrooms, Valium, Adderall, Ritalin, one experience with a possible MDMA, muscle relaxers, and one painkiller that I dont remember the name of. \r\nThe day I arrived at the festival, most of my friends had been there for two more days, so I got up really early and had a good friend meet me at the gate, Ill call him Eric. We walked down to his campsite and set my tent up in the closest spot we could find. We worried that I would get lost walking back, but it turned out I would not come back till the next morning.\r\n\r\nWe got out the substances that I brought, all I could find beforehand: four hits of acid, and three kinds of cannabis about a quarter ounce total. Erics friends at the festival were not drug users, but were trying some new things. With this in mind, we rolled a blunt and put it in my pocket. We left to explore the festival with his friends. Its about 10:00 am.\r\n\r\nI tried to convince Erics friends to smoke the blunt, but they said it was too early. I got frustrated and ran off with a different group. I agreed to meet Eric at 7pm to plan our night.\r\nI was now with Rick, his girlfriend Sarah, and Dan who we barely knew. Rick had taken four drops of weak acid, and Dan had taken shrooms. We went to my tent to smoke the blunt. On the way, Dan confessed that he was on probation and was being tested for cannabis, and did not want smoke. Rick said he just wanted one hit (he didnt want to get too fuck up). That just left me and Sarah who took a few hits and stopped. I smoked that blunt basically by myself. This was not part of the experience I am writhing, but I figure it was worth mentioning because it happened earlier the same day.\r\n\r\nJust so I can skip forward a little; I met two girls, the Goat (nickname she gave herself) and Lily. I told them I had more cannabis than I wanted, so they invited me to smoke all night in their tent. We met some people and I picked up a quarter of shrooms (I did not ask what species), and a gram of Mollie. I left them and listened to music by myself.\r\nI met with Eric at 7 and we decided to meet again at ten. Shortly thereafter, I ran into friend of mine, Lucy, she was driving home that night so she didnt want to take anything, but she came back to my tent to wait for Eric with me. Unaware that she had a boyfriend, I made a move on her and got turned down, somehow we were able to defuse the awkward moment.\r\n\r\n(t+00:00) Eric showed up with a friend of his, Karen, who wanted to smoke cannabis, no problem. Eric worried about not being able to find his friends after gets high, and was frustrated with me for not having a plan. I ignored him and gave him one hit of acid and divided a 0.5 gram bag of Mollie into thirds (about 166mg each). I offered Karen whatever she wanted. All she wanted was cannabis (hey you have to ask!). Eric and I each licked 166mg of the Mollie off a razor blade and I put the rest back in the bag. I then took about 2 grams of shrooms, a hit of acid and 150mg of Dimenhydrinate (Dramamine) to reduce nausea. I worried about how much I took, would my night turn out to be a disaster? Would I get lost? Would I have seizure or a meltdown?\r\nI put these thoughts out of my head. I took my friends out of the tent (I did not want it to smell too much like cannabis) and filled a bowl half way up for Karen. We ran into Rick and Sarah, who of course, wanted to smoke too. I told myself fuck I didnt put enough in, but I didnt want to spend the time to refill it, because I wanted to see Spearhead with Lucy.\r\nI tried to find a spot where Karen would be comfortable to smoke, but she was new to smoking and scared. I convinced her to smoke in an open place. She took two hits and handed it to Rick. Rick took one hit and burned up the rest of the cannabis. I asked him what happened and he said, I take monster hits, I burned it all up! I told him that thats not how you smoke cannabis if you are in a group with a small bowlful. He showed no guilt. Out of time, I handed my piece off to Sarah who had bought some nice heads earlier.\r\n\r\n(t+00:30) Thinking that Eric stayed with Karen, Rick and Sarah, I left with Lucy to see Spearhead, aware that the effects would hit me soon. We ran into the Goat and Lily, the Goat got really close and touched my arm while talking to me, she was cute, but she was 15, too young for me. We agreed to meet up after spearhead to see Matisayahu. But I told them I probably would not remember.\r\n\r\n(t+00:50) The first drug to kick in was the shrooms. It was early in the Spearhead when I began to lose focus; the music I heard was forgotten. I started the battle. Shroom thoughts filled my head: Im nervous I might be scared I have never been so terrified my thoughts accelerated out of control. Tie-dye tee shirts flowed, the tree branches behind the stage formed patterns and spun, and I closed my eyes and entered a moving painting.\r\nThe Dramamine did not appear to help. I was very nauseous and felt as if I would throw up. I kept feeling the moment come, but it never did, thank god, because I was in a crowd.\r\n\r\nI looked to see that Lucy was there, I was so happy that I did not scare her off by making that move on her. She was a good friend. She asked me what I saw. I told her that it was hard to describe what I saw, but then, for no reason, I started to explain what I thought the effects of MDMA were (I only tried it once before and it could have been a different chemical).  I felt those effects, losing control and hugging her. The people around me were beautiful and loving. Then they were staring and Lucys face changed. I rolled between MDMAs love for the world, and shrooms paranoia. Weirdly, through all of this I had a very clearheaded sensation.\r\n\r\n(t+01:20) I got into the music and danced. Michael Franti (Spearheads front man) asked who was married. He dedicated a song to marriage. A stranger came up to Lucy and put his arm around her and asked if she was married. I worried a little, because she complained earlier people were grabbing her butt, I thought about pushing him off. Then he put an arm around me. I decide it was fine; I grabbed him too. I felt love, his arms were strong. But I got bored of him, I wanted to dance. I let go of him and he let go of both of us, and I waved good bye. Then spearhead played the most beautiful song I ever heard (later I learn that its called A Long Ride Home). One verse made so happy. My body surged with euphoria. This was that verse:\r\nWe drove through Mississippi\r\nPassed a bus of hippies\r\nDrinking 40s and rolling up some sticky Icky\r\nUnder the stars\r\nOr maybe even mars\r\nMuscle cars all smoking up the boulevard\r\nYou look pretty \r\nOut of the city\r\nYou say that you love me and that theres no place that you wanted to go oh oh oh alone\r\nI felt a close connection to the verse. The battle was over. I felt loved.\r\n\r\n(t+02:00) When Spearhead was over, Lucy decided to mess with me by tugging my arm and telling me to run. I didnt panic but didnt resist because I didnt have enough brain power understand what was going on. She took me to her parents. I was terrified that they might know I was tripping, and that she could get in trouble. Out of control shroom thoughts return. I am fine they might be suspicious they know, they know!  But they didnt.  They wanted to go home and she had to drive them because they were pretty drunk. We worked out how we would meet the next day when she came back (I laughed at this I was sure I wouldnt remember).\r\n\r\n(t+02:10) I was alone. I felt the acid kick in. The world had shifted. Things were strange. I heard Matisayahu, and I had to see him. I remember that time like a dream, but it did not feel like a dream. The whole world was spinning. I quickly walked a crossed the festival site and got into the middle of crowd.\r\n\r\n(t+02:30) He played his song, sunshine when he reached the line its raining in your mind, so push those clouds a-si-ide the perfection of the way he sang that line made me feel really good. I begin to dance like I never had, I was not self-conscious, and nothing held me back. I was alive. He soon ended his set. We got him to play an encore. He played One Day again, and did an amazing improvised song. He pulled people on stage, but I was too afraid to push through the crowd to get up on stage. I regret that now.\r\n\r\n(t+03:00) I began to voyage into the world. I again entered the strange vortex and began spinning.  I saw a lady riding a lion statue. The lions jaw appears to move. I got the urge to tell her what I saw, because she must be interested. I tugged on my coat. The lion speaks! is all I could manage. I was slightly embarrassed, I was that guy. I kept walking. I ran into a friend from school who was very excited.  I gave him a hug and he told me that he was pulled on stage by Matisayahu, Natural fucking high, I have never felt so good! \r\nI wonder away and find music in the dance tent: an R & B group called Trouble Funk. I must dance; this was the greatest thing I had ever felt. The music was perfect for dancing. It was so good I reached points where I lost control. My mind went blank, with empty eyes I turned into the dance. Unfortunately, the band eventually stops playing.  I felt let down: because I did not want this night to end. I left the tent (I must voyage on!). Someone gave me a high five as I walked out, and I hit it once, twice, three times.  Im acting a little fucked up I told myself.\r\n\r\n(t+03:30) After I walked out of the tent, I ran into a friend who I frequently saw at concerts and was a musician in my town. He laughed at me and pointed out to his girlfriend how happy I looked. She laughed too and said, I like you, I mean look how happy you are! then I realized that I was really happy and it made me happier that my happiness was cute to them. I smiled widely and looked at the ground, too much praise. I said little and told them I must voyage onward.\r\nI looked for more music and dancing. I heard music, but I couldnt find it. I traveled through campsites and reach a dense wall of shrubs and a big hill. Not something I wanted to climb into in my state.  I wondered further into my spiritual state. I am looking for something magical I reminded myself, and eventually I find the music. Its a band called Orgone.\r\n\r\n(t+04:00) Again I started to dance. How I loved this new thing; I never wanted to stop dancing. I saw what I thought were angry couples pulling each other out of the crowd. I figured out that they were strangers looking for privacy. I saw a girl in a beautiful dress. She held one side of it and was dancing. She had a soft shoulder, I wanted her to pull me out of the crowd, but I never got the confidence to dance with her. The singer talked about touching and how she liked to be touched. I wanted to be touched; I figured that it must be happening up front. I wanted to get up front bad, but I didnt want to push people out of my way.  Eventually, I made it up front, but it was toward the end of the set.\r\nOne more song we yelled. They played another long jam. One more song we yelled again, I started the chant this time. I never wanted this to end.  They refused to play another song. They came up onstage and said strange things. Look at all you beautiful people, enjoy yourselves, and remember to clean up after your fine assed selves. I felt beautiful. They came on stage again and said that the line between tomorrow morning and last night had been crossed. I didnt want this to end. I refused. I talked to a few people who didnt want to sleep either. I never said much, I didnt feel like I had to say much. I was free from explaining or needing to talk.\r\n\r\n(t+05:30) They made a campfire nearby and started a drum circle with a guitar and a trumpet. A stranger named Tony was in charge. I danced around the campfire, not worrying about overheating.  I danced in circles around and around with other people. This was all I needed, the music and the dance. I talked to people while dancing; I didnt care much for conversation. The girl in the dress from Orgone was dancing there too. I wanted to dance with her and I did a little, but never got too personal.\r\n\r\n(t+05:30-10:30)(Order of events becomes hard to remember)\r\nThe whole night people were siting closer and closer to the fire, tony would tell them to move back but they wouldnt. I had less and less room to dance and got closer and closer to the fire. I was hot, but I never took off my coat or paid much attention.  I danced by one guy and touch him slightly, Holy shit man youre burning up! Its like the hands of Satan! I dont pay much attention, but now I realize that I could have died that night by spending it dancing without taking off my coat or taking breaks.\r\nTwo friends who graduated from my school a year before I did were siting by the campfire. They seemed to have taken something. I talked to them and one of them had a pacifier in her mouth, I thought this was stupid and stereotypical, but I realized that it was ridiculous for me to be dancing the way I was and that everything was cool. \r\nI saw the Goat and Lily around the fire. They had apparently found some really good Mollie and had crashed.  They slumped over as they sat and struggled to stay awake.  I tried to get them up to dance with me, but I realized I had to let them do their own thing.\r\nAn old lady, who was dancing around the fire, passed me by and told me she wanted to put up my hair. I kept dancing. Later she came up to me and asked if I had a hair tie, I kept dancing. She looked for one and eventually gave up until she realized I had rubber bands on my arm, look at you silly, you have them right here.  She sat me down away from the fire. I finally cooled down a little and realize how hot I was and I took off my big warm Mexican coat. She started to braid my hair, and she asked me where I was from, I told her and she told me that she was from the same town. I wanted to talk to her more openly, but I couldnt. She told me about her friend who went to prison for heroin, how she had no clue her friend was doing heroin, and how I should never do heroin.\r\nHer friends lit up a bowl. She asked me how old I was, I told her 19. She said that I was old enough and then said, oh god youre so young and could not hand the bowl to me, so she handed it to her friend to hand to me. I took a hit. Eventually, she was done with my hair and I could dances again. My shirt is soaked with sweat, but I didnt care.\r\n\r\n(t+09:30) I began to get tired. I decided to go back to my tent. I waved bye to everyone and danced slowly away to my tent. I tried to sleep. I remember my sleeping bag being very soft. I gave up on sleeping and got up to walk around. However, it was too cold out. I hid in my tent and still couldnt sleep. I got out and got back in two more times. The experience was never clearly over.\r\nEventually I am warm enough to walk around the festival again. I run into Eric and ask him how his trip was. He had thought we were following him when he left to look for his other friends, we did not. He ended up alone and scared.  Although he found his friends and his trip was salvaged he had had a bad time.\r\nI feel like the ecstasy that I took that night made me feel more like I was in my place versus trying to figure out how to fit into a party.  I liked this along with energy it gave me. The acid and the shrooms made me feel very spiritual. After the experience I had a long after glow and I feel like I had a deep insight into life that day. This was a very good combination for me.\r\n\r\nIts worth mentioning that I do not think what I got that night was MDMA. After looking at ecstasydata.org, I think I took methylone (bk-MDMA), which is similar to MDMA, but among other differences it requires higher doses.\r\n\r\n[Erowid Note: \nWhile it may be that the substance described is pure MDMA, Ecstasy/Molly tablets and powders are notoriously impure, misrepresented, or adulterated. Ecstasy sold in retail contexts such as festivals or parties often contain chemicals other than MDMA.]\n\n\n\n\n\nExp Year: 2012ExpID: 97586\nGender: Male \nAge at time of experience: 19 \nPublished: Jan 1, 2015Views: 3,998\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n",
  "doses": [
    "T+ 0:00 166 mg oral Methylone (powder / crystals)",
    "T+ 0:00 2 g oral Mushrooms (dried)",
    "T+ 0:00 1 hit oral LSD (blotter / tab)",
    "T+ 0:00 150 mg oral Dimenhydrinate (pill / tablet)",
    "T+ 0:00 1 cig. smoked Cannabis (plant material)",
    "T+ 8:00 1 cig. smoked Cannabis (plant material)"
  ]
}