{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t   \n\t\t smoked\n\t\t DMT\n\t\t \n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   160 lb\n         \n\t\n\n\n\n\nSet:\r\nI  decided on a whim to consume a dose that had been prepared for my friend's girlfriend that, after speaking with my friend, she declined due to feeling unprepared for such an experience.  I had highly recommended that she not embark if she had any doubts as it could be unpleasant and I  felt morally obligated to protect her from such a decision.  I knew extracting the spice from the vessel would be difficult and exposure to air/light would cause it to degrade. And of course, I did not want any amount of the holy spice to go to waste.  I was feeling relaxed, did not have any negative feelings or thoughts in mind, and had experienced an approximately ~30mg dose earlier in the day that was quite pleasant.  I had eaten a bowl of Cheerios mixed with Honey Bunches of Oats approximately an hour earlier.\r\n\r\nSetting:\r\nMy living room at home with no light source other than my alarm clock.  I have always felt quite comfortable there and actually sleep on the couch on a regular basis.  As my friend was sitting on the couch 'recovering' from his first experience, I took a seat on the lazy boy.\r\n\r\nPreparation:\r\nAside from my experience earlier in the day, none.  I knew what I was getting in to (at least I thought I did) and as mentioned previously, the decision to embark was quite whimsical.\r\n\r\nOther substances:\r\n4mg Subutex (buprenorphine) taken sublingually approximately 15 hours previous - I take buprenorphine to help address the physiological portion of ongoing opiate dependence treatment.\r\n2mg Xanax (alprazolam)  1 mg taken with my buprenorphine, 1 mg taken 3 hours previous.  I take 1 mg every 12 hours as directed.   I was in a dose reduction stage of my opiate dependence treatment and the alprazolam helps with the associated anxiety that comes with opiate withdrawal/reduction.\r\nTHC - Residual amounts of THC due to semi-regular consumption of cannabis but I had not consumed any cannabis that day.\r\n\r\nApproximate time of dosage: 11:45PM\r\nI took what felt like a larger-than-normal hit from my hammerhead glass pipe Lightweaver (named after the Alex Grey painting which it closely resembles) and held it in as long as possible.  I exhaled and politely asked my friends to leave the room so I could trip in silence.  Those words had barely escaped my mouth when...\r\n\r\nT+0:01 : I was enveloped in an overwhelming sea of colorful geometry which resolved into a pathway leading to a very mechanical/alien-looking Mayan-themed pyramid.  I walked down the pathway and leaped up the stairway, leaping the steps in groups of 3 just as I would in real life, passing others on my way up.  I felt an overwhelming sense of pride when I reached the top of the stairway and was greeted by a doorway which led into a void.  \r\n\r\nI fearlessly stepped through the doorway and was greeted by a large 'being' which took the form of an N-dimensional (where N is greater than 3) unicursal hexagram.  (NOTE: I had seen this shape before and had to do a lot of Googling afterwards to find what it was called) Its 'skeleton' appeared to be made of light and an 'eye' at every vertex/intersection.  Every 'eye' was a copy of the being, repeating itself infinitely.  The being seemed somewhat annoyed by my demanding answers to the questions of why it was here, why I was here, and why the universe was here.  I recall a feeling of embarrassment/humility as I realized I was not prepared for the answer. The being responded 'You cannot learn the 29th lesson without learning the first 28' and pushed me backwards down the steps.  I began tumbling backwards and the pyramid took on a very sinister and dark quality.  I felt a sharp, very momentary pain in the center of my brain as this was happening.\r\n\r\nAt this point, I found myself in a 'cosmic emergency room' after tumbling backwards down the steps.  I use quotes because that's the best term I can use to describe it.  I was surrounded by 'nurses' of distinctly elfin appearance.  Humanoid, short, thin, with beautiful blue piercing eyes.  The younger nurses comforted me, 'said' this was a frequent occurrence and it was OK, while the 'head nurse' chided me for my arrogance.  Again, 'said' is completely proverbial - no words were ever exchanged.  It was as though these ideas were being communicated to me telepathically.  There were others in this cosmic ER that were in far worse condition than I and I recall the nurses who were attending to them making comments about how sad they were for the people the patients had left behind.  I am known to be a very empathetic person among my friends and co-workers and with the exception of the head nurse, there was an overwhelming feeling of empathy and cooperation in this place.\r\n\r\nT+??? -  After repairing/tending to my brain wound, the nurses signaled for a cosmic taxi mechanism.  It took quite some time for this mechanism to reach me and for my journey home to begin.  During that time, I conversed with the nurses about my experience and they said they had always wondered what was in the pyramid, but had always been too afraid to investigate due to the trauma they saw on a regular basis.\r\n\r\nWhen the red recliner machine arrived, the nurses bid me farewell and were quite kind... they appeared to gather in a crowd and multiply in number, all waving goodbye and wishing me well.\r\nT+0:15? - At this point, I was still experiencing rather strong effects.  I asked my friends what time it was as I could not see the clock that was 7 feet away from my face.\r\nT+0:20 - The effect was still rather strong, but it was more like an LSD or mushroom trip where I was conscious of my surroundings and they were merely altered.  I was fully conscious and could see the clock: 12:05am.  My friends had come back into the room and asked questions about my experience.  I was grateful that _I_ had taken the dose instead of my friend's girlfriend as I do not think she would have handled it well as a first-timer.  I believe I had consumed the dose I had prepared for her + a considerable amount of what my friend had left behind.  I did not have a proper scale to measure out the amounts and had 'measured' based on what a friend with a scale had shown me, so my 75mg dose estimate is purely hypothetical.  I have since obtained an accurate scale as to not make the same mistake.\r\n\r\nHaving read several other trip reports, my experience seems to have been very concrete and not as abstract as others'.  I remember the entire experience from beginning to end, as though it was a vivid dream.  The strange pain in the middle of my brain, where I have no nerves, was somewhat disconcerting and further research reveals this is in fact where my pineal gland is located.  I have always been skeptical of the connection between the pineal gland and DMT as there appears to be little peer-reviewed research linking the two.\r\n\r\nI have severe cognitive dissonance regarding the spice... a catch-22. On one hand, I feel everyone should experience DMT as it is incredible.  On the other hand, I feel empathy with those who created atomic weapons - it is so powerful and so potent that only the most responsible should possess it and anyone who WANTS to use it probably should not.  I had 4 experiences with the spice previously and none of them compared to this... the difference in experience was exponential.  \r\n\r\nOn the Shulgin scale, I would rate this at the +++ mark.  I was completely immersed in the experience and had my eyes open the entire time but did not regain my vision until the T+20 mark described above.  This is the closest I've ever had to a mystical/other-worldly experience and truthfully, I'm not sure I want to go back.  Much preparation will be required.\r\n\r\nIf you've made it this far, thanks for reading.  When relating this experience to friends, I was told that I was 'making shit up' and that 'it's never that vivid'.  I can only relate what I experienced in terms I know and if these terms seem unusual or unrealistic to readers, I apologize for my lack of a more concise vocabulary.  I'm not sure I'd believe it myself it it had not happened to me.  As I said, my previous experiences were nothing like this - they were far more abstract and could only be described in terms of feelings and emotions.\n\n\n\n\n\nExp Year: 2012ExpID: 97591\nGender: Male \nAge at time of experience: 29 \nPublished: May 13, 2015Views: 3,919\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}