{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t   repeated\n\t\t insufflated\n\t\t Ketamine\n\t\t (powder / crystals)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   133 lb\n         \n\t\n\n\n\n\nI would like to start by saying, I have used: (this is in no order, merely in the order I thought of them) Amphetamines (of varying strengths), weed, Acid (but who can tell what's acid anyways?), ketamine, opium, mephedrone, oxycodone, codeine, diyhydracodeine, cocaine (again varying strengths), MXE, DXM, 25c-nbome, 2c's; C,B,E and P, mescaline cactus, shrooms, 4-aco-DMT, N,N-DMT, 5-meo-DMT, 5-meo-mipt, ritalin, valium, alcohol, tobacco, solvents (once, but they sucked), some antidepressants (because they were there, they didn't do anything). I probably missed something off but yeah, I am comfortable when on drugs. \r\n\r\nI would also like to point out I have found it easy to get off smoking pot before and I have never been addicted to any substance except K...   \r\n\r\nThis is my story of how an eight-month on and off ketamine usage span has lead me to an empty and lacking place This is my story of how an eight-month on and off ketamine usage span has lead me to an empty and lacking place I hope no one else gets to but people will do.\r\n\r\nNow in my area there had been much prosperity with the god candy up until mid 2011, at this point I really wasn't too much into K, I liked K holing and it was by and large my favorite drug. I was doing it rarely and while I would take a bit while I could, like a gram to myself or maybe 2 over a night, nothing major. I was always using it with people, it was some fun shit, I would K hole on my own occasionally but I wouldn't just blitz it all to myself I preferred social interaction...\r\n\r\nSo K comes back and I'm itching to get back on it, I realized I missed it but still at this point it was simply because it has no comedown, sickness, fatigue, uncomfortable bodily sensations,or at least not in my experience, I always found it to be an intellectual alcohol, letting my thoughts and words flow well while others I knew just became slurred messes, it was my 'personality' drug...\r\n\r\nAnyway, the K gets back, lovely crystals, tasty drip, has that 'fresh off the pan' style of sharp pain, gaggy taste (mmmmm) and sharp pure chemical slug trail down the throat that lets me know I am using a pure tasty drug, not some kind of sugar coated re pressed cut crap as is the way with other chems. Especially in my local area K was like a sacred thing that no one cut. \r\n\r\nI am supposed to be acquiring it, taking it to a friend, and he will give me the line I had just had + a gram. now I've had this K already so I am in nostalgic 'where have you been' heaven, of course this only occurred to me in this intro/retrospective moment... Sorry if you feel bored but I feel this best explains everything so you understand the kind of person's experience you are reading... Instead of delivering it, I just buy all of it upfront with cash, me and my fellow K warrior, we shall call him M are very excited to get on it, we go around our friend's houses sharing the rails and chatting crap for the next few evenings and all is well.\r\n\r\nNow I mentioned the 'on and off nature' of the K climate, the off section came in around May. At this point I had been using it liberally for a while and had begun doing it alone occasionally because my tolerance was dead to rights, FUCKED you might say. I was not worried though, it's to be expected due to my tolerance and wanting to make my cash worth it. I still wasn't at that legendary 5g per day stage or anything like that, nailing a g over the night was still OK for me to be honest...\r\n\r\nBut I was growing fonder of the K hole, the strange noises, colors, spinning vortexes of crushing green glowey light... Ahem, anyways continuing, K then scarpered around May-ish, I was really OK with it, 'it'll be back' I said chirpily. I finished my studies and got signed on to UNI, good shit (also just to put a spoiler on it, I haunt dropped out or blitzed all my money on K or anything ha ha). Around my birthday K came back, literally 3 days before, totally out of nowhere, my cash had recovered from the last spot of K and it wasn't 25-30 pounds a G anymore it was 20, even better... 'more K' I thought ...\r\n\r\nMe and M smash 6g between us in the space of a day on my birthday and STILL manage to frolic in the woods, albeit an unsmooth collapsing frolic but a frolic nonetheless! So yeah I've got to a point of enjoying higher doses and my using it alone index and gone to around 60% of the time, at this point it's still mainly tolerance but a bit because I enjoy just giggling to myself and watching some nuts film like Zeitgeist, etc... \r\n\r\nFor the last 2 weeks of this K period I am taking K on my own, not leaving the house other than to go get a gram or 2 (sometimes twice a day). Even my dealer was getting kind of worried, he had been a fiend himself and he knew his words would go unheeded so he instead advised me to drink a load of water and eat alot before coming and getting K and between holes. It sounds basic but I would forget this sort of shit in lieu of that sweet drip and hole combo...\r\n\r\nAfter this span of reclusive uses 90% of the time I'm alone, I basically ignored everyone during this period and took K all the time, the other 10% is my dealer and his friends who are all nice guys and stuff but really I'm just there to get K off them. We have laughs and it's all good but I wouldn't be there if someone else had K at that point that was better sort of thing...\r\n\r\nI have a fair tolerance the third time K comes and this is like beginning of August for just a week (there was  a gap of 2 weeks between this time) but this K was shit. A new guy had come from somewhere with K with K in it but with some blanc medical powder and other shit. It didn't stand, but I was huffing it all up for all the K it was worth (I don't hang around with my other dealer anymore despite saying I would like to session with them etc, I was just making small talk but I haven't seen him since). It still got me where I wanted to go but it was kind of shitty, not being those godly crystals of love that they once were.\r\n\r\nNow, I have a girlfriend and have done so since last December, she appears again later...\r\n\r\nThe third time the K comes around I am rearing for it, I need it and it's a constant fucking supply! I was literally shaking with laughter and glee, I gave him 160 pounds and got 10 grams from him, 2 of which someone else had bought. I gave them their 2 and took my 8 over the course of 3 days, I was in the K space, waking up at 9 am after 5 hours sleeping, huffing a line, lazing around eating cereal and watching endless movies, TV series, documentaries, etc., not leaving and barely speaking to anyone...\r\n\r\nAbout mid August I have been taking it daily, not in gross amounts just a couple G's a day, repeated journeys to my dealers, they all think I'm some kind of K machine, I have ceased taking it with even M, one of my best friends and follower of the KEt...\r\n\r\nAgain it's actually 80% alone 20% with people due to me getting on it at my dealer's a bit longer because they would feed me K just to watch me take huge lines. They seemed under the impression that I thought I was awesome or something and one guy who came there thought I thought I was cool, I really didn't. I envied them they were taking 80mg a line and would loose all motor coordination, I was taking 300mg a line and would have literally perfect balance, coordination, and all I have really lost is my cash. I envied them they were taking 80mg a line and would loose all motor coordination, I was taking 300mg a line and would have literally perfect balance, coordination, and all I have really lost is my cash. This doesn't bother me that I was spending 40 pounds a day.\r\n\r\nI didn't miss a single day taking it and on Fridays I would go through 80 pounds worth that night/sat morning till 12 when I would go get another 1/2g... Damned.\r\n\r\nI get to the end of August and I am still hoovering it up all the time. I start uni on the 7th of September, I don't use in uni but in all my spare time I am on it. I spend a bit of my loan but not that much really. So anyways, I think about K all the time, I love the shit! On the train home 'KET' in my lectures 'KET' I barely sleep, I can't sleep after K anymore. I used to get lovely sleep, not anymore unless I do .7 in a line and horse myself to bed...\r\n\r\nI would say around the 21st of September I think 'I have a fucking problem' but as my dissociation second personality said 'You have a fucking problem' ha. I get mild urinary discomfort, no pain, no blood, it's gone now etc. I stopped doing it for like 2 weeks and let my body heal. I still think about it daily but thanks to this very website I realized that you can piss in a bag off this shit!\r\n\r\nBut after 2 weeks, I have a line, no discomfort... Wooohooo!  I blitz once again until my stomach starts going sour, ewwww, I get these weird cramps, they don't hurt but they have me a bit hunched now and then. I crank up my calcium and vitamin intake (ket logic). I havnt taken K with anyone for this period of time till about a week into October abouts. I quit, cold turkey, fuck this shit it will ruin me, I don't like it...\r\n\r\nNow it gets to the modern day, I have taken it once since then and it wasn't enjoyable, no pain but I couldn't stop thinking about the year I had spent ignoring my friends more a crystal, yuck...\r\n\r\nSo where is the emptiness? Well basically I don't ever go out at the weekends, which I did alot, I cannot go in pubs without being very scared (I haven't ever so much as had a pint since being 18). I went to the pub earlier in the year but didn't buy a pint and was on Ket at the time.\r\n\r\nI feel permanent depersonalisation, I have very severe HPPD-like symptoms of image burn and little random trips that happen every now and again, in fact even thinking about this while writing makes the Whirring K hole noise of tinnitus come back that I can't shake. I don't feel depressed at all but I just lack all motivation, I haven't seen friends in ages but I don't give a shit. I don't even want to take K particularly, I just feel empty, cold almost, kind of shallow, I don't really care that much about anything, I do my studies but only because it distracts me and allows me to just do something, I feel very little in the way aspiration for the subject.\r\n\r\nI don't like going out very much and am now for some reason scared of the dark. I get paranoid if someone isn't in my house (I live with my parents and they don't know about the extent of my drug use, they kind of condone the milder amount as innocent fun and I agree. It has always provided a decent platform of free speech and proper awareness about drugs rather than superstitious propaganda filled crap, my mum knows I research everything well and understand what I am doing. Anyways...)  I don't like it when I have to do things for other people because I feel so little connection to even my closest friends. Even tonight I was invited to two separate birthday events and a gig which could have all been done over the span of 6 hours and one of the parties is still on and only a 3-minute walk from my house... I can't go out there, I don't want to see anyone and have to fake interest in having conversations. But what is wrong with me? They are not my enemies they are some of my closest friends and my girlfriend!\r\n\r\nI barely connect with who really is or was the love of my life, I know it sounds very cheesy but we both do (or my case arguably did) have a deep rooted spiritual connection, But while K used to make me fall further into love with her while simultaneously into a hole, I began hiding it from her and saying I wasn't using. This went on from July onwards. I wasn't neglecting her just wrongfully justifying a wrong act that my shame never ends on doing...\r\n\r\nI only told her in joking connotations that I had a problem, we were probably arguing about ket or something as she had found out the lies a few times...\r\n\r\nBut now at this point I feel a bit broken, I can't feel upset, I feel happy sometimes but it's more just a slightly elevated mood. I don't even care when I am ill, I used to always be proactive and now I find myself just sitting at home watching crap on the internet. I decided to write this so that someone can hopefully learn from this. I was invincible, I mean before K, I would be the one who was healthy on the session, I would get the ok comedowns, I could take loads of strong hallucinogens in combination and feel fine. I was one of the people who talked the most and inspired conversation and made people laugh (not to toot my own horn). I wouldn't throw up and would always be headstrong and know what to do in situations of bad trips coming on in the group, etc. Now I really am a shell of who I once was in most aspects...\r\n\r\nI still exercise, go for walks and stuff (I live in a town where there is a nice array of nature spots 10 minutes walk up a hill), but really I don't care about doing them... I know at this point you are thinking 'yeah I get it the dickhead ket head fucked himself up and now he doesn't care' but I'm just trying to stress the lack of humanity I have left. I really hope it comes back and it's not been that long since taking it but still I feel kind of... Well nothing but it may not wear off...\r\n\r\nI don't blame the ketamine and all drugs should be legal, it's the morons who take them who give drugs a bad name. I could have kept to sensible usage -my other friends did- I was never pressured, no one told me to, it was never glamorized. In fact plenty of people at each stage tried to tell me I would become 'sour', as a ket addict I knew called it. I didn't listen, I made the decision, I acted, so I must face the consequences of my actions and grow up and deal with it...\r\n\r\nI wish I was depressed, I would at least feel something tangible instead of this grey area of bleak thought, I am not saying I don't have a laugh sometimes, and I do see people on occasion other than uni colleagues but I really am sour. I don't understand why people would want to speak to me so I shut myself at home so they don't have to listen to me talk about crap and they can get on with their lives.\r\n\r\nWell that's my depressing monologue over, I hope you didn't feel bad during reading that and I am sorry if I made you... I'll let myself out...\r\n\r\nThanks for reading\n\n\n\n\n\nExp Year: 2012ExpID: 98158\nGender: Male \nAge at time of experience: 18 \nPublished: Dec 5, 2015Views: 760\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n"
}