{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t   repeated\n\t\t insufflated\n\t\t Ketamine\n\t\t (powder / crystals)\n\t\t\n\t\t\n\t\t  \n\t\t 750 mg\n\t\t insufflated\n\t\t Ketamine\n\t\t (powder / crystals)\n\t\t\n\t\t\n\t\t  \n\t\t 15 mg\n\t\t oral\n\t\t 2C-B\n\t\t (capsule)\n\t\t\n\t\t\n\t\t  \n\t\t   repeated\n\t\t smoked\n\t\t Cannabis - Hash\n\t\t  \n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   50 kg\n         \n\t\n\n\n\n\nThis is an older trip report of mine; the experience happened in the spring of 2011 which is also when I wrote the report. It was written in dutch though and I figured it is probably interesting enough to translate to english for international availability. So here is the report of my experience of accidental narcosis and the following K-hole. Enjoy\r\n\r\nDisclaimer: The following report is probably not overly informative, I've written it down more for myself then to really make something interesting out of this. The order of events is probably off a bit because I only checked the time sporadically and I had absolutely no concept of time. This report is mainly about a very idiotic way of dosing and a huge fail of my judgement. At the time definitely one of the least sensible things I had ever done. Everything turned out fine, but if I wouldn't have had almost sober friends with me it could've been a lot worse and a lot less safe. I seriously recommend against dosing in this way and of course from this point on I'll take the effort of finding a key or something if I want to take a small bump of ketamine instead of doing something so thoughtless. I left out nearly every detail that isn't related to this exact experience; they were all very fun, bizarre, funny, social and euphoric moments, but they probably don't make the most interesting reading material and I mostly wrote this report to relive the experience and to get a clearer image for myself of what happened.\r\n\r\nWho I was at the time: Female, 21 years old at the time, 50 kg of weight and very experienced with ketamine although not having a large tolerance to it yet having done it anywhere in between monthly and weekly since early 2009 (and also plenty of experience with other psychedelics and dissociatives such as mainly a lot of LSD, nitrous oxide, mushrooms, and minor experience with 2c-b prior to this experience).\r\nLocation: Free tekno party close to Amsterdam in a warehouse in an industrial area.\r\n\r\nThe story starts at the dosing mistake; we had been at the location for several hours at this point and had been under the influence of ketamine for about an hour already; this happened while we went to a more quiet place to take a little more ketamine, originally with the intention to go dancing after that. We were sitting on the ground in a chill out area with a group of people all intending to take some ketamine; I first went through the trouble of crushing some racemic ketamine on to a mirror and snort it in two lines. While it kicked in I decided that I wanted a bit more of a physical 'buzz' and to achieve that I wanted to take a tiny point of S-ketamine. For some odd reason I did something incredibly stupid though and instead of putting down a little line or taking a bump off my key I took a snorting tube and put it in a baggy containing about two grams of S-ketamine. I tried to véry carefully snort a tiny bit of it but my motor skills were already affected from the previous dose. It hurt; something that usually isn't the case, and I knew right away that this was wrong; my entire nostril was stinging from the abundance of crystals in it and my entire throat was filled up with a thick layer of ketamine. I nearly chocked in it and tried my best to swallow the excessive amount of ketamine; something I couldn't even do without water.\r\n\r\nImmediately everything started zooming, buzzing and tingling and my entire field of vision became blocky with a sort of vibrant buzzing static all over it. The edges of my field of vision disappeared completely, turning black, and it was sort of comparable to a high dose of nitrous oxide; however the tingling sensation was múch more intense and my field of vision was a lot more disrupted while my thought process was actually clearer. I only felt the top layer of skin of my face and it seemed to come loose of where I felt my head should be. At this point I tried to blow my nose in an attempt to get some of the crystals out because after just one or two minutes the effects were already much more intense then I had planned for them to be at the peak of the experience. My face was the only part of my body that I could still feel and it seemed to have come loose completely and float a few centimeters in front of my where field of vision was; it started to mingle in with the massive amount of static that was progressively disturbing my vision which caused my only remaining sense of touch to be a square of buzzing vision floating in front of where my head should be. \r\n\r\nI tapped my then boyfriend and took the effort to say 'water' because without I wasn't capable of swallowing that huge layer of dry ketamine in my throat. We got up together and walked to the bar, parts of the room appeared to move with me and walking was quite a challenge since I couldn't feel any part of my body. At the bar my then boyfriend got me a bottle of water; while he was ordering I stood leaning with one arm on the bar; it hadn't been more then five or so minutes since the dosing error. Some stranger started talking to me and I was still capable of following conversation, I even managed to speak back and it wasn't even in dutch. I was so anaesthetized by this point in time that I couldn't even feel that my throat was uncomfortably full of ketamine and the stranger appeared to be friendly. Around this time my boyfriend returned with the water but I had already forgotten that I wanted water in the first place. Everything appeared to be really far away and my entire surroundings were moving in a sort of spinning motion without causing me to be dizzy. It also started to become much darker rapidly.\r\n\r\nFrom here on there's a hole in my memory of which I only remember brief flashes, parts of the events mentioned are based on what my then boyfriend told me had happened. Apparently the time I spent close to narcosis had only been around fifteen minutes; I do not know the order of these flashes of memory but to make it easier I'll add the chronology my boyfriend gave me after describing my own short bits of memory. I had nearly no vision at all; everything was just black, and sense of touch wasn't there at all; the only sensation I had was a mild spinning sensation. I couldn't hear any sounds even though I was at a loud and noisy free tekno party. I vaguely seemed to hear that someone asked me something but I couldn't make out what so I asked repeatedly: 'What?' 'What?' 'What?', it turned out the question was 'Are you ok?'. I was told that after around twenty times or more of repeating 'What?' I finally said 'Yes' in a very emotionless voice but I remember nothing of that. Apparently he suggested to go outside for a bit to which I apparently replied: 'Yes please!'; something I also do not remember. I remember that I felt something, but couldn't see it and that I asked whether it was water by simply asked: 'Is water?' to which I was replied by someone 'Yes is water'; I then even asked: 'Is my water?' to which I was again replied: 'Yes is your water'. Even so very anaesthetized I still payed attention to what I was consuming. I remember that even though I had no concept of discomfort anymore at the time it still made a positive difference seeing as all that time I still had the layer of dry crystals in my throat. \r\n\r\nI have only very very vague flashes of images because I could see close to nothing at all but I was told I had my eyes wide open the entire time, probably in some semi conscious attempt at orientation because the last thing I had been doing was concentrating as hard as I could not to loose my consciousness. What really had been happening is that my boyfriend at the time helped me walk outside by holding me around the waist and walking himself causing my feet to automatically move a bit; the steps were apparently extremely small ones, even with a lot of help I barely moved. Other than that I couldn't move at all and I could not stand or walk without help and no communication was possible, but he did manage to get me outside without trouble and there he put down his coat on the sidewalk and put me down to sit on it. I was apparently so dissociated that instead of sitting on the edge of the sidewalk I sat down right in front of it on the street. I was asked repeatedly whether I wouldn't prefer sitting on the edge of the sidewalk and as soon as I was asked that I'd sort of put my arms down as if I was going to push off to move, but I would not rise even a millimeter off the ground and I'd remain seated, probably thinking I had already moved. After about what is likely around five attempts I finally succeeded and this is around the point where my own memory formation started working again, although short term memory was still very much off.\r\n\r\nThe first thing I remember is that I was sitting outside. I looked ahead of me and saw what reminds me most of what I'd see on LSD and two or three whippits of nitrous but without the fractals or neon. I vaguely saw a sort of.. yeah street and with that came all for me sort of archetypical images of 'a street' and with that came all kinds of memories and associations with the concept of a street. I also saw myself, mostly my face, in the static that was covering this image and I remember that with that came a sort of analysis of what 'being' and 'being a person' is; either way I remember clearly that I saw myself; not overly detailed, but clearly in the images and that it was standing véry still with loads of static around it. At that time my vision was not yet moving around and véry slowly this strange incorrect image of a street that was mostly made up of what I consider archetypical for a street (it even contained images of a canal and I believe images of me walking by this canal, like the ones in the city center of Amsterdam, while there was absolutely no canal anywhere near me) started turning into a huge wall of a building and street lanterns. A lot of what I was seeing, looking back on it, was still not a match with where I actually was. I saw structures and parts of buildings that in reality weren't there, or at least looked significantly different, but my brain was trying its best to make something out of the spinning moving static buzzing chaos that I vaguely could perceive, but at least I understood from all of this that I was sitting outside. I remember trying to orientate myself but at this time that was still very difficult. I could not move, I didn't attempt to either though, and I had a really hard time trying to figure out where I was, because at this time I barely even knew whát I was. \r\n\r\nSomewhere around this time the realisation came back of 'I am a human, I am a human female, hmm I'm sitting down.. it appears that I am sitting on a street. Oh right I'm sitting outside on the street in front of a tekno party in an empty warehouse just at the edge of the city and I just took a lot of ketamine.. ah yes.' but often I'd loose parts of that realisation soon after, I would often forget I was on ketamine, or I would forget I was human and that would occasionally come back to me as a brief realisation.\r\n\r\nBy now I finally became somewhat capable of movement and I started looking around me, I've been told I was doing so for quite a while. Everything I saw kept spinning in the same direction, as if I were at the center of a spiral; everything would álmost move out of the edge of my field of vision completely and as soon as it did my vision would split up in two layers and one layer would slide over the other one and the moving layer would slide out of my vision entirely and the other one back in place and then it would start over again. The static by now looked like a sort of primitive psychedelic patterns that were also in a spiral around me. I also physically felt a mild sensation of spinning but it was actually very comfortable. In the distance I saw people; they left static non-moving afterimages in different shades of grey; starting dark close to the person and then lighter grey further away; a sort of fragmented tracers that would stay in their place. I could only see silhouettes; no faces or details. My boyfriend who was sitting right next to me I actually still could not see at all. Everything was still spinning apart in a spiral around me. Reality kept sliding apart in two or three layers; everything was moving but it kept moving in the same direction and occasionally my field of vision would completely disappear because it had slid away to one side (yes my vision field left my vision field, as weird as that may sound). \r\n\r\nIf I tried to focus on certain object, trying to see what was around me, often one of the mentioned layers would sort of stay in place and a double vision would appear but one of the doubles would be spinning around me and sliding further and further apart often leaving the edge of my vision and then a new layer would come off; this effect was most pronounced with objects close around me. I looked down and noticed that there was something black under me, either I looked at it with a surprised expression or I may have asked what it was; my then boyfriend R replied 'that is my coat, I put it down for you' to which I'm told I answered 'oh' and then several minutes later would again look at the ground very surprised wondering what the black thing was and R would explain again that it was his coat; this would happen quite a few times and the last time I was told about it being a coat I answered 'oh that's sweet' and I hugged him; I do not remember this myself. A while after this my hearing started coming back a bit and I noticed R was talking to someone. I found it a shame I wasn't capable of speech myself because I certainly did not have the motorics for that yet. I still felt absolutely no presence of my body at all but due to the height my eyes were on I could conclude I was sitting. I sat there listening to the conversation for a while; by now I remembered quite clearly and constantly who, what and where I was only my senses would still show very little of it and my vision was still very severely altered.\r\n\r\nI must note that what I saw was actually rather beautiful, the human silhouettes that I saw that had no detail or faces and the solid after images in different shades of grey (each person would have up to five or so copies of them as solid as the real person behind them and the after images would not move, the last one would just fade when a new one appeared), the coarse static patterns that were spinning around me as a massive spiral of which I was the center, the sliding apart of layers from the middle of my vision (that went far beyond 'double vision', which I tend to always have on ketamine even on low dosages), everything that was shining light was shining extremely bright and everything I was capable of seeing in a strange way seemed to be much more beautiful then normal; only trying to orientate myself was made very difficult this way. \r\n\r\nNormally on much lower doses of ketamine I can have beautiful closed eye visuals of surreal landscapes (usually also made up out of static but sometimes with sharp bits in it, also often landscapes drawn against a sky in natural colours, human shapes and sometimes masses made of body's, surreal tunnels I'd fly through, structures and other strange but interesting things that follow each other in weird orders and I for example see in a not very well lit room things projected over reality such as a gothic cathedral-like effect over my entire room with high portals or hanging see through fabric that aren't there that appear to me out of the darkest parts of the surroundings and I always enjoy the visual effects of ketamine very much (especially with eyes closed); but this was an accidental dose in the middle of a huge chaotic mass of people so I was mostly focused on trying to get a bit closer to reality instead of exploring the effects, which looking back on it I find quite a shame because what I remember was actually pretty spectacular; especially the almost impossible to explain experiences of júst realising that you exist and what existing is and those very first images I saw when I started making memories again (the archetypical street with canals and my own self walking through it, which I saw clearly with eyes wide open). I also regret that I do not remember everything; I think that if I would've been in an indoor quiet setting I would've had a much deeper experience then trying my best to hold on to a reality that my senses couldn't even process.\r\n\r\nAfter an unknown amount of time of listening to the conversation (I barely remember any words from it and apparently I even said one thing myself of which I was told it was correct but I do not remember what) I could at some point stand again; very wobly and unstable but I could stand up and walking on my own was also possible again. This is probably about an hour or more after the dosing. I still did not really speak and had a hard time doing so anyway, but I had been staring at the same tiny bit of street all that time and by now my vision wouldn't spin complete circles anymore; it had gotten back to double vision that would just slide apart a bit and I could finally feel a bit of my véry tingly buzzing anaesthetized body; thís was a level of intensity of ketamine that I was comfortable with; a very high but not yet k-hole dosage. We managed to find some of our friends back; I did not speak but I used hand signs to communicate; we smoked a joint with some friends and a bit later we got back to the place where earlier I had accidently overdosed myself. Here I shared my water with some other friends; I was still very strongly dissociated and I had very little if any concept of time and space and I was still quite disoriented but there was not a single trace of discomfort and I generally knew where I was and with so many familiar people around me this was not a problem at all. I still had a strong feeling that several timelines and dimensions of reality would be sliding over and through each other and occasionally still parts of my vision would just slide and rotate right of it. Optically things were still far away and even though I was up and walking I was still only barely aware of my body.\r\n\r\nAbout half an hour or even a full hour after that this dose of ketamine finally started wearing off a bit (total duration had been over two hours) and I took a normal line of racemic ketamine just to keep it at this level of effects.. This did not mess up my balance or memory and I actually got to exactly the right dose and by redosing every half an hour to an hour I kept that intensity of dissociation up to the end of the party (although until around six in the morning effects were a bit stronger then I'd normally do in a very crowded place.) \r\n\r\nSome time after this when I really had things clear mentally again and had taken the time to sort of analyse what had happened to be I decided to take a capsule with a bit of 2c-b; I only have one story worth mentioning from this; around the peak of the 2c-b trip, when I also just had taken two proper lines of ketamine, I was dancing with my eyes closed and as closed eye visual I saw a room of which the walls were spinning that was completely three dimensional in which I actually found myself; the walls were made of blue, orange and golden patterns and they were turning in and out of each other as a sort of fractal room; it was exactly a cross of what I'd see on ketamine or nitrous; a sort of perfect mix of both with the bright neon colours and sharp imaging of the 2c-b but the spacial moving and surreal formations of the ketamine; it was kind of like the 2c-b was like a colourful flashlight lighting up the ketamine visuals (I've had this effect more often on this combination in later trips; 2c-b can light up a k-hole insanely beautifully); this room I felt myself standing in with the colourful pattern walls gave me a very special feeling; somehow it was humbling but also intensely euphoric. When I opened my eyes again after five or so minutes I had to get used again to reality and the fact I was actually in a completely different place. I have had more nice patterning and visuals; often mixed in with the visual disturbances of the ketamine. The combination of 2c-b with ketamine can be very interesting; in this trip my dosage of 2c-b was rather low but I've had higher doses of 2c-b with decent doses of ketamine where reality would turn inside out and upside down and duplicate itself; the 2c-b makes it all bright and sharp and colourful but the ketamine does not lose its nature at all.\r\n\r\nIn retrospect\r\nI think / know that a large part of that dose was never absorbed in my nose (yet it went through it of course) but landed straight in my throat and probably much less then half of the dose was actually absorbed in my nose, possibly even less. The experience lasted much longer then ketamine normally lasts so I'm pretty sure that a large part was absorbed orally causing a stable plateau of around two hours after the peak. The peak was definitely way too much because there's fifteen to twenty minutes of my memory missing almost completely; probably the early part of the k-hole I woke up in was also because of the nasally absorbed bit. The first memories I have that are not just minor flashes are definitely a strong k-hole. I think that the peak was actually past k-hole into the direction of proper narcoses; at least briefly an I believe the only reason I was standing and is that I was stiff and just remained in the last pose I had been in (sort of standing / leaning with eyes open) until I finally had a place where I could safely sit (the only awareness I sort of had is that I had to go somewhere safe) and that is the part almost completely missing from my memory. I'm also pretty sure that I produced a lot of adrenaline when this happened because I was extremely worried the moment I realized I was going to loose my consciousness at a crowded rave. That possibly also kept me standing. \r\n\r\nRegaining consciousness was very similar to slowly getting out of a deep k-hole; with the very slow process of becoming aware of my surroundings that for a long time looked absolutely nothing like reality but would over the course of an hour become clearer; including the observing without normal consciousness and with no awareness of being for a moment and a type of visuals that reminded me mostly of doing a lot of nitrous while on ketamine only a whole step more intense and more detailed. After the fifteen or so minutes that are gone from my memory completely there was more then half an hour that still contained holes in my memory and even though that makes perfect sense with the NMDA system being involved in memory formation I still find that a shame because of how interesting the experience really was.\r\n\r\nI had not a single bit of discomfort at any point of the experience, not during and not after either except for the unpleasant sensation of having my throat covered in a thick layer of dry ketamine crystals which made my eyes tear, hurt a bit and made breathing and speech a bit more difficult for a while. Water fixed it though. There was no nausea at all (although I never get any with ketamine or any drug for that pattern). After the overdose, before effects had worn off, when it started feeling like a medium intensity dose I kept taking lines of racemic ketamine at least every hour and through that I never let the effect wear off as long as I was at the party; only towards the late morning I'd start taking lower doses making for a gradual and slow return to being sober. The rest of the night was very fun and relaxed and mostly filled with standing in front of the wall of speakers enjoying the bass, the visuals of the 2c-b, good conversations, some walks outside in the early daylight and all round euphoric party fun.\r\n\r\nObviously I'll never attempt dosing my ketamine by sticking a tube into the bag Obviously I'll never attempt dosing my ketamine by sticking a tube into the bag, espécially not if that bag contains two grams. The dosage taken was guessed based of how the bag looked before and after, but I'm pretty sure the bag contained between one and a half and two grams of ketamine and after the incident more then half was missing so around a gram is probably a pretty accurate guess. I did at the time already have a minor tolerance; not that much though and a gram would still last me several weeks at the time (by the time I'm translating this report due to taking close to daily then weekly for the past two years, a habit I as of today still have although I'm intending to cut down back to twice a month or so, tolerance has gone up quite a bit; I still get full effects but I can do several grams in an evening easily now ); still at the time of this experience it was low; I think the reason the overdose wasn't thát drastic is mostly because my nose can't absorb that much ketamine and most of it was taken orally because of that. My nostril did hurt for more then 24 hours after the dose; that was really the only negative side effect I noticed. \r\n\r\nBefore this experience I was always a little bit scared of going over the edge from very high dose to actual k-hole; mostly because I feared side effects, which I did not have at all; every single second of this was very comfortable. At the time I wrote the original report I was planning to enter a k-hole again soon (within a few weeks anyway) and then indoors with my eyes closed and a dose where I would remember most of the peak too; as you may guess I did so; starting that early summer marked the start of very extensive ketamine experimentation and finally addiction too which is still going as of today (2013). Another odd thing to experience for me was being helpless for a change because before this I really never was. Also this was at the time possibly the deepest psychoactive experience I had ever had (easily topped it since then though, especially in 2012...; but I'm writing this from the perspective of spring 2011 to not change the report too much); unfortunately most of this experience, especially how it felt psychologically, is really, really hard to describe and I believe that this report still does not give a good image of how it really felt but at least I tried. \r\n\r\n[Reported Dose: '50-100 mg of racemic ketamine at a time and one overdose of 750-1000 mg of S-ketamine later - 15 mg of 2c-b repeated hash often']\n\n\n\n\n\nExp Year: 2011ExpID: 99510\nGender: Female \nAge at time of experience: 21 \nPublished: Jul 29, 2015Views: 2,567\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n",
  "doses": [
    "repeated insufflated Ketamine (powder / crystals)",
    "750 mg insufflated Ketamine (powder / crystals)",
    "15 mg oral 2C-B (capsule)",
    "repeated smoked Cannabis - Hash"
  ]
}