{
  "text": "\n\n \n\n\n\n\t\n\t\t\n\t\t DOSE:\n\t\t   \n\t\t oral\n\t\t Pharms - Bupropion\n\t\t (daily)\n\t\t\n\t\t\n\t\t  \n\t\t 6 g\n\t\t oral\n\t\t Kratom\n\t\t (capsule)\n\t\t\n\n\n\n\t\n\t \n           BODY WEIGHT:\n\t   135 lb\n         \n\t\n\n\n\n\nSubstance: Red Rhino Indo powdered leaf Kratom\r\nDosage: 6 grams\r\n\r\nSubject: I am a 40-something female with a post-graduate education. I have an average build, am in good physical condition and have no medical problems.\r\n\r\nPreparation: loaded the powder into 00 caps myself and swallowed.\r\n\r\nSetting: Saturday afternoon, casually dressed, in my bedroom alone watching a movie.\r\n\r\nCurrent prescriptions: Wellbutrin,  taken as prescribed. No other substances were taken during this period.\r\n\r\nPrevious experience: casual Marijuana and Cocaine use in college, fairly frequent use of MDMA in my late 20s, social Alcohol and occasional Benzo use throughout adulthood, extensive Opiate use for the last 3 years, inlcuding hydrocodone, roxicodone, Oxycontin, Belladonna and Opium suppositories, and Butorphanol Tartrate nose spray. \r\n\r\nSeveral months ago I tapered myself off Opiates since my stash was running low and I know how bad withdrawals can be. Opiates give me more energy, a lot of social confidence,a sense of wellbeing, and most importantly, euphoria. So, I'm on a mission to find a legal substance that can replicate the feeling as closely as possible. I did a lot of researched and ordered Kratom online from a reputable vendor. I have tried a few strains...including Kalimatan Special Grade and Ultimate Enhanced Maeng Da. This experience was with Red Rhino Indo, which I documented at the time, and as I write this here I have taken 6 grams of Malaysian Green Vein. I initially took it by toss and wash, even though the taste is pretty bad. I switched to capping them because it was quicker and easier, although I believe it delays the onset of sensations.\r\n\r\n12:15pm  on an empty stomach, I took 6 grams of Kratom loaded myself into 00 caps. \r\n\r\n12:40pm  feeling moderate euphoria, less backache, my head feels light. Not as strong an effect as hydrocodone or oxycodone but the warm feeling is very similar. No nausea or itching or any negative effects. I feel totally content sitting here watching tv. It feels less like I'm watching it and thinking consciously about it, but more like I'm just absorbing it, if that makes sense. Like there isn't a lapse between thinking and experiencing.\r\n\r\n1:00pm same as above, in subtle waves. It's very pleasant just to sit still and feel the sensation in my body. Mood is euphoric. Body is relaxed, warm, airy. I decided to get up and do an activity to see what my energy level is.\r\n\r\n1:30pm  doing housework. Still feel light physically and mentally with a nice head buzz, but still able to enjoy performing tasks. I sat down for a minute and got distracted by wanting to just sit there and feel the waves of sensation. I reminded myself that I wanted to be active during the experience. Although I don't have problems doing it, it really feels better to sit and pay attention to my body. I have a slight ringing in my ear, not sure if it is related. I am surprised how close I feel to the whole-body warm, floaty, tingly, almost outside myself feeling I get from Opiates. No nausea, itching, headache, wobbly eyes, or other bothersome side effects. \r\n\r\n4:00pm close to the same but slowly wearing off.\r\n\r\nIt was a completely positive experience. I intentionally started with small doses and worked up to find the optimum dose without going over the edge and getting nauseated. This is the largest dose I've taken, and I may try to go a little higher but not much. Writing this now I am feeling almost the same but the the green vein is a little less sedating and more edgy. I am at times biting the inside of my lips, which is a nervous habit. With all the doses and strains I've tried, I've never had negative experiences or unpleasant side effects. I will definitely continue to use it.\n\n\n\n\n\nExp Year: 2013ExpID: 99898\nGender: Female \nAge at time of experience: 41 \nPublished: May 5, 2015Views: 8,440\n[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n\n\n\n\n",
  "doses": [
    "oral Pharms - Bupropion (daily)",
    "6 g oral Kratom (capsule)"
  ]
}